//R21AM0 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG1 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IGF201)
//SYSIN DD *
         PRINT OFF,NODATA
 IORMSCOM 1,1,1,1,350,SECT=C
     END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM0  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM1 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG2 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQGM01)
//SYSIN DD *
         PRINT OFF,NODATA
         IEAQGM N,N,N,1,1
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM1  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM2 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG3 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQPRT0)
//SYSIN DD *
         PRINT OFF,NODATA
         IEAQPR N,N,N
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM2  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM3 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG4 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAATR00)
//SYSIN DD *
         PRINT OFF,NODATA
         IEAQTR 200,0
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM3  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM4 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG5 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFQMSGV)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIEF0QM 12,180,60,2,50
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM4  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21TA5 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG7 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.DMACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQAT00)
//SYSIN DD *
     PRINT  OFF,NODATA
 IEAQAT NOSLICE,4,TTIME,FPREGS,1
    END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21TA5  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21TA6 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG9 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.DMACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQCH00)
//SYSIN DD *
     PRINT  OFF,NODATA
 IEAQCH NOSLICE,4,1
    END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21TA6  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21TA7 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG11 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.DMACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQET00)
//SYSIN DD *
     PRINT  OFF,NODATA
 IEAQET NOSLICE,1
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21TA7  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM8 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG12 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQBK00)
//SYSIN DD *
         PRINT OFF,NODATA
        IEAQBK 15,,                                        XXXXXXXXXXXXXXX
               ,                                              XXXXXXXXXX
               (0,0,                                            XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0),0,         MP65                               XXXXXXXX
               1,                      19022                    XXXXXXXXX
               FLAG=226,FLAGB=32,           20071                  XXXXXXXXXX
               PATCH=YES,RPS=YES,WARN=0
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM8  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM9 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG13 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IGC018)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIEC0DT YES,YES,1,TYPE=(0,0,0,0,0,0,0,1,1)
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM9  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM10 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG14 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEEVIPL)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIEE00V ,,,,,,,,,L,10,1,1,100
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM10  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM11 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG15 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEE3203D)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIEE0VR 1,1,0,1,0
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM11  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM12 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG16 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEECVUCM)
//SYSIN DD *
         PRINT OFF,NODATA
IEEUCMC CSECT
 IEECUCM (0C0,                                                         X
               01F,                                                    X
               01E),                                                   X
               (61,                                                    X
               01,                                                     X
               21),                                                    X
               (WAXA,                                                  R
               WAXN,                                                   A
               WNXN),U,                                                X
               (E,                                                     X
               0,                                                      X
               0),                          S21003                    XX
               (F,                          S21003                    XX
               F,                           S21003                    XX
               F),REPLY=20,BUFFERS=100, 21003                       XXXXXXXXX
               MCS=MCS,                                                I
               MASTCON=0C0,                                            C
               ROUTCDE=(FFFF,                                          E
               FFFF,                                                   R
               0000),                                                  A
               HARDCDE=FFFF,                                           D
               OLDWCDE=0000,                                           I
               ALTCON=(01F,                                            C
               0C0,                                                    X
               0C0),                                                   X
               HARDCPY=(01E,STCMDS,HCPY),                        XXXXXXXXX
               AUTH=(E0,                                               X
               E0,                                                     X
               00),                                                    X
               COMPCON=(FFF,                                           X
               FFF,                                                    H
               FFF),                                                   O
               ALTCOMP=(FFF,                                           H
               FFF,                                                    E
               FFF)
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM12  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM13 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG17 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEACVTPC)
//SYSIN DD *
         PRINT OFF,NODATA
 IEACVTPC   I,02,46,C,1,1,1
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM13  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM14 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG18 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(DCM0C0)
//SYSIN DD *
         PRINT OFF,NODATA
DCM0C0 CSECT
         IEECHCB USE=FC
  END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM14  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM15 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG19 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEECVH1)
//SYSIN DD *
         PRINT OFF,NODATA
IEECVH1   CSECT
      IEECRDCM DEV=E,                                            CCCCCCCCCCC
               KEY=IEECVK0,                                      CCCCCCCCCCC
               A=(8,                                                CATCHALL
               ),                                                    XXXXXXXX
               T=T1
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM15  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM16 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG20 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEECVSUB)
//SYSIN DD *
         PRINT OFF,NODATA
IEECVSUB CSECT
 IEECSUB 1,1,,Y,,,,PFK=12
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM16  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM17 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG21 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEECVT1)
//SYSIN DD *
         PRINT OFF,NODATA
IEECVT1 CSECT
     DC   3D'0'
 DC  V(IEECVSUB)
 DC  F'0'
   IEECHCB
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM17  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM18 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG22 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEEPFKEY)
//SYSIN DD *
         PRINT OFF,NODATA
IEEPFKEY CSECT
   DC  A(KEY)
    DC  (1)X'00000000000000000000'
KEY DC  AL2(ENDPFK-IEEPFKEY)
    DC  H'0'
        ENTRY IEECVK0
IEECVK0 EQU  *
         DC    FL1'1'
         DC    X'00'
         DC    108C' '
         DC    FL1'2'
         DC    X'00'
         DC    108C' '
         DC    FL1'3'
         DC    X'00'
         DC    108C' '
         DC    FL1'4'
         DC    X'00'
         DC    108C' '
         DC    FL1'5'
         DC    X'00'
         DC    108C' '
         DC    FL1'6'
         DC    X'00'
         DC    108C' '
         DC    FL1'7'
         DC    X'00'
         DC    108C' '
         DC    FL1'8'
         DC    X'00'
         DC    108C' '
         DC    FL1'9'
         DC    X'00'
         DC    108C' '
         DC    FL1'10'
         DC    X'00'
         DC    108C' '
         DC    FL1'11'
         DC    X'00'
         DC    108C' '
         DC    FL1'12'
         DC    X'00'
         DC    108C' '
          DC   FL1'100'
ENDPFK EQU *
  END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM18  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM19 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG23 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IFBCTA00)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIFC000 6777000700000000
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM19  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM20 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG24 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFSGOPT)
//SYSIN DD *
         PRINT OFF,NODATA
    SGIEF002  0,0,0,0,0,0,0,0,0,0,0,                                   X
               0,0,1,0,1,0,0,0,0,0,2
    END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM20  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM21 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG25 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFYRCDS)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIEF060 NE=(0000000000000000000,                                     X
               000000000000000000,                             XXXXXXXXXXXXXXXX
               00000000000)                                           X
    END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM21  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM22 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG26 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(UCSIMAGE)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIEC0UC  (AN,D,                                          XXXXXXXXXXXXXXXXX
               PN,D,                                        XXXXXXXXXXXXXXXX
               TN,D,                                        XXXXXXXXXXXXXXXX
               P11,D,                                        XXXXXXXXXXXXXXXX
               T11,D)
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM22  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM23 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG27 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEWLM128)
//SYSIN DD *
         PRINT OFF,NODATA
 TITLE 'IEWLMDEF   F128  EDITOR DEFAULT SIZE PARAMETERS '
         SGIEW001  VAL1=131072,VAL2=18432,DPVAL=131072
         IHBRELNO
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM23  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM24 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG28 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEK201)
//SYSIN DD *
         PRINT OFF,NODATA
         SGIEK001   OPTN=0,MAP=0,TYPE=1,PNCH=0,OBLST=0,CODE=0,         *
               SRLST=1,LINCNT=50,SZE=262144,ID=0,EDIT=0,XREF=0
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM24  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM25 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG29 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEY201)
//SYSIN DD *
         PRINT OFF,NODATA
         SGIEY001   50,0,1,0,0,0,1,0
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM25  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM26 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG30 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEK205)
//SYSIN DD *
         PRINT OFF,NODATA
         SGIEK005   8,6,5,6,7,6,5,7
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM26  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM27 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG31 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEK206)
//SYSIN DD *
         PRINT OFF,NODATA
    SGIEK006  0,0,1
    END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM27  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM28 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG32 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEPCBL00)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIEP000 0,0,0,0,60,176,0
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM28  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM29 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG33 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKFCBL01)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIKF000 1,0,1,1,1,1,00,                                              X
               60,2768,81920,1,0,0,0,0,0,0,1
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM29  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM30 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG34 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEXCWKA)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIEX001 0,0,0,0,0,45056
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM30  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM31 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG35 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEMAF)
//SYSIN DD *
         PRINT OFF,NODATA
AF       TITLE 'OS 360 PL/I(F) COMPILER , IEMAF'
IEMAF    CSECT
*                  DEFAULT BITS
         DC    B'01011001'
         DC    B'01100011'
         DC    B'00110100'
         DC    B'10000011'
         DC    B'00101011'
         DC    B'00101010'
         DC    B'00001000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    F'50'
         DC    F'999999'
         DC    F'2'
         DC    F'72'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         END   IEMAF
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM31  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM32 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG36 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IERAM1)
//SYSIN DD *
         PRINT OFF,NODATA
 SGIER001 65536,16
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM32  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM33 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG37 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEWLDDEF)
//SYSIN DD *
         PRINT OFF,NODATA
         SGIEW050 FLAG=(1,0,1,0,0),SIZE=102400,                      XXXXXXXX
               LIN=SYSLIN,PRINT=SYSLOUT,LIB=SYSLIB
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM33  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM34 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG38 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEASVC00)
//SYSIN DD *
         PRINT OFF,NODATA
 ENTRY USERORG
IBMORG   CSECT
 DC X'00',VL3(IGC000),X'00',VL3(IGC001),X'00',VL3(IGC002)
 DC X'00',VL3(IGC003),X'00',VL3(IGC004),X'00',VL3(IGC005)
 DC X'80',VL3(IGC006),X'80',VL3(IGC007),X'80',VL3(IGC008)
 DC X'80',VL3(IGC009),X'00',VL3(IGC010),X'00',VL3(IGC011)
 DC X'80',VL3(IGC012),X'C0',AL3(0),X'80',VL3(IGC014)
 DC X'00',VL3(IGC015),X'80',VL3(IGC016),X'C0',AL3(0)
 DC X'80',VL3(IGC018),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'80',VL3(IGC037),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'00',VL3(IGC040),X'80',VL3(IGC041)
 DC X'80',VL3(IGC042),X'80',VL3(IGC043),X'00',VL3(IGC044)
 DC X'80',VL3(IGC045),X'00',VL3(IGC046),X'80',VL3(IGC047)
 DC X'80',VL3(IGC048),X'00',VL3(IGCERROR),X'00',AL3(IGCRETRN)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'80',VL3(IGC054),X'C0',AL3(0),X'80',VL3(IGC056)
 DC X'C0',AL3(0),X'00',VL3(IGC058),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'80',VL3(IGC062)
 DC X'C0',AL3(0),X'C0',AL3(0),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'00',VL3(IGCERROR),X'C0',AL3(0)
 DC X'C0',AL3(0),X'80',VL3(IGC070),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'C0',AL3(0),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'00',VL3(IGC079),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'00',VL3(IGC084),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'C0',AL3(0),X'00',VL3(IGC092)
 DC X'C0',AL3(0),X'C0',AL3(0),X'00',AL3(IGCRETRN)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'00',AL3(IGCRETRN)
 DC X'00',VL3(IGC102),X'80',VL3(IGC103),X'C0',AL3(0)
 DC X'C0',AL3(0),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'80',VL3(IGC109),X'C0',AL3(0)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGC116)
 DC X'80',VL3(IGC117)
USERORG  DS    0F
 DC X'00',VL3(IGC220),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
IGCRETRN SR    15,15
         BR    14
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM34  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21TA35 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG40 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.DMACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQNU00)
//SYSIN DD *
     PRINT  OFF,NODATA
 IEAQNU  JSTIME,158,MCH,117,220,TRACE,0,                              XXXXXXXXX
               0,0,0,1,EMUN,1,1,1,1
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21TA35  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM36 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG41 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAANIP0)
//SYSIN DD *
         PRINT OFF,NODATA
IEAANIP0  START
 IEAANIP 1,1,4,1,117,220,0,1,1,1,                                   XXXXXXX
               0,0C00C0,01F01F,1,                             *****************
               0,                                         *****************
               200,                                         *****************
               24,                                         *****************
               52,                                         *****************
               0,                                         *****************
               100000,                                            *************
               0,                                        *****************
               0,                                        *****************
               1,                                        *****************
               0,                                         *****************
               1,                                        *****************
               0,                                        *****************
               580000000000,                                           *********
               000000000000,                                           *********
               000000000000,                                           *********
               0,                                           **************
               ,                                          **************
               ,                                          **************
               1,                                          **************
               0,                                            *************
               0,                                          **************
               01E,                                              **************
               1,                                          **************
               1,                                          **************
               1,                                        *****************
               1,                                        *****************
               0,                                        *****************
               0158,                                                   *
               0,                                                      *
               1,                                                      *
               1,                                                      *
               48,                                               ********
               1,                           BH 61205        ************
               1,                                                      *
               0
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM36  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM37 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG42 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAASU00)
//SYSIN DD *
         PRINT OFF,NODATA
 IEAQFX 158,MCH,0,1,GENCODE=YES
         AGO   .GBL      SET UP GLOBALS
.IOSTART ENTRY IECIOS
IECIOS  DS  0D
         ITLPCSIM TYPE=FULL,CTRLPGM=MVT
   AGO   .UCB1   TO ASSEMBLE FIRST UCB
.RQE  ANOP
 IECIOQE 10,1,2,1
         AGO   .IECIOS
.TAB1   ANOP         LOOK UP UCB TAB
UCBTAB   DS    0C         THIS IS THE LOOK UP TAB
IECILK1  DS    0C
 IECULK1 30,0,0,0,0,0,1
         AGO   .TAB2     TO NEXT CHANNEL ENTRY
.TCU1   IECULK2 22,0,0,30,1,0,1
         AGO   .TCU2       TO NEXT ENTRY
.LST1 ANOP   UCB LOOKUP ENTRY
LIST     DS    0H       THIS IS THE LIST OF UCB ADDS
IECILK2  DS    0C
         AGO   .LST2
.LST2 IECULK3 0,11,1,1,22,0,0,0,0,1
         AGO   .LST3    TO NEXT UCB ADD RNTRY
.UCB1 ANOP
  IECIUCB 1,00B,UR,0,05,1,0,,50010805,0,0,0,0,,0,0,0,00B,0
         AGO   .UCB2      TO NEXT UCB
.LST3 IECULK3 11,12,2,0,0,0,0,0,0,1
         AGO   .LST4    TO NEXT UCB ADD RNTRY
.UCB2 ANOP
  IECIUCB 2,00C,UR,0,0D,2,0,,10000801,0,0,0,0,,0,0,0,00C,0
         AGO   .UCB3      TO NEXT UCB
.LST4 IECULK3 12,13,3,0,0,0,0,0,0,1
         AGO   .LST5    TO NEXT UCB ADD RNTRY
.UCB3 ANOP
  IECIUCB 3,00D,UR,0,0D,3,0,,10000802,0,0,0,0,,0,0,0,00D,0
         AGO   .UCB4      TO NEXT UCB
.LST5 IECULK3 13,14,4,0,0,0,0,0,0,1
         AGO   .LST6    TO NEXT UCB ADD RNTRY
.UCB4 ANOP
  IECIUCB 4,00E,UR,0,07,4,0,,10800808,8,0,0,0,,0,0,0,00E,0
         AGO   .UCB5      TO NEXT UCB
.WK1 IECIUCBA 4,10800808,0,0,0,0,0,0
         AGO   .WK2   TO NEXT WORK AREA
.TCU2   IECULK2 30,0,1,30,0,0,0
         AGO   .TCU3       TO NEXT ENTRY
.LST6 IECULK3 14,0,5,1,30,0,0,0,0,0
         AGO   .LST7    TO NEXT UCB ADD RNTRY
.UCB5 ANOP
  IECIUCB 5,010,WR,8,06,5,0,,10800809,8,0,0,0,,0,0,0,010,0
         AGO   .UCB6      TO NEXT UCB
.WK2 IECIUCBA 5,10800809,0,0,0,0,0,0
         AGO   .WK3   TO NEXT WORK AREA
.LST7 IECULK3 0,14,6,0,30,0,0,0,0,0
         AGO   .LST8    TO NEXT UCB ADD RNTRY
.UCB6 ANOP
  IECIUCB 6,01E,UR,0,07,6,0,,10800808,8,0,0,0,,0,0,0,01E,0
         AGO   .UCB7      TO NEXT UCB
.WK3 IECIUCBA 6,10800808,0,0,0,0,0,0
         AGO   .WK4   TO NEXT WORK AREA
.LST8 IECULK3 14,15,7,0,30,0,0,0,0,0
         AGO   .LST9    TO NEXT UCB ADD RNTRY
.UCB7 ANOP
  IECIUCB 7,01F,UR,0,04,7,0,,10000823,0,0,0,0,,0,0,0,01F,0
         AGO   .UCB8      TO NEXT UCB
.WK4 IECIUCBA 7,10000823,0,0,0,0,0,0
         AGO   .WK5   TO NEXT WORK AREA
.TCU3   IECULK2 62,1,12,30,0,0,0
         AGO   .TCU4       TO NEXT ENTRY
.LST9 IECULK3 15,0,8,1,62,0,0,0,0,0
         AGO   .LST10    TO NEXT UCB ADD RNTRY
.UCB8   ANOP       UCB ENTRY
 IECIUCB 8,0C0,GR,16,69,8,0,1,12301009,0,0,0,0,1,0000
         AGO   .UCB9      TO NEXT UCB
.LST10 IECULK3 0,1,9,0,62,0,0,0,0,0
         AGO   .LST11    TO NEXT UCB ADD RNTRY
.UCB9   ANOP       UCB ENTRY
 IECIUCB 9,0C1,GR,16,69,9,0,2,12301009,0,0,0,0,1,0000
         AGO   .UCB10      TO NEXT UCB
.LST11 IECULK3 1,2,10,0,62,0,0,0,0,0
         AGO   .LST12    TO NEXT UCB ADD RNTRY
.UCB10   ANOP       UCB ENTRY
 IECIUCB 10,0C2,GR,16,69,10,0,3,12301009,0,0,0,0,1,0000
         AGO   .UCB11      TO NEXT UCB
.LST12 IECULK3 2,3,11,0,62,0,0,0,0,0
         AGO   .LST13    TO NEXT UCB ADD RNTRY
.UCB11   ANOP       UCB ENTRY
 IECIUCB 11,0C3,GR,16,69,11,0,4,12301009,0,0,0,0,1,0000
         AGO   .UCB12      TO NEXT UCB
.LST13 IECULK3 3,4,12,0,62,0,0,0,0,0
         AGO   .LST14    TO NEXT UCB ADD RNTRY
.UCB12   ANOP       UCB ENTRY
 IECIUCB 12,0C4,GR,16,69,12,0,5,12301009,0,0,0,0,1,0000
         AGO   .UCB13      TO NEXT UCB
.LST14 IECULK3 4,5,13,0,62,0,0,0,0,0
         AGO   .LST15    TO NEXT UCB ADD RNTRY
.UCB13   ANOP       UCB ENTRY
 IECIUCB 13,0C5,GR,16,69,13,0,6,12301009,0,0,0,0,1,0000
         AGO   .UCB14      TO NEXT UCB
.LST15 IECULK3 5,6,14,0,62,0,0,0,0,0
         AGO   .LST16    TO NEXT UCB ADD RNTRY
.UCB14   ANOP       UCB ENTRY
 IECIUCB 14,0C6,GR,16,69,14,0,7,12301009,0,0,0,0,1,0000
         AGO   .UCB15      TO NEXT UCB
.LST16 IECULK3 6,7,15,0,62,0,0,0,0,0
         AGO   .LST17    TO NEXT UCB ADD RNTRY
.UCB15   ANOP       UCB ENTRY
 IECIUCB 15,0C7,GR,16,69,15,0,8,12301009,0,0,0,0,1,0000
         AGO   .UCB16      TO NEXT UCB
.SRCH1  ANOP         CHAN SEARCH FOR MPX
    IECICS 0,0,0,,0,0,0,0,0,(0,0,0,0)
         AGO   .SRCH2     TO NEXT SEARCH
.TCH1   ANOP       TCH FOR MPX
         IECXTCH 1,0,0,,0,1,1,0,0,0
         AGO   .TCH2     TO NEXT TXH
.TAB2   ANOP         LOOK UP UCB TAB
 IECULK1 40,0,1,0,0,1,1
         AGO   .TAB3     TO NEXT CHANNEL ENTRY
.TCU4   IECULK2 78,12,3,40,1,0,0
         AGO   .TCU5       TO NEXT ENTRY
.LST17 IECULK3 7,0,16,1,78,0,1,0,1,0
         AGO   .LST18    TO NEXT UCB ADD RNTRY
.UCB16 ANOP
  IECIUCB 16,130,DA,24,01,16,1,,30C02008,0,0,0,0,,0,0,0,130,0
         AGO   .UCB17      TO NEXT UCB
.WK5 IECIUCBA 16,30C02008,0,0,0,0,0,0
         AGO   .WK6   TO NEXT WORK AREA
.LST18 IECULK3 0,1,17,0,78,0,1,1,1,0
         AGO   .LST19    TO NEXT UCB ADD RNTRY
.UCB17 ANOP
  IECIUCB 17,131,DA,24,01,16,1,,30C02008,0,0,0,0,,0,0,0,131,0
         AGO   .UCB18      TO NEXT UCB
.WK6 IECIUCBA 17,30C02008,0,0,0,0,0,0
         AGO   .WK7   TO NEXT WORK AREA
.LST19 IECULK3 1,2,18,0,78,0,1,2,1,0
         AGO   .LST20    TO NEXT UCB ADD RNTRY
.UCB18 ANOP
  IECIUCB 18,132,DA,24,01,16,1,,30C02008,0,0,0,0,,0,0,0,132,0
         AGO   .UCB19      TO NEXT UCB
.WK7 IECIUCBA 18,30C02008,0,0,0,0,0,0
         AGO   .WK8   TO NEXT WORK AREA
.LST20 IECULK3 2,3,19,0,78,0,1,3,1,0
         AGO   .LST21    TO NEXT UCB ADD RNTRY
.UCB19 ANOP
  IECIUCB 19,133,DA,24,01,16,1,,30C02008,0,0,0,0,,0,0,0,133,0
         AGO   .UCB20      TO NEXT UCB
.WK8 IECIUCBA 19,30C02008,0,0,0,0,0,0
         AGO   .WK9   TO NEXT WORK AREA
.LST21 IECULK3 3,4,20,0,78,0,1,4,1,0
         AGO   .LST22    TO NEXT UCB ADD RNTRY
.UCB20 ANOP
  IECIUCB 20,134,DA,24,01,16,1,,30C02008,0,0,0,0,,0,0,0,134,0
         AGO   .UCB21      TO NEXT UCB
.WK9 IECIUCBA 20,30C02008,0,0,0,0,0,0
         AGO   .WK10   TO NEXT WORK AREA
.LST22 IECULK3 4,5,21,0,78,0,1,5,1,0
         AGO   .LST23    TO NEXT UCB ADD RNTRY
.UCB21 ANOP
  IECIUCB 21,135,DA,24,01,16,1,,30C02008,0,0,0,0,,0,0,0,135,0
         AGO   .UCB22      TO NEXT UCB
.WK10 IECIUCBA 21,30C02008,0,0,0,0,0,0
         AGO   .WK11   TO NEXT WORK AREA
.LST23 IECULK3 5,6,22,0,78,0,1,6,1,0
         AGO   .LST24    TO NEXT UCB ADD RNTRY
.UCB22 ANOP
  IECIUCB 22,136,DA,24,01,16,1,,30C02008,0,0,0,0,,0,0,0,136,0
         AGO   .UCB23      TO NEXT UCB
.WK11 IECIUCBA 22,30C02008,0,0,0,0,0,0
         AGO   .WK12   TO NEXT WORK AREA
.LST24 IECULK3 6,7,23,0,78,0,1,7,1,0
         AGO   .LST25    TO NEXT UCB ADD RNTRY
.UCB23 ANOP
  IECIUCB 23,137,DA,24,01,16,1,,30C02008,0,0,0,0,,0,0,0,137,0
         AGO   .UCB24      TO NEXT UCB
.WK12 IECIUCBA 23,30C02008,0,0,0,0,0,0
         AGO   .WK13   TO NEXT WORK AREA
.TCU5   IECULK2 94,3,5,40,0,0,0
         AGO   .TCU6       TO NEXT ENTRY
.LST25 IECULK3 7,0,24,1,94,0,1,8,1,0
         AGO   .LST26    TO NEXT UCB ADD RNTRY
.UCB24 ANOP
  IECIUCB 24,150,ML,32,01,25,1,,30502009,8,0,0,0,,0,0,0,150,0
         AGO   .UCB25      TO NEXT UCB
.WK13 IECIUCBA 24,30502009,0,0,0,0,0,0
         AGO   .WK14   TO NEXT WORK AREA
.LST26 IECULK3 0,1,25,0,94,0,1,8,1,0
         AGO   .LST27    TO NEXT UCB ADD RNTRY
.UCB25 ANOP
  IECIUCB 25,151,ML,32,01,25,1,,30502009,8,0,0,0,,0,0,0,151,0
         AGO   .UCB26      TO NEXT UCB
.WK14 IECIUCBA 25,30502009,0,0,0,0,0,0
         AGO   .WK15   TO NEXT WORK AREA
.LST27 IECULK3 1,2,26,0,94,0,1,8,1,0
         AGO   .LST28    TO NEXT UCB ADD RNTRY
.UCB26 ANOP
  IECIUCB 26,152,ML,32,01,25,1,,30502009,8,0,0,0,,0,0,0,152,0
         AGO   .UCB27      TO NEXT UCB
.WK15 IECIUCBA 26,30502009,0,0,0,0,0,0
         AGO   .WK16   TO NEXT WORK AREA
.LST28 IECULK3 2,3,27,0,94,0,1,8,1,0
         AGO   .LST29    TO NEXT UCB ADD RNTRY
.UCB27 ANOP
  IECIUCB 27,153,ML,32,01,25,1,,30502009,8,0,0,0,,0,0,0,153,0
         AGO   .UCB28      TO NEXT UCB
.WK16 IECIUCBA 27,30502009,0,0,0,0,0,0
         AGO   .WK17   TO NEXT WORK AREA
.LST29 IECULK3 3,4,28,0,94,0,1,8,1,0
         AGO   .LST30    TO NEXT UCB ADD RNTRY
.UCB28 ANOP
  IECIUCB 28,154,ML,32,01,25,1,,30502009,8,0,0,0,,0,0,0,154,0
         AGO   .UCB29      TO NEXT UCB
.WK17 IECIUCBA 28,30502009,0,0,0,0,0,0
         AGO   .WK18   TO NEXT WORK AREA
.LST30 IECULK3 4,5,29,0,94,0,1,8,1,0
         AGO   .LST31    TO NEXT UCB ADD RNTRY
.UCB29 ANOP
  IECIUCB 29,155,ML,32,01,25,1,,30502009,8,0,0,0,,0,0,0,155,0
         AGO   .UCB30      TO NEXT UCB
.WK18 IECIUCBA 29,30502009,0,0,0,0,0,0
         AGO   .WK19   TO NEXT WORK AREA
.LST31 IECULK3 5,6,30,0,94,0,1,8,1,0
         AGO   .LST32    TO NEXT UCB ADD RNTRY
.UCB30 ANOP
  IECIUCB 30,156,ML,32,01,25,1,,30502009,8,0,0,0,,0,0,0,156,0
         AGO   .UCB31      TO NEXT UCB
.WK19 IECIUCBA 30,30502009,0,0,0,0,0,0
         AGO   .WK20   TO NEXT WORK AREA
.LST32 IECULK3 6,7,31,0,94,0,1,8,1,0
         AGO   .LST33    TO NEXT UCB ADD RNTRY
.UCB31 ANOP
  IECIUCB 31,157,ML,32,01,25,1,,30502009,8,0,0,0,,0,0,0,157,0
         AGO   .UCB32      TO NEXT UCB
.WK20 IECIUCBA 31,30502009,0,0,0,0,0,0
         AGO   .WK21   TO NEXT WORK AREA
.TCU6   IECULK2 110,5,6,40,0,0,0
         AGO   .TCU7       TO NEXT ENTRY
.LST33 IECULK3 7,0,32,1,110,0,1,8,1,0
         AGO   .LST34    TO NEXT UCB ADD RNTRY
.UCB32 ANOP
  IECIUCB 32,160,ML,32,01,26,1,,30502009,8,0,0,0,,0,0,0,160,0
         AGO   .UCB33      TO NEXT UCB
.WK21 IECIUCBA 32,30502009,0,0,0,0,0,0
         AGO   .WK22   TO NEXT WORK AREA
.LST34 IECULK3 0,1,33,0,110,0,1,8,1,0
         AGO   .LST35    TO NEXT UCB ADD RNTRY
.UCB33 ANOP
  IECIUCB 33,161,ML,32,01,26,1,,30502009,8,0,0,0,,0,0,0,161,0
         AGO   .UCB34      TO NEXT UCB
.WK22 IECIUCBA 33,30502009,0,0,0,0,0,0
         AGO   .WK23   TO NEXT WORK AREA
.LST35 IECULK3 1,2,34,0,110,0,1,8,1,0
         AGO   .LST36    TO NEXT UCB ADD RNTRY
.UCB34 ANOP
  IECIUCB 34,162,ML,32,01,26,1,,30502009,8,0,0,0,,0,0,0,162,0
         AGO   .UCB35      TO NEXT UCB
.WK23 IECIUCBA 34,30502009,0,0,0,0,0,0
         AGO   .WK24   TO NEXT WORK AREA
.LST36 IECULK3 2,3,35,0,110,0,1,8,1,0
         AGO   .LST37    TO NEXT UCB ADD RNTRY
.UCB35 ANOP
  IECIUCB 35,163,ML,32,01,26,1,,30502009,8,0,0,0,,0,0,0,163,0
         AGO   .UCB36      TO NEXT UCB
.WK24 IECIUCBA 35,30502009,0,0,0,0,0,0
         AGO   .WK25   TO NEXT WORK AREA
.LST37 IECULK3 3,4,36,0,110,0,1,8,1,0
         AGO   .LST38    TO NEXT UCB ADD RNTRY
.UCB36 ANOP
  IECIUCB 36,164,ML,32,01,26,1,,30502009,8,0,0,0,,0,0,0,164,0
         AGO   .UCB37      TO NEXT UCB
.WK25 IECIUCBA 36,30502009,0,0,0,0,0,0
         AGO   .WK26   TO NEXT WORK AREA
.LST38 IECULK3 4,5,37,0,110,0,1,8,1,0
         AGO   .LST39    TO NEXT UCB ADD RNTRY
.UCB37 ANOP
  IECIUCB 37,165,ML,32,01,26,1,,30502009,8,0,0,0,,0,0,0,165,0
         AGO   .UCB38      TO NEXT UCB
.WK26 IECIUCBA 37,30502009,0,0,0,0,0,0
         AGO   .WK27   TO NEXT WORK AREA
.LST39 IECULK3 5,6,38,0,110,0,1,8,1,0
         AGO   .LST40    TO NEXT UCB ADD RNTRY
.UCB38 ANOP
  IECIUCB 38,166,ML,32,01,26,1,,30502009,8,0,0,0,,0,0,0,166,0
         AGO   .UCB39      TO NEXT UCB
.WK27 IECIUCBA 38,30502009,0,0,0,0,0,0
         AGO   .WK28   TO NEXT WORK AREA
.LST40 IECULK3 6,7,39,0,110,0,1,8,1,0
         AGO   .LST41    TO NEXT UCB ADD RNTRY
.UCB39 ANOP
  IECIUCB 39,167,ML,32,01,26,1,,30502009,8,0,0,0,,0,0,0,167,0
         AGO   .UCB40      TO NEXT UCB
.WK28 IECIUCBA 39,30502009,0,0,0,0,0,0
         AGO   .WK29   TO NEXT WORK AREA
.TCH2    ANOP   TEST CHANNEL
    IECXTCH 2,1,(1,0,0,0,0,                                           *****
               0,0,0,0,0,0,                                          ******
               0,0,0,0),(0,0,0,0),0,1,1,0,1,1
         AGO   .TCH3      TO NEXT TCH MOD
.SRCH2  ANOP       CHANNEL SEARCH MOD2
               IECICS 1,8,0,                                 ************
               (1,                            I267                 ********
               1,1,         I267                                       *
               0),0,0,0,0,1,(0,0,0,0),0
         AGO   .SRCH3     TO NEXT CHAN SRCH MOD
.TAB3   ANOP         LOOK UP UCB TAB
 IECULK1 39,1,2,0,0,1,1
         AGO   .TAB4     TO NEXT CHANNEL ENTRY
.TCU7   IECULK2 126,6,8,39,1,0,0
         AGO   .TCU8       TO NEXT ENTRY
.LST41 IECULK3 7,0,40,1,126,0,2,0,0,0
         AGO   .LST42    TO NEXT UCB ADD RNTRY
.UCB40 ANOP
  IECIUCB 40,280,AT,40,09,27,2,,34008003,24,0,0,0,,0,0,0,280,0
         AGO   .UCB41      TO NEXT UCB
.WK29 IECIUCBA 40,34008003,0,0,0,0,0,0
         AGO   .WK30   TO NEXT WORK AREA
.LST42 IECULK3 0,1,41,0,126,0,2,1,0,0
         AGO   .LST43    TO NEXT UCB ADD RNTRY
.UCB41 ANOP
  IECIUCB 41,281,AT,40,09,29,2,,34008003,24,0,0,0,,0,0,0,281,0
         AGO   .UCB42      TO NEXT UCB
.WK30 IECIUCBA 41,34008003,0,0,0,0,0,0
         AGO   .WK31   TO NEXT WORK AREA
.LST43 IECULK3 1,2,42,0,126,0,2,2,0,0
         AGO   .LST44    TO NEXT UCB ADD RNTRY
.UCB42 ANOP
  IECIUCB 42,282,AT,40,09,31,2,,34008003,24,0,0,0,,0,0,0,282,0
         AGO   .UCB43      TO NEXT UCB
.WK31 IECIUCBA 42,34008003,0,0,0,0,0,0
         AGO   .WK32   TO NEXT WORK AREA
.LST44 IECULK3 2,3,43,0,126,0,2,3,0,0
         AGO   .LST45    TO NEXT UCB ADD RNTRY
.UCB43 ANOP
  IECIUCB 43,283,AT,40,09,33,2,,34008003,24,0,0,0,,0,0,0,283,0
         AGO   .UCB44      TO NEXT UCB
.WK32 IECIUCBA 43,34008003,0,0,0,0,0,0
         AGO   .WK33   TO NEXT WORK AREA
.LST45 IECULK3 3,4,44,0,126,0,2,4,0,0
         AGO   .LST46    TO NEXT UCB ADD RNTRY
.UCB44 ANOP
  IECIUCB 44,284,AT,40,09,35,2,,34008003,24,0,0,0,,0,0,0,284,0
         AGO   .UCB45      TO NEXT UCB
.WK33 IECIUCBA 44,34008003,0,0,0,0,0,0
         AGO   .WK34   TO NEXT WORK AREA
.LST46 IECULK3 4,5,45,0,126,0,2,5,0,0
         AGO   .LST47    TO NEXT UCB ADD RNTRY
.UCB45 ANOP
  IECIUCB 45,285,AT,40,09,37,2,,34008003,24,0,0,0,,0,0,0,285,0
         AGO   .UCB46      TO NEXT UCB
.WK34 IECIUCBA 45,34008003,0,0,0,0,0,0
         AGO   .WK35   TO NEXT WORK AREA
.TCH3    ANOP   TEST CHANNEL
    IECXTCH 3,1,(0,1,0,0,0,                                           *****
               0,0,0,0,0,0,                                          ******
               0,0,0,0),(0,0,0,0),0,1,1,0,1,0
         AGO   .TCH4      TO NEXT TCH MOD
.SRCH3  ANOP       CHANNEL SEARCH MOD3
               IECICS 2,6,0,                                 ************
               (2,                            I267                 ********
               1,0,         I267                                       *
               0),0,0,0,0,1,(0,0,0,0),0
         AGO   .SRCH4     TO NEXT CHAN SRCH MOD
.TAB4   ANOP         LOOK UP UCB TAB
 IECULK1 45,2,3,0,0,1,1
         AGO   .TAB5     TO NEXT CHANNEL ENTRY
.TCU8   IECULK2 138,8,3,45,1,0,0
         AGO   .TCU9       TO NEXT ENTRY
.LST47 IECULK3 5,0,46,1,138,0,3,0,1,0
         AGO   .LST48    TO NEXT UCB ADD RNTRY
.UCB46 ANOP
  IECIUCB 46,330,DA,24,01,39,3,,30C02008,0,0,0,0,,0,0,0,330,0
         AGO   .UCB47      TO NEXT UCB
.WK35 IECIUCBA 46,30C02008,0,0,0,0,0,0
         AGO   .WK36   TO NEXT WORK AREA
.LST48 IECULK3 0,1,47,0,138,0,3,1,1,0
         AGO   .LST49    TO NEXT UCB ADD RNTRY
.UCB47 ANOP
  IECIUCB 47,331,DA,24,01,39,3,,30C02008,0,0,0,0,,0,0,0,331,0
         AGO   .UCB48      TO NEXT UCB
.WK36 IECIUCBA 47,30C02008,0,0,0,0,0,0
         AGO   .WK37   TO NEXT WORK AREA
.LST49 IECULK3 1,2,48,0,138,0,3,2,1,0
         AGO   .LST50    TO NEXT UCB ADD RNTRY
.UCB48 ANOP
  IECIUCB 48,332,DA,24,01,39,3,,30C02008,0,0,0,0,,0,0,0,332,0
         AGO   .UCB49      TO NEXT UCB
.WK37 IECIUCBA 48,30C02008,0,0,0,0,0,0
         AGO   .WK38   TO NEXT WORK AREA
.LST50 IECULK3 2,3,49,0,138,0,3,3,1,0
         AGO   .LST51    TO NEXT UCB ADD RNTRY
.UCB49 ANOP
  IECIUCB 49,333,DA,24,01,39,3,,30C02008,0,0,0,0,,0,0,0,333,0
         AGO   .UCB50      TO NEXT UCB
.WK38 IECIUCBA 49,30C02008,0,0,0,0,0,0
         AGO   .WK39   TO NEXT WORK AREA
.LST51 IECULK3 3,4,50,0,138,0,3,4,1,0
         AGO   .LST52    TO NEXT UCB ADD RNTRY
.UCB50 ANOP
  IECIUCB 50,334,DA,24,01,39,3,,30C02008,0,0,0,0,,0,0,0,334,0
         AGO   .UCB51      TO NEXT UCB
.WK39 IECIUCBA 50,30C02008,0,0,0,0,0,0
         AGO   .WK40   TO NEXT WORK AREA
.LST52 IECULK3 4,5,51,0,138,0,3,5,1,0
         AGO   .LST53    TO NEXT UCB ADD RNTRY
.UCB51 ANOP
  IECIUCB 51,335,DA,24,01,39,3,,30C02008,0,0,0,0,,0,0,0,335,0
         AGO   .UCB52      TO NEXT UCB
.WK40 IECIUCBA 51,30C02008,0,0,0,0,0,0
         AGO   .WK41   TO NEXT WORK AREA
.LST53 IECULK3 5,6,52,0,138,0,3,6,1,0
         AGO   .LST54    TO NEXT UCB ADD RNTRY
.UCB52 ANOP
  IECIUCB 52,336,DA,24,01,39,3,,30C02008,0,0,0,0,,0,0,0,336,0
         AGO   .UCB53      TO NEXT UCB
.WK41 IECIUCBA 52,30C02008,0,0,0,0,0,0
         AGO   .WK42   TO NEXT WORK AREA
.LST54 IECULK3 6,7,53,0,138,0,3,7,1,0
         AGO   .LST55    TO NEXT UCB ADD RNTRY
.UCB53 ANOP
  IECIUCB 53,337,DA,24,01,39,3,,30C02008,0,0,0,0,,0,0,0,337,0
         AGO   .UCB54      TO NEXT UCB
.WK42 IECIUCBA 53,30C02008,0,0,0,0,0,0
         AGO   .WK43   TO NEXT WORK AREA
.TCU9   IECULK2 154,3,5,45,0,0,0
         AGO   .TCU10       TO NEXT ENTRY
.LST55 IECULK3 7,0,54,1,154,0,3,8,1,0
         AGO   .LST56    TO NEXT UCB ADD RNTRY
.UCB54 ANOP
  IECIUCB 54,350,ML,32,01,48,3,,30502009,8,0,0,0,,0,0,0,350,0
         AGO   .UCB55      TO NEXT UCB
.WK43 IECIUCBA 54,30502009,0,0,0,0,0,0
         AGO   .WK44   TO NEXT WORK AREA
.LST56 IECULK3 0,1,55,0,154,0,3,8,1,0
         AGO   .LST57    TO NEXT UCB ADD RNTRY
.UCB55 ANOP
  IECIUCB 55,351,ML,32,01,48,3,,30502009,8,0,0,0,,0,0,0,351,0
         AGO   .UCB56      TO NEXT UCB
.WK44 IECIUCBA 55,30502009,0,0,0,0,0,0
         AGO   .WK45   TO NEXT WORK AREA
.LST57 IECULK3 1,2,56,0,154,0,3,8,1,0
         AGO   .LST58    TO NEXT UCB ADD RNTRY
.UCB56 ANOP
  IECIUCB 56,352,ML,32,01,48,3,,30502009,8,0,0,0,,0,0,0,352,0
         AGO   .UCB57      TO NEXT UCB
.WK45 IECIUCBA 56,30502009,0,0,0,0,0,0
         AGO   .WK46   TO NEXT WORK AREA
.LST58 IECULK3 2,3,57,0,154,0,3,8,1,0
         AGO   .LST59    TO NEXT UCB ADD RNTRY
.UCB57 ANOP
  IECIUCB 57,353,ML,32,01,48,3,,30502009,8,0,0,0,,0,0,0,353,0
         AGO   .UCB58      TO NEXT UCB
.WK46 IECIUCBA 57,30502009,0,0,0,0,0,0
         AGO   .WK47   TO NEXT WORK AREA
.LST59 IECULK3 3,4,58,0,154,0,3,8,1,0
         AGO   .LST60    TO NEXT UCB ADD RNTRY
.UCB58 ANOP
  IECIUCB 58,354,ML,32,01,48,3,,30502009,8,0,0,0,,0,0,0,354,0
         AGO   .UCB59      TO NEXT UCB
.WK47 IECIUCBA 58,30502009,0,0,0,0,0,0
         AGO   .WK48   TO NEXT WORK AREA
.LST60 IECULK3 4,5,59,0,154,0,3,8,1,0
         AGO   .LST61    TO NEXT UCB ADD RNTRY
.UCB59 ANOP
  IECIUCB 59,355,ML,32,01,48,3,,30502009,8,0,0,0,,0,0,0,355,0
         AGO   .UCB60      TO NEXT UCB
.WK48 IECIUCBA 59,30502009,0,0,0,0,0,0
         AGO   .WK49   TO NEXT WORK AREA
.LST61 IECULK3 5,6,60,0,154,0,3,8,1,0
         AGO   .LST62    TO NEXT UCB ADD RNTRY
.UCB60 ANOP
  IECIUCB 60,356,ML,32,01,48,3,,30502009,8,0,0,0,,0,0,0,356,0
         AGO   .UCB61      TO NEXT UCB
.WK49 IECIUCBA 60,30502009,0,0,0,0,0,0
         AGO   .WK50   TO NEXT WORK AREA
.LST62 IECULK3 6,7,61,0,154,0,3,8,1,0
         AGO   .LST63    TO NEXT UCB ADD RNTRY
.UCB61 ANOP
  IECIUCB 61,357,ML,32,01,48,3,,30502009,8,0,0,0,,0,0,0,357,0
         AGO   .UCB62      TO NEXT UCB
.WK50 IECIUCBA 61,30502009,0,0,0,0,0,0
         AGO   .WK51   TO NEXT WORK AREA
.TCU10   IECULK2 170,5,6,45,0,0,0
         AGO   .TCU11       TO NEXT ENTRY
.LST63 IECULK3 7,0,62,1,170,0,3,8,1,0
         AGO   .LST64    TO NEXT UCB ADD RNTRY
.UCB62 ANOP
  IECIUCB 62,360,ML,32,01,49,3,,30502009,8,0,0,0,,0,0,0,360,0
         AGO   .UCB63      TO NEXT UCB
.WK51 IECIUCBA 62,30502009,0,0,0,0,0,0
         AGO   .WK52   TO NEXT WORK AREA
.LST64 IECULK3 0,1,63,0,170,0,3,8,1,0
         AGO   .LST65    TO NEXT UCB ADD RNTRY
.UCB63 ANOP
  IECIUCB 63,361,ML,32,01,49,3,,30502009,8,0,0,0,,0,0,0,361,0
         AGO   .UCB64      TO NEXT UCB
.WK52 IECIUCBA 63,30502009,0,0,0,0,0,0
         AGO   .WK53   TO NEXT WORK AREA
.LST65 IECULK3 1,2,64,0,170,0,3,8,1,0
         AGO   .LST66    TO NEXT UCB ADD RNTRY
.UCB64 ANOP
  IECIUCB 64,362,ML,32,01,49,3,,30502009,8,0,0,0,,0,0,0,362,0
         AGO   .UCB65      TO NEXT UCB
.WK53 IECIUCBA 64,30502009,0,0,0,0,0,0
         AGO   .WK54   TO NEXT WORK AREA
.LST66 IECULK3 2,3,65,0,170,0,3,8,1,0
         AGO   .LST67    TO NEXT UCB ADD RNTRY
.UCB65 ANOP
  IECIUCB 65,363,ML,32,01,49,3,,30502009,8,0,0,0,,0,0,0,363,0
         AGO   .UCB66      TO NEXT UCB
.WK54 IECIUCBA 65,30502009,0,0,0,0,0,0
         AGO   .WK55   TO NEXT WORK AREA
.LST67 IECULK3 3,4,66,0,170,0,3,8,1,0
         AGO   .LST68    TO NEXT UCB ADD RNTRY
.UCB66 ANOP
  IECIUCB 66,364,ML,32,01,49,3,,30502009,8,0,0,0,,0,0,0,364,0
         AGO   .UCB67      TO NEXT UCB
.WK55 IECIUCBA 66,30502009,0,0,0,0,0,0
         AGO   .WK56   TO NEXT WORK AREA
.LST68 IECULK3 4,5,67,0,170,0,3,8,1,0
         AGO   .LST69    TO NEXT UCB ADD RNTRY
.UCB67 ANOP
  IECIUCB 67,365,ML,32,01,49,3,,30502009,8,0,0,0,,0,0,0,365,0
         AGO   .UCB68      TO NEXT UCB
.WK56 IECIUCBA 67,30502009,0,0,0,0,0,0
         AGO   .WK57   TO NEXT WORK AREA
.LST69 IECULK3 5,6,68,0,170,0,3,8,1,0
         AGO   .LST70    TO NEXT UCB ADD RNTRY
.UCB68 ANOP
  IECIUCB 68,366,ML,32,01,49,3,,30502009,8,0,0,0,,0,0,0,366,0
         AGO   .UCB69      TO NEXT UCB
.WK57 IECIUCBA 68,30502009,0,0,0,0,0,0
         AGO   .WK58   TO NEXT WORK AREA
.LST70 IECULK3 6,7,69,0,170,0,3,8,1,0
         AGO   .LST71    TO NEXT UCB ADD RNTRY
.UCB69 ANOP
  IECIUCB 69,367,ML,32,01,49,3,,30502009,8,0,0,0,,0,0,0,367,0
         AGO   .UCB70      TO NEXT UCB
.WK58 IECIUCBA 69,30502009,0,0,0,0,0,0
         AGO   .WK59   TO NEXT WORK AREA
.TCH4    ANOP   TEST CHANNEL
    IECXTCH 4,1,(0,0,1,0,0,                                           *****
               0,0,0,0,0,0,                                          ******
               0,0,0,0),(0,0,0,0),0,1,1,0,1,1
         AGO   .TCH5      TO NEXT TCH MOD
.SRCH4  ANOP       CHANNEL SEARCH MOD4
               IECICS 3,8,0,                                 ************
               (3,                            I267                 ********
               1,1,         I267                                       *
               0),0,0,0,0,1,(0,0,0,0),0
         AGO   .SRCH5     TO NEXT CHAN SRCH MOD
.TAB5   ANOP         LOOK UP UCB TAB
 IECULK1 52,3,7,0,0,1,1
         AGO   .TAB6     TO NEXT CHANNEL ENTRY
.TCU11   IECULK2 186,6,0,52,1,0,0
         AGO   .TCU12       TO NEXT ENTRY
.LST71 IECULK3 7,0,70,1,186,0,7,0,0,0
         AGO   .LST72    TO NEXT UCB ADD RNTRY
.UCB70 ANOP
  IECIUCB 70,700,SUD,48,00,50,4,,50000801,0,0,0,0,,0,0,0,700,0
         AGO   .UCB71      TO NEXT UCB
.LST72 IECULK3 0,1,71,0,186,0,7,0,0,0
         AGO   .LST73    TO NEXT UCB ADD RNTRY
.UCB71 ANOP
  IECIUCB 71,701,SUD,48,00,51,4,,50000801,0,0,0,0,,0,0,0,701,0
         AGO   .UCB72      TO NEXT UCB
.LST73 IECULK3 1,2,72,0,186,0,7,0,0,0
         AGO   .LST74    TO NEXT UCB ADD RNTRY
.UCB72 ANOP
  IECIUCB 72,702,SUD,48,00,52,4,,50000801,0,0,0,0,,0,0,0,702,0
         AGO   .UCB73      TO NEXT UCB
.LST74 IECULK3 2,3,73,0,186,0,7,0,0,0
         AGO   .LST75    TO NEXT UCB ADD RNTRY
.UCB73 ANOP
  IECIUCB 73,703,SUD,48,00,53,4,,50000801,0,0,0,0,,0,0,0,703,0
         AGO   .UCB74      TO NEXT UCB
.LST75 IECULK3 3,4,74,0,186,0,7,0,0,0
         AGO   .LST76    TO NEXT UCB ADD RNTRY
.UCB74 ANOP
  IECIUCB 74,704,SUD,48,00,54,4,,50000801,0,0,0,0,,0,0,0,704,0
         AGO   .UCB75      TO NEXT UCB
.LST76 IECULK3 4,5,75,0,186,0,7,0,0,0
         AGO   .LST77    TO NEXT UCB ADD RNTRY
.UCB75 ANOP
  IECIUCB 75,705,SUD,48,00,55,4,,50000801,0,0,0,0,,0,0,0,705,0
         AGO   .UCB76      TO NEXT UCB
.LST77 IECULK3 5,6,76,0,186,0,7,0,0,0
         AGO   .LST78    TO NEXT UCB ADD RNTRY
.UCB76 ANOP
  IECIUCB 76,706,SUD,48,00,56,4,,50000801,0,0,0,0,,0,0,0,706,0
         AGO   .UCB77      TO NEXT UCB
.LST78 IECULK3 6,7,77,0,186,0,7,0,0,0
         AGO   .LST79    TO NEXT UCB ADD RNTRY
.UCB77 ANOP
  IECIUCB 77,707,SUD,48,00,57,4,,50000801,0,0,0,0,,0,0,0,707,0
         AGO   .UCB78      TO NEXT UCB
.LST79 IECULK3 7,8,78,0,186,0,7,0,0,0
         AGO   .LST80    TO NEXT UCB ADD RNTRY
.UCB78 ANOP
  IECIUCB 78,708,SUD,48,00,58,4,,50000801,0,0,0,0,,0,0,0,708,0
         AGO   .UCB79      TO NEXT UCB
.LST80 IECULK3 8,9,79,0,186,0,7,0,0,0
         AGO   .LST81    TO NEXT UCB ADD RNTRY
.UCB79 ANOP
  IECIUCB 79,709,SUD,48,00,59,4,,50000801,0,0,0,0,,0,0,0,709,0
         AGO   .UCB80      TO NEXT UCB
.LST81 IECULK3 9,10,80,0,186,0,7,0,0,0
         AGO   .LST82    TO NEXT UCB ADD RNTRY
.UCB80 ANOP
  IECIUCB 80,70A,SUD,48,00,60,4,,50000801,0,0,0,0,,0,0,0,70A,0
         AGO   .UCB81      TO NEXT UCB
.LST82 IECULK3 10,11,81,0,186,0,7,0,0,0
         AGO   .LST83    TO NEXT UCB ADD RNTRY
.UCB81 ANOP
  IECIUCB 81,70B,SUD,48,00,61,4,,50000801,0,0,0,0,,0,0,0,70B,0
         AGO   .UCB82      TO NEXT UCB
.TCU12   IECULK2 210,0,2,52,0,0,0
         AGO   .TCU13       TO NEXT ENTRY
.LST83 IECULK3 11,0,82,1,210,0,7,0,0,0
         AGO   .LST84    TO NEXT UCB ADD RNTRY
.UCB82 ANOP
  IECIUCB 82,720,SUD,48,00,62,4,,50000808,0,0,0,0,,0,0,0,720,0
         AGO   .UCB83      TO NEXT UCB
.WK59 IECIUCBA 82,50000808,0,0,0,0,0,0
         AGO   .WK60   TO NEXT WORK AREA
.LST84 IECULK3 0,1,83,0,210,0,7,0,0,0
         AGO   .LST85    TO NEXT UCB ADD RNTRY
.UCB83 ANOP
  IECIUCB 83,721,SUD,48,00,63,4,,50000808,0,0,0,0,,0,0,0,721,0
         AGO   .UCB84      TO NEXT UCB
.WK60 IECIUCBA 83,50000808,0,0,0,0,0,0
         AGO   .WK61   TO NEXT WORK AREA
.LST85 IECULK3 1,2,84,0,210,0,7,0,0,0
         AGO   .LST86    TO NEXT UCB ADD RNTRY
.UCB84 ANOP
  IECIUCB 84,722,SUD,48,00,64,4,,50000808,0,0,0,0,,0,0,0,722,0
         AGO   .UCB85      TO NEXT UCB
.WK61 IECIUCBA 84,50000808,0,0,0,0,0,0
         AGO   .WK62   TO NEXT WORK AREA
.LST86 IECULK3 2,3,85,0,210,0,7,0,0,0
         AGO   .LST87    TO NEXT UCB ADD RNTRY
.UCB85 ANOP
  IECIUCB 85,723,SUD,48,00,65,4,,50000808,0,0,0,0,,0,0,0,723,0
         AGO   .UCB86      TO NEXT UCB
.WK62 IECIUCBA 85,50000808,0,0,0,0,0,0
         AGO   .WK63   TO NEXT WORK AREA
.LST87 IECULK3 3,4,86,0,210,0,7,0,0,0
         AGO   .LST88    TO NEXT UCB ADD RNTRY
.UCB86 ANOP
  IECIUCB 86,724,SUD,48,00,66,4,,50000808,0,0,0,0,,0,0,0,724,0
         AGO   .UCB87      TO NEXT UCB
.WK63 IECIUCBA 86,50000808,0,0,0,0,0,0
         AGO   .WK64   TO NEXT WORK AREA
.LST88 IECULK3 4,5,87,0,210,0,7,0,0,0
         AGO   .LST89    TO NEXT UCB ADD RNTRY
.UCB87 ANOP
  IECIUCB 87,725,SUD,48,00,67,4,,50000808,0,0,0,0,,0,0,0,725,0
         AGO   .UCB88      TO NEXT UCB
.WK64 IECIUCBA 87,50000808,0,0,0,0,0,0
         AGO   .WK65   TO NEXT WORK AREA
.LST89 IECULK3 5,6,88,0,210,0,7,0,0,0
         AGO   .LST90    TO NEXT UCB ADD RNTRY
.UCB88 ANOP
  IECIUCB 88,726,SUD,48,00,68,4,,50000808,0,0,0,0,,0,0,0,726,0
         AGO   .UCB89      TO NEXT UCB
.WK65 IECIUCBA 88,50000808,0,0,0,0,0,0
         AGO   .WK66   TO NEXT WORK AREA
.LST90 IECULK3 6,7,89,0,210,0,7,0,0,0
         AGO   .LST91    TO NEXT UCB ADD RNTRY
.UCB89 ANOP
  IECIUCB 89,727,SUD,48,00,69,4,,50000808,0,0,0,0,,0,0,0,727,0
         AGO   .UCB90      TO NEXT UCB
.WK66 IECIUCBA 89,50000808,0,0,0,0,0,0
         AGO   .WK67   TO NEXT WORK AREA
.LST91 IECULK3 7,8,90,0,210,0,7,0,0,0
         AGO   .LST92    TO NEXT UCB ADD RNTRY
.UCB90 ANOP
  IECIUCB 90,728,SUD,48,00,70,4,,50000808,0,0,0,0,,0,0,0,728,0
         AGO   .UCB91      TO NEXT UCB
.WK67 IECIUCBA 90,50000808,0,0,0,0,0,0
         AGO   .WK68   TO NEXT WORK AREA
.LST92 IECULK3 8,9,91,0,210,0,7,0,0,0
         AGO   .LST93    TO NEXT UCB ADD RNTRY
.UCB91 ANOP
  IECIUCB 91,729,SUD,48,00,71,4,,50000808,0,0,0,0,,0,0,0,729,0
         AGO   .UCB92      TO NEXT UCB
.WK68 IECIUCBA 91,50000808,0,0,0,0,0,0
         AGO   .WK69   TO NEXT WORK AREA
.LST93 IECULK3 9,10,92,0,210,0,7,0,0,0
         AGO   .LST94    TO NEXT UCB ADD RNTRY
.UCB92 ANOP
  IECIUCB 92,72A,SUD,48,00,72,4,,50000808,0,0,0,0,,0,0,0,72A,0
         AGO   .UCB93      TO NEXT UCB
.WK69 IECIUCBA 92,50000808,0,0,0,0,0,0
         AGO   .WK70   TO NEXT WORK AREA
.LST94 IECULK3 10,11,93,0,210,0,7,0,0,0
         AGO   .LST95    TO NEXT UCB ADD RNTRY
.UCB93 ANOP
  IECIUCB 93,72B,SUD,48,00,73,4,,50000808,0,0,0,0,,0,0,0,72B,0
         AGO   .UCB94      TO NEXT UCB
.WK70 IECIUCBA 93,50000808,0,0,0,0,0,0
         AGO   .WK71   TO NEXT WORK AREA
.LST95 IECULK3 11,12,94,0,210,0,7,0,0,0
         AGO   .LST96    TO NEXT UCB ADD RNTRY
.UCB94 ANOP
  IECIUCB 94,72C,SUD,48,00,74,4,,50000808,0,0,0,0,,0,0,0,72C,0
         AGO   .UCB95      TO NEXT UCB
.WK71 IECIUCBA 94,50000808,0,0,0,0,0,0
         AGO   .WK72   TO NEXT WORK AREA
.LST96 IECULK3 12,13,95,0,210,0,7,0,0,0
         AGO   .LST97    TO NEXT UCB ADD RNTRY
.UCB95 ANOP
  IECIUCB 95,72D,SUD,48,00,75,4,,50000808,0,0,0,0,,0,0,0,72D,0
         AGO   .UCB96      TO NEXT UCB
.WK72 IECIUCBA 95,50000808,0,0,0,0,0,0
         AGO   .WK73   TO NEXT WORK AREA
.LST97 IECULK3 13,14,96,0,210,0,7,0,0,0
         AGO   .LST98    TO NEXT UCB ADD RNTRY
.UCB96 ANOP
  IECIUCB 96,72E,SUD,48,00,76,4,,50000808,0,0,0,0,,0,0,0,72E,0
         AGO   .UCB97      TO NEXT UCB
.WK73 IECIUCBA 96,50000808,0,0,0,0,0,0
         AGO   .WK74   TO NEXT WORK AREA
.LST98 IECULK3 14,15,97,0,210,0,7,0,0,0
         AGO   .LST99    TO NEXT UCB ADD RNTRY
.UCB97 ANOP
  IECIUCB 97,72F,SUD,48,00,77,4,,50000808,0,0,0,0,,0,0,0,72F,0
         AGO   .UCB98      TO NEXT UCB
.WK74 IECIUCBA 97,50000808,0,0,0,0,0,0
         AGO   .WK75   TO NEXT WORK AREA
.TCU13   IECULK2 242,2,3,52,0,0,0
         AGO   .TCU14       TO NEXT ENTRY
.LST99 IECULK3 15,0,98,1,242,0,7,0,0,0
         AGO   .LST100    TO NEXT UCB ADD RNTRY
.UCB98 ANOP
  IECIUCB 98,730,SUD,48,00,78,4,,50000808,0,0,0,0,,0,0,0,730,0
         AGO   .UCB99      TO NEXT UCB
.WK75 IECIUCBA 98,50000808,0,0,0,0,0,0
         AGO   .WK76   TO NEXT WORK AREA
.LST100 IECULK3 0,1,99,0,242,0,7,0,0,0
         AGO   .LST101    TO NEXT UCB ADD RNTRY
.UCB99 ANOP
  IECIUCB 99,731,SUD,48,00,79,4,,50000808,0,0,0,0,,0,0,0,731,0
         AGO   .UCB100      TO NEXT UCB
.WK76 IECIUCBA 99,50000808,0,0,0,0,0,0
         AGO   .WK77   TO NEXT WORK AREA
.LST101 IECULK3 1,2,100,0,242,0,7,0,0,0
         AGO   .LST102    TO NEXT UCB ADD RNTRY
.UCB100 ANOP
  IECIUCB 100,732,SUD,48,00,80,4,,50000808,0,0,0,0,,0,0,0,732,0
         AGO   .UCB101      TO NEXT UCB
.WK77 IECIUCBA 100,50000808,0,0,0,0,0,0
         AGO   .WK78   TO NEXT WORK AREA
.LST102 IECULK3 2,3,101,0,242,0,7,0,0,0
         AGO   .LST103    TO NEXT UCB ADD RNTRY
.UCB101 ANOP
  IECIUCB 101,733,SUD,48,00,81,4,,50000808,0,0,0,0,,0,0,0,733,0
         AGO   .UCB102      TO NEXT UCB
.WK78 IECIUCBA 101,50000808,0,0,0,0,0,0
         AGO   .WK79   TO NEXT WORK AREA
.LST103 IECULK3 3,4,102,0,242,0,7,0,0,0
         AGO   .LST104    TO NEXT UCB ADD RNTRY
.UCB102 ANOP
  IECIUCB 102,734,SUD,48,00,82,4,,50000808,0,0,0,0,,0,0,0,734,0
         AGO   .UCB103      TO NEXT UCB
.WK79 IECIUCBA 102,50000808,0,0,0,0,0,0
         AGO   .WK80   TO NEXT WORK AREA
.LST104 IECULK3 4,5,103,0,242,0,7,0,0,0
         AGO   .LST105    TO NEXT UCB ADD RNTRY
.UCB103 ANOP
  IECIUCB 103,735,SUD,48,00,83,4,,50000808,0,0,0,0,,0,0,0,735,0
         AGO   .UCB104      TO NEXT UCB
.WK80 IECIUCBA 103,50000808,0,0,0,0,0,0
         AGO   .WK81   TO NEXT WORK AREA
.LST105 IECULK3 5,6,104,0,242,0,7,0,0,0
         AGO   .LST106    TO NEXT UCB ADD RNTRY
.UCB104 ANOP
  IECIUCB 104,736,SUD,48,00,84,4,,50000808,0,0,0,0,,0,0,0,736,0
         AGO   .UCB105      TO NEXT UCB
.WK81 IECIUCBA 104,50000808,0,0,0,0,0,0
         AGO   .WK82   TO NEXT WORK AREA
.LST106 IECULK3 6,7,105,0,242,0,7,0,0,0
         AGO   .LST107    TO NEXT UCB ADD RNTRY
.UCB105 ANOP
  IECIUCB 105,737,SUD,48,00,85,4,,50000808,0,0,0,0,,0,0,0,737,0
         AGO   .UCB106      TO NEXT UCB
.WK82 IECIUCBA 105,50000808,0,0,0,0,0,0
         AGO   .WK83   TO NEXT WORK AREA
.LST107 IECULK3 7,8,106,0,242,0,7,0,0,0
         AGO   .LST108    TO NEXT UCB ADD RNTRY
.UCB106 ANOP
  IECIUCB 106,738,SUD,48,00,86,4,,50000808,0,0,0,0,,0,0,0,738,0
         AGO   .UCB107      TO NEXT UCB
.WK83 IECIUCBA 106,50000808,0,0,0,0,0,0
         AGO   .WK84   TO NEXT WORK AREA
.LST108 IECULK3 8,9,107,0,242,0,7,0,0,0
         AGO   .LST109    TO NEXT UCB ADD RNTRY
.UCB107 ANOP
  IECIUCB 107,739,SUD,48,00,87,4,,50000808,0,0,0,0,,0,0,0,739,0
         AGO   .UCB108      TO NEXT UCB
.WK84 IECIUCBA 107,50000808,0,0,0,0,0,0
         AGO   .WK85   TO NEXT WORK AREA
.LST109 IECULK3 9,10,108,0,242,0,7,0,0,0
         AGO   .LST110    TO NEXT UCB ADD RNTRY
.UCB108 ANOP
  IECIUCB 108,73A,SUD,48,00,88,4,,50000808,0,0,0,0,,0,0,0,73A,0
         AGO   .UCB109      TO NEXT UCB
.WK85 IECIUCBA 108,50000808,0,0,0,0,0,0
         AGO   .WK86   TO NEXT WORK AREA
.LST110 IECULK3 10,11,109,0,242,0,7,0,0,0
         AGO   .LST111    TO NEXT UCB ADD RNTRY
.UCB109 ANOP
  IECIUCB 109,73B,SUD,48,00,89,4,,50000808,0,0,0,0,,0,0,0,73B,0
         AGO   .UCB110      TO NEXT UCB
.WK86 IECIUCBA 109,50000808,0,0,0,0,0,0
         AGO   .WK87   TO NEXT WORK AREA
.LST111 IECULK3 11,12,110,0,242,0,7,0,0,0
         AGO   .LST112    TO NEXT UCB ADD RNTRY
.UCB110 ANOP
  IECIUCB 110,73C,SUD,48,00,90,4,,50000808,0,0,0,0,,0,0,0,73C,0
         AGO   .UCB111      TO NEXT UCB
.WK87 IECIUCBA 110,50000808,0,0,0,0,0,0
         AGO   .WK88   TO NEXT WORK AREA
.LST112 IECULK3 12,13,111,0,242,0,7,0,0,0
         AGO   .LST113    TO NEXT UCB ADD RNTRY
.UCB111 ANOP
  IECIUCB 111,73D,SUD,48,00,91,4,,50000808,0,0,0,0,,0,0,0,73D,0
         AGO   .UCB112      TO NEXT UCB
.WK88 IECIUCBA 111,50000808,0,0,0,0,0,0
         AGO   .WK89   TO NEXT WORK AREA
.LST113 IECULK3 13,14,112,0,242,0,7,0,0,0
         AGO   .LST114    TO NEXT UCB ADD RNTRY
.UCB112 ANOP
  IECIUCB 112,73E,SUD,48,00,92,4,,50000808,0,0,0,0,,0,0,0,73E,0
         AGO   .UCB113      TO NEXT UCB
.WK89 IECIUCBA 112,50000808,0,0,0,0,0,0
         AGO   .WK90   TO NEXT WORK AREA
.LST114 IECULK3 14,15,113,0,242,0,7,0,0,0
         AGO   .LST115    TO NEXT UCB ADD RNTRY
.UCB113 ANOP
  IECIUCB 113,73F,SUD,48,00,93,4,,50000808,0,0,0,0,,0,0,0,73F,0
         AGO   .UCB114      TO NEXT UCB
.WK90 IECIUCBA 113,50000808,0,0,0,0,0,0
         AGO   .WK91   TO NEXT WORK AREA
.TCU14   IECULK2 274,3,7,52,0,0,0
         AGO   .TCU15       TO NEXT ENTRY
.LST115 IECULK3 15,0,114,1,274,0,7,0,0,0
         AGO   .LST116    TO NEXT UCB ADD RNTRY
.UCB114 ANOP
  IECIUCB 114,770,SUD,48,00,94,4,,50000802,0,0,0,0,,0,0,0,770,0
         AGO   .UCB115      TO NEXT UCB
.LST116 IECULK3 0,1,115,0,274,0,7,0,0,0
         AGO   .LST117    TO NEXT UCB ADD RNTRY
.UCB115 ANOP
  IECIUCB 115,771,SUD,48,00,95,4,,50000802,0,0,0,0,,0,0,0,771,0
         AGO   .UCB116      TO NEXT UCB
.LST117 IECULK3 1,2,116,0,274,0,7,0,0,0
         AGO   .LST118    TO NEXT UCB ADD RNTRY
.UCB116 ANOP
  IECIUCB 116,772,SUD,48,00,96,4,,50000802,0,0,0,0,,0,0,0,772,0
         AGO   .UCB117      TO NEXT UCB
.LST118 IECULK3 2,3,117,0,274,0,7,0,0,0
         AGO   .LST119    TO NEXT UCB ADD RNTRY
.UCB117 ANOP
  IECIUCB 117,773,SUD,48,00,97,4,,50000802,0,0,0,0,,0,0,0,773,0
         AGO   .UCB118      TO NEXT UCB
.LST119 IECULK3 3,4,118,0,274,0,7,0,0,0
         AGO   .LST120    TO NEXT UCB ADD RNTRY
.UCB118 ANOP
  IECIUCB 118,774,SUD,48,00,98,4,,50000802,0,0,0,0,,0,0,0,774,0
         AGO   .UCB119      TO NEXT UCB
.LST120 IECULK3 4,5,119,0,274,0,7,0,0,0
         AGO   .LST121    TO NEXT UCB ADD RNTRY
.UCB119 ANOP
  IECIUCB 119,775,SUD,48,00,99,4,,50000802,0,0,0,0,,0,0,0,775,0
         AGO   .UCB120      TO NEXT UCB
.LST121 IECULK3 5,6,120,0,274,0,7,0,0,0
         AGO   .LST122    TO NEXT UCB ADD RNTRY
.UCB120 ANOP
  IECIUCB 120,776,SUD,48,00,100,4,,50000802,0,0,0,0,,0,0,0,776,0
         AGO   .UCB121      TO NEXT UCB
.LST122 IECULK3 6,7,121,0,274,0,7,0,0,0
         AGO   .LST123    TO NEXT UCB ADD RNTRY
.UCB121 ANOP
  IECIUCB 121,777,SUD,48,00,101,4,,50000802,0,0,0,0,,0,0,0,777,0
         AGO   .UCB122      TO NEXT UCB
.TCU15   IECULK2 290,7,8,52,0,0,0
         AGO   .TCU16       TO NEXT ENTRY
.LST123 IECULK3 7,0,122,1,290,0,7,0,0,0
         AGO   .LST124    TO NEXT UCB ADD RNTRY
.UCB122 ANOP
  IECIUCB 122,780,SUD,48,00,102,4,,50000805,0,0,0,0,,0,0,0,780,0
         AGO   .UCB123      TO NEXT UCB
.LST124 IECULK3 0,1,123,0,290,0,7,0,0,0
         AGO   .LST125    TO NEXT UCB ADD RNTRY
.UCB123 ANOP
  IECIUCB 123,781,SUD,48,00,103,4,,50000805,0,0,0,0,,0,0,0,781,0
         AGO   .UCB124      TO NEXT UCB
.LST125 IECULK3 1,2,124,0,290,0,7,0,0,0
         AGO   .LST126    TO NEXT UCB ADD RNTRY
.UCB124 ANOP
  IECIUCB 124,782,SUD,48,00,104,4,,50000805,0,0,0,0,,0,0,0,782,0
         AGO   .UCB125      TO NEXT UCB
.LST126 IECULK3 2,3,125,0,290,0,7,0,0,0
         AGO   .LST127    TO NEXT UCB ADD RNTRY
.UCB125 ANOP
  IECIUCB 125,783,SUD,48,00,105,4,,50000805,0,0,0,0,,0,0,0,783,0
         AGO   .UCB126      TO NEXT UCB
.LST127 IECULK3 3,4,126,0,290,0,7,0,0,0
         AGO   .LST128    TO NEXT UCB ADD RNTRY
.UCB126 ANOP
  IECIUCB 126,784,SUD,48,00,106,4,,50000805,0,0,0,0,,0,0,0,784,0
         AGO   .UCB127      TO NEXT UCB
.LST128 IECULK3 4,5,127,0,290,0,7,0,0,0
         AGO   .LST129    TO NEXT UCB ADD RNTRY
.UCB127 ANOP
  IECIUCB 127,785,SUD,48,00,107,4,,50000805,0,0,0,0,,0,0,0,785,0
         AGO   .UCB128      TO NEXT UCB
.LST129 ANOP     LAST UCB ADD ENTRY
    IECULK3 0,0,0,0,0,1
         AGO   .END     TO STATISTICS TABLE
.TAB6   ANOP            LAST CHANNEL ENTRY
  IECULK1 0,0,7,1
         AGO   .TCU1       TO FIRST CU ENTRY
.TCH5    ANOP   TEST CHANNEL
    IECXTCH 5,1,(0,0,0,0,0,                                           *****
               0,1,0,0,0,0,                                          ******
               0,0,0,0),(0,0,0,0),0,1,1,1,1,0
         AGO   .TCH6      TO NEXT TCH MOD
.SRCH5  ANOP       CHANNEL SEARCH MOD5
               IECICS 7,0,0,                                 ************
               (4,                            I267                 ********
               1,0,         I267                                       *
               1),0,0,0,0,1,(0,0,0,0),0
         AGO   .SRCH6     TO NEXT CHAN SRCH MOD
.TCH6   ANOP       LAST TEST CHAN MOD
         AGO   .SRCH1     TO FIRST CSRCH MOD
.SRCH6  ANOP         LAST CHANNEL SEARCH MOD
         AGO   .TBLTAB          TO TABLE MACRO
.TCU16   ANOP       LAST CU ENRY TO TABLE
         AGO   .LST1       TO FIRST CUB ADD
.UCB128   ANOP      LAST UCB ENTRY4
         AGO   .RQE     TO RQE AND STATAB
.WK91 ANOP    LAST WORK ENTRY
         AGO   .UCBEND  TO STATISTICS
.GBL      IECGBL 1,0,32,0
         AGO   .IOSTART
.IECIOS  ANOP      MAINLINE IOS
 IECXCP  1,1,1,0,1,0,0,1,0,0,0,1,                                    XXXXXX
               200,0,2,0,2,0,0,0,0,1,0,1,2,                       *********
               1,2,1,1,0,1,1,0,1,1,0,0,0
ID202    DS    0H  -  SGIEC202  LEVEL - US06787
 IECINT  1,1,1,0,1,0,0,1,0,0,0,1,                                    XXXXXX
               200,0,2,0,2,0,0,0,0,1,0,1,2,                       *********
               1,2,1,1,0,1,1,0,1,1,0,0,0
 IECIOS  1,1,1,0,1,0,0,1,0,0,0,1,                                    XXXXXX
               200,0,2,0,2,0,0,0,0,1,0,1,2,                       *********
               1,2,1,1,0,1,1,0,1,1,0,0,0
         AGO   .TCH1      TO FIRST TCH MOD
.TBLTAB  ANOP  LCH,DEVICE AND CHAN TABLE
 IECTBL  (1,3,3,3,0,0,0,3,0,0,0,0,0,0,0,0),                         ******
               0,5,                                                ******
               (UR,                                                 ******
               WR,                                                  ******
               GR,                                                  ******
               DA,                                                  ******
               ML,                                                  ******
               AT,                                                  ******
               DUM),1
         AGO  .TAB1     TO FIRST UCB ADDR
.IOSB    ANOP
 IECIOSB 1,1,1,0,1,0,0,1,0,0,0,1,                                    XXXXXX
               200,0,2,0,2,0,0,0,0,1,0,1,1,                      *********
               1,2,1,1,0,1,1,0,1,1,0,0,0
          AGO   .WK1
.END    ANOP
          AGO   .IOSB
.UCBEND  ANOP
 IECIST 107,(0,0,0,0,0),1
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM37  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM38 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG43 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IGFCCH)
//SYSIN DD *
         PRINT OFF,NODATA
 IGFCATAP 0,1,1
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM38  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM39 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG44 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(CHLOADTB)
//SYSIN DD *
         PRINT OFF,NODATA
CHLOADTB CSECT
         DC   H'0'
         DC    H'6'
         DC   H'78'
         DC    H'0'
         DC   H'126'
         DC    H'0'
         DC   H'138'
         DC    H'0'
         DC   H'186'
         DC    H'0'
         DC   H'302'
         DC H'32767'
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM39  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM40 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG45 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEC23XXF)
//SYSIN DD *
         PRINT OFF,NODATA
 IEC23XXF 1,0,0,0,0,1,1,1,1,0,1,0
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM40  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM41 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG46 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEHMVSRR)
//SYSIN DD *
         PRINT OFF,NODATA
IEHMVSRR CSECT
 ENTRY CORE
CORE   DC F'65536'
   END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM41  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM42 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG47 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFWMAS1)
//SYSIN DD *
         PRINT OFF,NODATA
DEVNAMET CSECT
         SGIEF010                                                      X
               10,3400-3,X'3400',X'8003',                             XXXXXXXX
               13,1403,X'1000',X'0808',                             XXXXXXXX
               21,3211,X'1080',X'0809',                             XXXXXXXX
               23,3215,X'1000',X'0823',                             XXXXXXXX
               25,3277-2,X'1200',X'1009',                             XXXXXXXX
               38,2520,X'5000',X'0805',                             XXXXXXXX
               39,2540,X'1000',X'0801',                             XXXXXXXX
               40,2540-2,X'1000',X'0802',                             XXXXXXXX
               48,2314,X'30C0',X'2008',                             XXXXXXXX
               49,3330,X'3050',X'2009',                             XXXXXXXX
               LAST
         DC    F'23'
 SGIEF011 38,38
 SGIEF011 39,39
 SGIEF011 40,40
 SGIEF011 13,13
 SGIEF011 21,21
 SGIEF011 23,23
 SGIEF011 25,25
 SGIEF011 48,48
 SGIEF011 49,49
 SGIEF011 10,10
         DC    CL8'2400-3'
         DC    X'34008001'
 SGIEF013 16,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49
 SGIEF013 32,49,49,49,49,49,49,49,49,48,48,48,48,48,48,48,48
 SGIEF013 48,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49
 SGIEF011 0,0,DISK
 SGIEF013 16,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49
 SGIEF013 32,49,49,49,49,49,49,49,49,48,48,48,48,48,48,48,48
 SGIEF013 48,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49
 SGIEF011 0,0,SYSDA
 SGIEF013 16,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49
 SGIEF013 32,49,49,49,49,49,49,49,49,48,48,48,48,48,48,48,48
 SGIEF013 48,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49
 SGIEF011 0,0,SYSALLDA
 SGIEF013 16,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49
 SGIEF013 32,49,49,49,49,49,49,49,49,10,10,10,10,10,10,48,48
 SGIEF013 48,48,48,48,48,48,48,49,49,49,49,49,49,49,49,49,49
 SGIEF013 54,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49
 SGIEF011 0,0,SYSSQ
 SGIEF013 16,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48
 SGIEF011 0,0,SORT
 SGIEF013 16,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48
 SGIEF011 0,0,SORTWK
 SGIEF013 16,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48
 SGIEF011 0,0,SORTWORK
 SGIEF013 6,10,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF011 0,0,TAPE
 SGIEF013 1,0,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF011 0,0,R
 SGIEF013 1,0,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF011 0,0,A
 SGIEF013 1,0,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF011 0,0,B
 SGIEF013 1,0,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF011 0,0,INTRDR
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM42  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM43 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG48 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFDEVPT)
//SYSIN DD *
         PRINT OFF,NODATA
IEFDEVPT CSECT
DVPTLEN  DC    H'5'
DVPTSIZE DC    H'151'
DVPTDEV  DC    H'127'
DVPT2321 DC    H'0'
DVPT     DC    F'0'
     DC  X'001F0007FFFFFFFFFFFFFFFFFFFFFFFFFFFFFE00'
     END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM43  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21AM44 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG49 EXEC PGM=IEUASM,
//    PARM=(DECK,NOLOAD),COND=(0,LT),REGION=300K
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=OLD,VOL=(PRIVATE,RETAIN)
//       DD DSNAME=SYS1.MODGEN2,DISP=OLD,VOL=(PRIVATE,RETAIN)
//  DD DSNAME=SYS1.DMACLIB,DISP=SHR
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFWMSKA)
//SYSIN DD *
         PRINT OFF,NODATA
DEVMASKT CSECT
          DC    H'23'
         DC    H'24'
         SGIEF010                                                      X
               10,3400-3,X'3400',X'8003',                             XXXXXXXX
               13,1403,X'1000',X'0808',                             XXXXXXXX
               21,3211,X'1080',X'0809',                             XXXXXXXX
               23,3215,X'1000',X'0823',                             XXXXXXXX
               25,3277-2,X'1200',X'1009',                             XXXXXXXX
               38,2520,X'5000',X'0805',                             XXXXXXXX
               39,2540,X'1000',X'0801',                             XXXXXXXX
               40,2540-2,X'1000',X'0802',                             XXXXXXXX
               48,2314,X'30C0',X'2008',                             XXXXXXXX
               49,3330,X'3050',X'2009',                             XXXXXXXX
               LAST
 SGIEF012 38,1,                                                  XXXXXXXX
               0010000000000000000000000000000000000000
 SGIEF012 39,1,                                                  XXXXXXXX
               0008000000000000000000000000000000000000
 SGIEF012 40,1,                                                  XXXXXXXX
               0004000000000000000000000000000000000000
 SGIEF012 13,2,                                                  XXXXXXXX
               0002000400000000000000000000000000000000
 SGIEF012 21,1,                                                  XXXXXXXX
               0001000000000000000000000000000000000000
 SGIEF012 23,1,                                                  XXXXXXXX
               0000000200000000000000000000000000000000
 SGIEF012 25,8,                                                  XXXXXXXX
               00000001FE000000000000000000000000000000
 SGIEF012 48,16,                                                  XXXXXXXX
               0000000001FE000007F800000000000000000000
 SGIEF012 49,32,                                                  XXXXXXXX
               000000000001FFFE0007FFF80000000000000000
 SGIEF012 10,6,                                                  XXXXXXXX
               0000000000000001F80000000000000000000000
        DC        F'6'
        DC        X'34008001'
   DC  X'0000000000000001F80000000000000000000000'
 SGIEF013 16,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49
 SGIEF013 32,49,49,49,49,49,49,49,49,48,48,48,48,48,48,48,48
 SGIEF013 48,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49
 SGIEF012 0,48,                                                      XXXX
               0000000001FFFFFE07FFFFF80000000000000000
 SGIEF013 16,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49
 SGIEF013 32,49,49,49,49,49,49,49,49,48,48,48,48,48,48,48,48
 SGIEF013 48,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49
 SGIEF012 0,48,                                                      XXXX
               0000000001FFFFFE07FFFFF80000000000000000
 SGIEF013 16,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49
 SGIEF013 32,49,49,49,49,49,49,49,49,48,48,48,48,48,48,48,48
 SGIEF013 48,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49
 SGIEF012 0,48,                                                      XXXX
               0000000001FFFFFE07FFFFF80000000000000000
 SGIEF013 16,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49
 SGIEF013 32,49,49,49,49,49,49,49,49,10,10,10,10,10,10,48,48
 SGIEF013 48,48,48,48,48,48,48,49,49,49,49,49,49,49,49,49,49
 SGIEF013 54,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49
 SGIEF012 0,54,                                                      XXXX
               0000000001FFFFFFFFFFFFF80000000000000000
 SGIEF013 16,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48
 SGIEF012 0,16,                                                      XXXX
               0000000001FE000007F800000000000000000000
 SGIEF013 16,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48
 SGIEF012 0,16,                                                      XXXX
               0000000001FE000007F800000000000000000000
 SGIEF013 16,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48
 SGIEF012 0,16,                                                      XXXX
               0000000001FE000007F800000000000000000000
 SGIEF013 6,10,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF012 0,6,                                                      XXXX
               0000000000000001F80000000000000000000000
 SGIEF013 1,0,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF012 0,11,                                                      XXXX
               000000000000000000000003FF80000000000000
 SGIEF013 1,0,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF012 0,31,                                                      XXXX
               000000000000000000000000003FFFFFFF800000
 SGIEF013 1,0,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF012 0,8,                                                      XXXX
               00000000000000000000000000000000007F8000
 SGIEF013 1,0,10,10,10,10,10,48,48,48,48,48,48,48,48,48,48
 SGIEF012 0,6,                                                      XXXX
               0000000000000000000000000000000000007E00
 SGIEF013 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
 SGIEF012 0,48,                                                      XXXX
               0000000001FFFFFE07FFFFF80000000000000000
          END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21AM44  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21TA45 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG51 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.DMACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKJEFLP0)
//SYSIN DD *
     PRINT  OFF,NODATA
    SGIKJ0LP 3000,10
         END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21TA45  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21TA46 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG53 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.DMACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKJEBEPD)
//SYSIN DD *
     PRINT  OFF,NODATA
  SGIKJ0EB  DSTYPE=(PLIF,FORTE,FORTG,FORTH,TEXT,DATA,CLIST,            X
               CNTL,ASM,COBOL,FORTGI,GOFORT,BASIC,IPLI,PLI,            X
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               BLKSIZE=(400,                                      XXXXXXXXX
               400,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               RECFM=(FXDONLY,                                        XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               FIXED,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               DLRECLF=(80,                                      XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               MLRECLF=(100,                                      XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               100,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               DLRECLV=(0,                                      XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               104,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               MLRECLV=(0,                                      XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               104,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               TRNSLT=(CAPSONLY,                                       XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               ASIS,                                               XXXXXXXXX
               CAPS,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPS,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPS,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               CHKR=(PLIFSCAN,                                         XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               IKJNC211,                                               XXXXXXXXX
               IKJNC211,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               USREXT=(,,,,,,,,,,,,,,,                                 X
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               PRMTR=(,                                        XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ASM,                                               XXXXXXXXX
               COBOL,                                               XXXXXXXXX
               FORT,                                               XXXXXXXXX
               GOFORT,                                               XXXXXXXXX
               IKJNC211,                                               XXXXXXXXX
               IKJNC211,                                               XXXXXXXXX
               PLIC,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               DSNSRC=(DATASET,                                       XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               INCORE,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               )
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21TA46  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21TA47 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG55 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.DMACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKJEBEIN)
//SYSIN DD *
     PRINT  OFF,NODATA
  SGIKJ0E2  DST=(PLI,COBOL,ASM,TEXT,DATA,CLIST,CNTL,BASIC,             X
               IPLI,GOFORT,FORTE,FORTG,FORTGI,FORTH,PLIF,              X
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               SUBFD=(,                                        XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               )
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21TA47  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21TA48 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG57 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.DMACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SYSUT2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKJEFF65)
//SYSIN DD *
     PRINT  OFF,NODATA
   SGIKJ0EF CLASS=AA
 END
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21TA48  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21LK49 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG58 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE CI555(IKJEAD00)
  ALIAS IKJEAD01
  NAME IKJEAD00(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK49  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK50 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG59 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE CI555(IKJEAT03,IKJEAS02,IKJGG008)
  INCLUDE CI555(IKJEAT04,IKJEAT05,IKJEAT06,IKJEAT07)
  INCLUDE CI555(IKJEAT08,IKJEAI00,IKJEAR00,IKJEAR01)
  INCLUDE CI555(IKJEAR02,IKJEAR03,IKJEAR04,IKJEAR05)
  ALIAS IKJEAT04,IKJEAT05,IKJEAT06,IKJEAT07,IKJEAT08
  ALIAS IKJEAI00,IKJEAI01,IKJEAI02,IKJEAI03,IKJEAR00
  ALIAS IKJEAR01
  ENTRY IKJEAT03
  NAME IKJEAT03(R)
  INCLUDE CI555(IKJEAT01)
  ALIAS IKJEAT09
  ENTRY IKJEAT01
  NAME IKJEAT01(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK50  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK51 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG60 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//CQ548 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CQ548
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI555(IKJGGQT0)   FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYAA)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYHH)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYII)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYLL)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYOO)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYGP)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CQ548(IEDAYZZ)    FROM CQ548 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IKJGG088)   FROM CI555 TO IKJGGQT0 IN LINKLIB
 ENTRY   IKJGGQT0          FIRST ENTRY POINT
 ALIAS   IKJGGQT1          SECOND ENTRY POINT
 NAME    IKJGGQT0(R)       ALL 9 MODULES IN THIS MEMBER NAME
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK51  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK52 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG61 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,REUS,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
    INCLUDE CI555(IKJEFP00,IKJEFP10,IKJEFP20)
    ENTRY IKJPARS
    NAME IKJPARS(R)
    INCLUDE CI555(IKJEFP60)
    ENTRY IKJPARS2
    NAME IKJPARS2(R)
    INCLUDE CI555(IKJEFP30,IKJEFP20)
    ENTRY IKJSCAN
    NAME IKJSCAN(R)
    INCLUDE CI555(IKJEFD00)
    ENTRY IKJEFD00
    ALIAS IKJDAIR
    NAME IKJEFD00(R)
    INCLUDE CI555(IKJEFLF)
    ALIAS IKJEAL00,IKJEAL01
    NAME IKJEFLF(R)
    INCLUDE CI555(IKJEFLG,IKJEFLGB,IKJEFLGH)
    INCLUDE CI555(IKJEFLH)
    INCLUDE SYSPUNCH(IKJEFLP0)
    ENTRY IKJEFLG
    ALIAS IKJEFLGB,IKJEFLH,IKJEFLP0
    NAME IKJEFLG(R)
    INCLUDE CI555(IKJEFLS)
    ENTRY IKJEFLS
    ALIAS IKJEFLS1,IKJEFLS2,IKJEFLS3
    NAME IKJEFLS(R)
    INCLUDE CI555(IKJEFT02,IKJEFT03,IKJEFT04)
    INCLUDE CI555(IKJEFT05,IKJEFT06,IKJEFT07)
    ENTRY IKJEFT02
    ALIAS IKJEFT03,IKJEFT04,IKJEFT05,IKJEFT07
    NAME IKJEFT02(R)
    INCLUDE CI555(IKJEFT30,IKJEFT35,IKJEFT40)
    INCLUDE CI555(IKJEFT45,IKJEFT52,IKJEFT53)
    INCLUDE CI555(IKJEFT54,IKJEFT55,IKJEFT56)
    ALIAS IKJGETL,IKJPUTL,IKJSTCK
    ENTRY IKJPTGT
    NAME IKJPTGT(R)
    INCLUDE CI555(IKJFATRC,IKJFAMSG)
    ENTRY IKJFATRC
    NAME IKJFATRC(R)
    INCLUDE CI555(IKJFATR1,IKJFAMSG,IKJFAERR)
    ENTRY IKJFATR1
    NAME IKJFATR1(R)
    INCLUDE CI555(IKJFASCN,IKJFAMP1,IKJFATP1)
    ENTRY IKJFASCN
    NAME IKJFATRP(R)
    INCLUDE CI555(IKJFATP2,IKJFATAB,IKJFAPUT)
    INCLUDE CI555(IKJFAMP1,IKJFATP1)
    ENTRY IKJFATP2
    NAME IKJFATP2(R)
    INCLUDE CI555(IEEVSND2,IEEVSND5)
    ENTRY IEEVSND2
    NAME IEEVSND2(R)
    INCLUDE CI555(IEEVSND3,IEEVSND5)
    ENTRY IEEVSND3
    NAME IEEVSND3(R)
    INCLUDE CI555(IEEVSND4,IKJEES20)
    ENTRY IEEVSND4
    NAME IEEVSND4(R)
    INCLUDE CI555(IEEVSND8,IEEVSND5)
    ENTRY IEEVSND8
    NAME IEEVSND8(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK52  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK53 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG62 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
    INCLUDE CI555(IKJEES70,IKJEES74,IKJEES75)
    ENTRY IKJEES73
    NAME IKJEES73(R)
    INCLUDE CI555(IKJEFT01,IKJEFT06)
    ENTRY IKJEFT01
    NAME IKJEFT01(R)
    INCLUDE CI555(IKJEFLB)
    ENTRY IKJEFLB
    ALIAS IKJLB1
    NAME IKJEFLB(R)
    INCLUDE CI555(IKJEFLC,IKJEFLCM)
    ENTRY IKJEFLC
    NAME IKJEFLC(R)
    INCLUDE CI555(IKJEFLE,IKJEFLEA)
    ENTRY IKJEFLE
    NAME IKJEFLE(R)
    INCLUDE CI555(IKJEFLGM,IKJEFLGN)
    ENTRY IKJEFLGM
    NAME IKJEFLGM(R)
    INCLUDE CI555(IKJEFLL,IKJEFLLM)
    ENTRY IKJEFLL
    NAME IKJEFLL(R)
    INCLUDE CI555(IKJEFLJ)
    ENTRY IKJEFLJ
    ALIAS IKJLJ1
    NAME IKJEFLJ(R)
    INCLUDE CI555(IKJEFLK)
    ENTRY IKJEFLK
    ALIAS IKJLK1
    NAME IKJEFLK(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK53  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK54 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG63 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,REUS,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
    INCLUDE CI555(IKJEFF40)
    ENTRY IKJEFF40
    ALIAS IKJEFF4A
    NAME IKJEFF40(R)
    INCLUDE CI555(IKJEFF41,IKJEFF42,IKJEFF43,IKJEFF46)
    ENTRY IKJEFF41
    NAME IKJEFF41(R)
    INCLUDE CI555(IKJEFF51,IKJEFF52,IKJEFF54)
    ENTRY IKJEFF51
    NAME IKJEFF51(R)
    INCLUDE CI555(IKJEFF58)
    ENTRY IKJEFF58
    NAME  IKJEFF58(R)
    INCLUDE CI555(IKJEFF59)
    ENTRY IKJEFF59
    NAME  IKJEFF59(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK54  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK55 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG64 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,REUS,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
    INCLUDE DCMDLIB(IKJEES10,IKJEES11)
    INCLUDE CI555(IEEVSDIO,IKJEES20)
    ENTRY IKJEES10
    ALIAS SE
    NAME SEND(R)
    INCLUDE DCMDLIB(IKJEES40)
    INCLUDE CI555(IEEVSDIO,IKJEES20)
    ENTRY IKJEES40
    NAME IKJEES40(R)
    INCLUDE DCMDLIB(IKJEFA00,IKJEFA01)
    ENTRY IKJEFA00
    NAME ACCOUNT(R)
    INCLUDE DCMDLIB(IKJEFA30,IKJEFA31,IKJEFA51)
    INCLUDE DCMDLIB(IKJEFA52,IKJEFA53,IKJEFA54)
    INCLUDE DCMDLIB(IKJEFA32,IKJEFA55)
    ENTRY IKJEFA30
    NAME IKJEFA30(R)
    INCLUDE DCMDLIB(IKJEFA40,IKJEFA41,IKJEFA42)
    INCLUDE DCMDLIB(IKJEFA52,IKJEFA51,IKJEFA55)
    ENTRY IKJEFA40
    NAME IKJEFA40(R)
    INCLUDE DCMDLIB(IKJEFA10,IKJEFA11,IKJEFA12)
    INCLUDE DCMDLIB(IKJEFA13,IKJEFA51)
    INCLUDE DCMDLIB(IKJEFA52,IKJEFA53,IKJEFA55)
    ENTRY IKJEFA10
    NAME IKJEFA10(R)
    INCLUDE DCMDLIB(IKJEFA20,IKJEFA21,IKJEFA22)
    INCLUDE DCMDLIB(IKJEFA23,IKJEFA24,IKJEFA55)
    INCLUDE DCMDLIB(IKJEFA51,IKJEFA52,IKJEFA53)
    INCLUDE DCMDLIB(IKJEFA54)
    ENTRY IKJEFA20
    NAME IKJEFA20(R)
    INCLUDE DCMDLIB(IKJEE100,IKJEE1A0,IKJEE150)
    ENTRY IKJEE100
    ALIAS OPER
    NAME OPERATOR(R)
    INCLUDE DCMDLIB(IKJEFE11,IKJEFE15,IKJEFE16)
    ENTRY IKJEFE11
    ALIAS END,WHEN
    NAME IKJEFE11(R)
    INCLUDE DCMDLIB(IKJEFH01,IKJEFH00,IKJEFH02)
    INCLUDE DCMDLIB(IKJEFH03)
    INCLUDE CI555(IKJEFF02)
    ENTRY IKJEFH01
    ALIAS H
    NAME HELP(R)
    INCLUDE DCMDLIB(IKJEFT80)
    ALIAS TERM
    NAME TERMINAL(R)
    INCLUDE DCMDLIB(IKJEFT82)
    ALIAS PROF
    NAME PROFILE(R)
    INCLUDE DCMDLIB(IKJEFE01,IKJEFE02,IKJEFE03)
    INCLUDE DCMDLIB(IKJEFE05)
    ENTRY IKJEFE01
    ALIAS EX
    NAME EXEC(R)
    INCLUDE DCMDLIB(IKJEFE04,IKJEFE06)
    ENTRY IKJEFE04
    NAME IKJEFE04(R)
    INCLUDE DCMDLIB(IKJEFF04,IKJEFF05,IKJEFF06)
    INCLUDE DCMDLIB(IKJEFF07,IKJEFF08,IKJEFF09)
    INCLUDE DCMDLIB(IKJEFF11,IKJEFF12,IKJEFF13)
    INCLUDE DCMDLIB(IKJEFF14)
    INCLUDE CI555(IKJEFF15)
    ENTRY IKJEFF04
    NAME IKJEFF04(R)
    INCLUDE DCMDLIB(IKJEFF16)
    ENTRY IKJEFF16
    NAME IKJEFF16(R)
    INCLUDE DCMDLIB(IKJEFF01,IKJEFF03)
    INCLUDE CI555(IKJEFF02)
    ENTRY IKJEFF01
    ALIAS SUB
    NAME SUBMIT(R)
    INCLUDE DCMDLIB(IKJEFF50,IKJEFF55)
    INCLUDE CI555(IKJEFF02)
    ENTRY IKJEFF50
    ALIAS IKJEFF5A,ST
    NAME STATUS(R)
    INCLUDE CI555(IKJEES70,IKJEES74,IKJEES75)
    ENTRY IKJEES70
    ALIAS LISTB
    NAME LISTBC(R)
    INCLUDE DCMDLIB(IKJEFD20)
    ENTRY IKJEFD20
    NAME FREE(R)
    INCLUDE DCMDLIB(IKJEFG00)
    ENTRY IKJEFG00
    NAME CALL(R)
    INCLUDE DCMDLIB(IKJEFR00)
    ENTRY IKJEFR00
    ALIAS R
    NAME RUN(R)
    INCLUDE DCMDLIB(IKJEFD30)
    ENTRY IKJEFD30
    ALIAS ALLOC
    NAME ALLOCATE(R)
    INCLUDE DCMDLIB(IKJEFATT)
    ENTRY IKJEFATT
    ALIAS ATTR
    NAME ATTRIB(R)
    INCLUDE DCMDLIB(IKJEFL00)
    ALIAS LOGON
    NAME LOGOFF(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK55  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK56 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG65 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEHREN)
  ALIAS RENAME
  ALIAS REN
  NAME IKJEHREN(R)
  INCLUDE DCMDLIB(IKJEHDEL)
  ALIAS DELETE
  ALIAS D
  NAME IKJEHDEL(R)
  INCLUDE DCMDLIB(IKJEHPRO)
  ALIAS PROTECT
  ALIAS PROT
  NAME IKJEHPRO(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK56  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK57 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG66 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.CMDLIB
//DCMDLIB DD DSNAME=SYS1.DCMDLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DCMDLIB(IKJLKL01,IKJLKMSG)
 ENTRY IKJLKL01
 NAME IKJLKL01(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK57  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK58 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG67 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEGCVT,IKJEGATN,IKJEGSTA)
  INCLUDE DCMDLIB(IKJEGIO,IKJEGSCD,IKJEGMNL)
  ENTRY  IKJEGMNL
  NAME   IKJEGMNL(R)
  INCLUDE DCMDLIB(IKJEGINT,IKJEGIO,IKJEGSCD)
  ENTRY IKJEGINT
  NAME TEST(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK58  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK59 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG68 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEBEFI,IKJEBESE)
  ENTRY IKJEBEFI
  NAME IKJEBEFI(R)
  INCLUDE DCMDLIB(IKJEBECG,IKJEBESE)
  ENTRY IKJEBECG
  NAME IKJEBECG(R)
  INCLUDE SYSPUNCH(IKJEBEIN)
  ENTRY IKJEBEIN
  ALIAS EDIT
  ALIAS IKJEBEIN
  NAME E(R)
  INCLUDE DCMDLIB(IKJEBEMA,IKJEBEAT,IKJEBEUT,IKJEBEAE)
  ENTRY IKJEBEMA
  NAME IKJEBEMA(R)
  INCLUDE DCMDLIB(IKJEBEEN)
  ENTRY IKJEBEEN
  ALIAS IKJEBEXT
  NAME IKJEBEEN(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK59  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK60 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG69 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,OL,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEBEPS)
  INCLUDE SYSPUNCH(IKJEBEPD)
  ENTRY IKJEBEPS
  NAME IKJEBEPS(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK60  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK61 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG70 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEFF60,IKJEFF62,IKJEFF63)
  INCLUDE DCMDLIB(IKJEFF64,IKJEFF68)
  ENTRY IKJEFF60
  ALIAS OUTPUT
  ALIAS OUT
  NAME IKJEFF60(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK61  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK62 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG71 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE CI555(IKJEFF61,IKJEFF66)
  CHANGE  IEFSD110(IKJEFF61)
  INCLUDE  CI505(IEFQAGST,IEFLOCDQ)
  CHANGE  IEFSD112(IKJEFF61)
  INCLUDE CI505(IEFQDELQ,IEFCNVRT,IEFRDWRT)
  ENTRY IKJEFF61
  NAME IKJEFF61(R)
  INCLUDE SYSPUNCH(IKJEFF65)
  ENTRY IKJEFF65
  NAME IKJEFF65(R)
/*
//SG72 EXEC PGM=IEBCOPY,COND=(8,LT)
//SYSUT3 DD DISP=SHR,DSNAME=SYS1.SYSUT3
//SYSUT4 DD DISP=SHR,DSNAME=SYS1.SYSUT4
//SYSPRINT DD SPACE=(121,(750,100),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A
//CI535 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CI535
//CI555 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CI555
//DM508 DD DISP=SHR,VOLUME=(,RETAIN),DSN=SYS1.DM508
//CI505 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CI505
//DHELP DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DHELP
//HELP DD DSNAME=MVT1.HELP,VOLUME=(,RETAIN,SER=MVTRES),            XXXXXXXX
//             UNIT=3330,DISP=OLD
//DUADS DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DUADS
//UADS DD DSNAME=MVT1.UADS,VOLUME=(,RETAIN,SER=MVTRES),            XXXXXXXX
//             UNIT=3330,DISP=OLD
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//CMDLIB DD DSN=MVT1.CMDLIB,VOL=(,RETAIN,SER=MVTRES),
//             UNIT=3330,DISP=OLD
//SVCLIB DD DSNAME=MVT1.SVCLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=3330,DISP=OLD
//LINKLIB DD DSNAME=MVT1.LINKLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//SYSIN DD *
 COPY OUTDD=HELP,INDD=DHELP
 COPY OUTDD=UADS,INDD=DUADS
  COPY    OUTDD=LINKLIB,INDD=CI555
  SELECT MEMBER=(IKJEAT00,IKJEAT02)
  SELECT MEMBER=(IKJEAD02,IKJEAD03,IKJEAP00)
  SELECT MEMBER=(IKJEAS00,IKJEAS01,IKJEAS03)
  COPY   OUTDD=SVCLIB,INDD=CI555
  SELECT MEMBER=((IKJEAX00,IGC0009F))
 COPY OUTDD=SVCLIB,INDD=CI555
 SELECT MEMBER=(IGC0009C,IGC0009D,IGG019TX)
 SELECT MEMBER=(IGG019TY,IGG019TZ,IGG019T3,IGG019T4)
 SELECT MEMBER=(IGG019T5,IGG019T6,IGG019T7,IGG019T8)
 SELECT MEMBER=(IGG0196S,IGG09301,IGG09302)
 SELECT MEMBER=(IGG09303,IGG0940A,IGG0940B,IGG0940C)
 SELECT MEMBER=(IGG0940D,IGG0940E,IGG0940F,IGG0940G)
 SELECT MEMBER=(IGG09400,IGG09404,IGG09405,IGG09406)
 SELECT MEMBER=(IGG09407,IGG09408,IGG09409,IGG0193H)
 COPY OUTDD=LINKLIB,INDD=CI555
 SELECT MEMBER=(IKJGG001,IKJGGE00,IKJGGE01)
 COPY OUTDD=CMDLIB,INDD=DCMDLIB
 SELECT MEMBER=(LINK,LOADGO,LOAD,IKJLKL02)
  COPY OUTDD=CMDLIB,INDD=DCMDLIB
   SELECT MEMBER=(IKJEBERU,IKJEBEMS,IKJEBEFC,IKJEBESA)
   SELECT MEMBER=(IKJEBECO,IKJEBELT,IKJEBELI,IKJEBEMR)
   SELECT MEMBER=(IKJEBEM5,IKJEBEIM,IKJEBEIP,IKJEBESC)
   SELECT MEMBER=(IKJEBELE,IKJEBESN,IKJEBECI,IKJEBEUI)
   SELECT MEMBER=(IKJEBEUT,IKJEBEEX,IKJEBEAA,IKJEBEIA)
   SELECT MEMBER=(IKJEBEDE,IKJEBEME,IKJEBERE,IKJEBEIS)
   SELECT MEMBER=(IKJEBETA,IKJEBEDO,IKJEBEHE)
   SELECT MEMBER=(IKJEBEFO,IKJEBETO,IKJEBEBO,IKJEBEUP)
   SELECT MEMBER=(IKJEBEVE,IKJEBEDA,IKJEBEM6,IKJEBEM7)
   SELECT MEMBER=(IKJEBEM1,IKJEBEM2,IKJEBEM3,IKJEBEM4)
   SELECT MEMBER=(IKJEBECH,IKJEBECN,IKJEBERN)
 COPY OUTDD=CMDLIB,INDD=DCMDLIB
   SELECT MEMBER=IKJEFF67
  COPY OUTDD=SVCLIB,INDD=CI555
   SELECT MEMBER=IGC0009G
   COPY OUTDD=SVCLIB,INDD=CI505
   SELECT MEMBER=IGC0006A               TESTRAN SVC
  COPY OUTDD=CMDLIB,INDD=DCMDLIB
   SELECT MEMBER=(IKJEGLDR,IKJEGQFY,IKJEGSYM,IKJEGAT)
   SELECT MEMBER=(IKJEGPCH,IKJEGLST,IKJEGASN,IKJEGLSA)
   SELECT MEMBER=(IKJEGMAP,IKJEGWHR,IKJEGOFF,IKJEGTCB)
   SELECT MEMBER=(IKJEGDEB,IKJEGPSW,IKJEGDCB,IKJEGEQU)
   SELECT MEMBER=(IKJEGGO,IKJEGRUN,IKJEGCAL,IKJEGDRP)
   SELECT MEMBER=(IKJEGLDF,IKJEGLOD,IKJEGDEL,IKJEGATD)
   SELECT MEMBER=(IKJEGGET,IKJEGFRE,IKJEGCPY)
    COPY OUTDD=LINKLIB,INDD=CI555
    SELECT MEMBER=(IKJEFT25)
    SELECT MEMBER=(IKJEFLA,IKJEFLI,IKJEFLM)
    SELECT MEMBER=(IKJEFLPA,IEFVSCAN)
    SELECT MEMBER=(IEEVDUS1,IEEVGPSD)
    SELECT MEMBER=(IEEVSEND,IEEVSND9)
    COPY OUTDD=SVCLIB,INDD=CI555
    SELECT MEMBER=((IKJEFF00,IGC0010{))
    SELECT MEMBER=(IGC0009I,IGC0109I,IGC0209I)
    SELECT MEMBER=(IGC0309I,IGC0409I,IGC0509I)
    SELECT MEMBER=(IGC0609I,IGC0709I,IGC0809I)
    SELECT MEMBER=(IGC0909I,IGC1009I,IGC1109I)
    SELECT MEMBER=(IGC1209I,IGC1309I,IGC1409I)
    SELECT MEMBER=(IGC1509I,IGC1609I,IGC1709I)
    SELECT MEMBER=(IGC1809I,IGC1909I,IGC2009I)
    SELECT MEMBER=(IGC2109I,IGC2309I,IGC2509I)
    SELECT MEMBER=(IGC2609I,IGC2709I,IGC2809I)
    SELECT MEMBER=(IGC2909I,IGC3009I,IGC3509I)
    COPY OUTDD=LINKLIB,INDD=CI555
    SELECT MEMBER=(IKJEFF02,IKJEFF44,IKJEFF45)
    SELECT MEMBER=(IKJEFF53)
    SELECT MEMBER=(IKJEFF15)
    COPY OUTDD=CMDLIB,INDD=DCMDLIB
    SELECT MEMBER=(IKJEFF10,IKJEFF18)
    SELECT MEMBER=((IKJEFF57,CANCEL))
  COPY  OUTDD=CMDLIB,INDD=DCMDLIB
  SELECT MEMBER=(IKJEHCT1,LISTCAT,LISTC,IKJEHCIR,IKJEHMEM)
   SELECT MEMBER=(IKJEHDEF,IKJDFLT)
  SELECT MEMBER=(IKJEHDS1,LISTDS,LISTD)
  SELECT MEMBER=(IKJEHAL1,LISTALC,LISTA)
  SELECT MEMBER=(IKJEHSIR)
/*
//SG73 EXEC PGM=IEHPROGM,COND=(8,LT)
//SYSPRINT DD SPACE=(121,(500,40),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A
//SYSRES DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//HEL DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//UAD DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//SYSIN DD *
 RENAME DSNAME=MVT1.HELP,NEWNAME=SYS1.HELP,                        XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.UADS,NEWNAME=SYS1.UADS,                        XXXXXXXX
               VOL=3330=MVTRES
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK62  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21CY63 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG74 EXEC PGM=IEBCOPY,COND=(8,LT)
//SYSPRINT DD SPACE=(121,(500,40),RLSE),                               X
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3630),                  X
//             SYSOUT=A
//SYSUT1 DD DSN=SYS1.DMACLIB,
// DISP=SHR
//SYSUT2 DD DSNAME=MVT1.MACLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             DISP=OLD,UNIT=3330
//SYSUT3 DD DISP=OLD,DSN=SYS1.SYSUT3
//SYSUT4 DD DISP=SHR,DSNAME=SYS1.SYSUT4
//TSOMAC DD DSNAME=SYS1.TSOMAC,DISP=SHR
//TCAMMAC DD DSNAME=SYS1.TCAMMAC,DISP=SHR
//SYSIN DD *
 COPY OUTDD=SYSUT2,INDD=SYSUT1
 EXCLUDE MEMBER=(BREAKOFF,BUFFER,CANCELM)
 EXCLUDE MEMBER=(DATESTMP,DIRECT,DLIST,ENDRCV)
 EXCLUDE MEMBER=(ENDREADY,ENDSEND,EOA,EOB,EOBLC)
 EXCLUDE MEMBER=(ERRMSG,INTERCPT)
 EXCLUDE MEMBER=(LOGSEG,LPSTART,MODE,OPCTL)
 EXCLUDE MEMBER=(PAUSE,POLL,POLLIMIT,POSTRCV,POSTSEND)
 EXCLUDE MEMBER=(PROCESS)
 EXCLUDE MEMBER=(RCVHDR,RCVSEG,REROUTE)
 EXCLUDE MEMBER=(ROUTE,SENDHDR,SENDSEG,SEQIN)
 EXCLUDE MEMBER=(SEQOUT,SKIP,SOURCE)
 EXCLUDE MEMBER=(TERM,TERMTBL,TIMESTMP,TRANS,WRU)
 EXCLUDE MEMBER=(RCVEITA2,RCVEZSC3,SENDITA2,SENDZSC3)
 EXCLUDE MEMBER=(ANALYZ,ASGNBFR,ATTNINQ,BUFINQ,DAR)
 EXCLUDE MEMBER=(GAIC,GBFLM,GBINF,GBPOS,GBPST,GCNL)
 EXCLUDE MEMBER=(GCNOP,GCNTRL,GCON,GDCDS,GDPD,GDRD,GDS,GDSF)
 EXCLUDE MEMBER=(GDV,GECF,GECP,GECV,GENSD,GEOS,GEPI2)
 EXCLUDE MEMBER=(GEPM,GESD,GESM,GESU,GEVI2,GEVM,GFEF)
 EXCLUDE MEMBER=(GFFM,GFRM,GIBLC,GINIT,GLCW,GLIC,GLRC,GLRR)
 EXCLUDE MEMBER=(GLTR,GLVS,GMLD,GMLW,GMSR,GMVA,GMVD)
 EXCLUDE MEMBER=(GNOP2,GNOP4,GODEL,GPDI,GRDA,GRDB,GRDE)
 EXCLUDE MEMBER=(GRDS,GREAD,GREADR,GSBLC,GSBPOS,GSCW)
 EXCLUDE MEMBER=(GSERV,GSIC,GSRT,GSXY,GTDD,GTND)
 EXCLUDE MEMBER=(GTNS,GTNZ,GTOS,GTRU,GTR1,GTR2,GTR3)
 EXCLUDE MEMBER=(GTR4,GTSL,GTXT,GTZE,GUSTOR,GWRITE)
 EXCLUDE MEMBER=(IHBGAM1,IHBGAM2,IHBGAM3)
 EXCLUDE MEMBER=(OACB,RLSEBFR,SAEC,SPAR)
 EXCLUDE MEMBER=(RESCN,DSPLY,RDLNE,DEFAREA,DEFCCW)
 COPY OUTDD=SYSUT2,INDD=TSOMAC
 COPY OUTDD=SYSUT2,INDD=TCAMMAC
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21CY63  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21RN64 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG75 EXEC PGM=IEHPROGM,COND=(8,LT)
//SYSPRINT DD SPACE=(121,(500,40),RLSE),                               X
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A
//MACL DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//SYSIN DD *
 RENAME DSNAME=MVT1.MACLIB,NEWNAME=SYS1.MACLIB,                    XXXXXXXX
               VOL=3330=MVTRES
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21RN64  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21LK65 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG76 EXEC PGM=IEWL,COND=(4,LT),REGION=150K,
//  PARM='NCAL,DC,SIZE=(128K,6K),SCTR,LET,LIST,XREF'
//SYSUT1 DD DISP=OLD,DSN=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(500,40),RLSE),                               X
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A
//SYSLMOD DD DISP=(OLD,PASS),UNIT=3330,                            XXXXXXXX
//             VOLUME=SER=MVTRES,                                    XXXXXXXX
//             DSNAME=MVT1.NUCLEUS(IEANUC01)
//CI505 DD DISP=SHR,DSNAME=SYS1.CI505,VOLUME=(,RETAIN)
//DM508 DD DISP=SHR,DSNAME=SYS1.DM508,VOLUME=(,RETAIN)
//CI535 DD DISP=SHR,DSNAME=SYS1.CI535,VOLUME=(,RETAIN)
//IO526 DD DISP=SHR,DSNAME=SYS1.IO526,VOLUME=(,RETAIN)
//CQ513 DD DISP=SHR,DSNAME=SYS1.CQ513,VOLUME=(,RETAIN)
//IO523 DD DISP=SHR,DSNAME=SYS1.IO523,VOLUME=(,RETAIN)
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//CQ548 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CQ548
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//DN539 DD DISP=SHR,DSNAME=SYS1.DN539,VOLUME=(,RETAIN)
//SYSLIN DD *
         INSERT IEAANIP0
       INSERT IEAQFX00
 INSERT IGFCCH
 INCLUDE CQ513(IGC058)
 INCLUDE CQ513(IECTATEN)
 INCLUDE CQ548(IEDQEB)
 INCLUDE CQ548(IEDQATTN)
 INCLUDE SYSPUNCH(IEAANIP0,IEAASU00,IEAQBK00)
 INCLUDE CI505(IEAAEF00)
 INCLUDE CI535(IEAQED02,IEAQID00,IEAQTB00)
 INCLUDE CI555(IKJEASY0,IKJEALK0)
 INCLUDE CI555(IKJEANQ0)
 INCLUDE CI535(IEAQST01)
 INCLUDE CI505(IEA0RT01)
 INCLUDE CI555(IKJEATR0,IKJEAAB0)
 INCLUDE CI555(IKJEATI3)
 CHANGE GETIQE(IEACVT)
         INCLUDE CI535(IEAQSETS)
 INCLUDE SYSPUNCH(IEAQNU00,IEASVC00,IEAQGM01,IEAQPRT0)
 INCLUDE SYSPUNCH(IEAQCH00,IEAQAT00,IEAQET00)
 INCLUDE CI505(IEAPATCH)
 INCLUDE DM508(IFG019RA)
 INCLUDE CI505(IEAQMSGS)
 INCLUDE  DM508(IGC0010C)
 INCLUDE SYSPUNCH(IGFCCH)
 INCLUDE CI505(IFBDCB02)
         INCLUDE CI535(IHLMCIHV)
         INCLUDE CI505(IEAASPRG)
          INCLUDE  CQ513(IECTSVC)
          INCLUDE  CI505(IGC116)
   INCLUDE SYSPUNCH(IEC23XXF)
   INCLUDE CI505(SCXCPMON) INCLUDE ITEL SCXCPMON
   INCLUDE CI505(IECINTRP)
  INCLUDE SYSPUNCH(IEAATR00)
    INCLUDE CI555(IECIPRTS)
      INCLUDE  CI505(IECTATTN)
      INCLUDE CI505(IECURATN)
 INCLUDE  IO526(IGC054)
 INCLUDE  SYSPUNCH(IGC018)
 INCLUDE CI535(IEEBASEC,IEFVPOST)
 INCLUDE CI505(IEECVCRA,IEFQRESD,IEFATECB)
 INCLUDE CI535(IEECMED2,IEECMQWR)
 INCLUDE CI505(IEECVCRX)
 INCLUDE SYSPUNCH(IEECVUCM)
 INCLUDE SYSPUNCH(IEACVTPC)
 INCLUDE CI535(IEAQCB02)
 INCLUDE SYSPUNCH(IEECVH1)
 INCLUDE SYSPUNCH(IEECVT1)
   INCLUDE SYSPUNCH(IEEPFKEY)
 INCLUDE CI505(IEECMDSV,IEECMWSV)
  INCLUDE CI505(IEECMDOM)
 INCLUDE SYSPUNCH(IEECVSUB)
 INCLUDE SYSPUNCH(IGF201)
 INCLUDE DN539(IGFDDR02)
 INCLUDE DN539(IGFDDR03)
 INCLUDE DN539(IGFDDR04)
 INCLUDE DN539(IGFDDRMV)
 INCLUDE DN539(IGFDDR10)
 INCLUDE SYSPUNCH(IFBCTA00)
 INCLUDE DN539(IGFMSB00)
 INCLUDE      CI535(IEWFETCH)
 INCLUDE      CI505(IEWSUOVR)
 INCLUDE IO523(IFFABA)
 INCLUDE IO523(IGC070)
 INCLUDE IO523(IGC084)
 INCLUDE IO523(IFFGRTTR)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK65  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK66 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG77 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.SVCLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IEE3303D)
 NAME IGC3303D(R)
 INCLUDE  CI505(IEE4203D)
 NAME IGC4203D(R)
 INCLUDE  CI505(IEE4303D)
 NAME IGC4303D(R)
 INCLUDE  CI505(IEE4403D)
 NAME IGC4403D(R)
 INCLUDE  CI505(IEE4603D)
 NAME IGC4603D(R)
 INCLUDE  CI505(IEE4703D)
 NAME IGC4703D(R)
 INCLUDE CI505(IEE4803D)
 NAME IGC4803D(R)
 INCLUDE CI505(IEE4903D)
 NAME IGC4903D(R)
 INCLUDE CI505(IEE7203D)
 NAME IGC7203D(R)
 INCLUDE CI505(IEE7303D)
 NAME IGC7303D(R)
 INCLUDE CI505(IEE5703D)
 NAME IGC5703D(R)
 INCLUDE CI505(IEE4103D)
 NAME IGC4103D(R)
 INCLUDE DN539(IGF2603D)
 NAME IGC2603D(R)
 INCLUDE  CI505(IEE4503D)
 NAME IGC4503D(R)
 INCLUDE CI505(IEE5503D)
 NAME IGC5503D(R)
 INCLUDE CI505(IEESMF8C)
 NAME IGC0008C(R)
 INCLUDE CI505(IEESMFOP)
 NAME IGC0108C(R)
 INCLUDE CI505(IEESMFAL)
 NAME IGC0208C(R)
 INCLUDE CI535(IEE0003D)
 NAME IGC0003D(R)
 INCLUDE CI505(IEE0303D)
 NAME IGC0303D(R)
 INCLUDE CI535(IEE5103D)
 NAME IGC5103D(R)
 INCLUDE CI535(IEE5203D)
 NAME IGC5203D(R)
 INCLUDE CI535(IEE5303D)
 NAME IGC5303D(R)
 INCLUDE CI505(IEE5403D)
 NAME IGC5403D(R)
 INCLUDE CI505(IEE0403D)
 NAME IGC0403D(R)
 INCLUDE CI505(IEE0503D)
 NAME IGC0503D(R)
 INCLUDE CI505(IEE0603D)
 NAME IGC0603D(R)
 INCLUDE CI505(IEE8603D)
 NAME IGC8603D(R)
 INCLUDE CI505(IEE6503D)
 NAME IGC6503D(R)
 INCLUDE CI505(IEE6603D)
 NAME IGC6603D(R)
 INCLUDE CI505(IEE0703D)
 NAME IGC0703D(R)
 INCLUDE CI535(IEE3703D)
 NAME IGC3703D(R)
 INCLUDE CI505(IEE0803D)
 NAME IGC0803D(R)
 INCLUDE CI505(IEE3503D)
 NAME IGC3503D(R)
 INCLUDE CI535(IEE3803D)
 NAME IGC3803D(R)
 INCLUDE CI505(IEE0903D)
 NAME IGC0903D(R)
 INCLUDE CI505(IEE8503D)
 NAME IGC8503D(R)
 INCLUDE CI505(IEE1103D)
 NAME IGC1103D(R)
 INCLUDE CI505(IEE5603D)
 NAME IGC5603D(R)
 INCLUDE CI505(IEE5903D)
 NAME IGC5903D(R)
 INCLUDE CI505(IEE6303D)
 NAME IGC6303D(R)
 INCLUDE CI505(IEE6403D)
 NAME IGC6403D(R)
 INCLUDE CI505(IEE6703D)
 NAME IGC6703D(R)
 INCLUDE CI505(IEE6803D)
 NAME IGC6803D(R)
 INCLUDE CI505(IEE6903D)
 NAME IGC6903D(R)
 INCLUDE CI505(IEE7103D)
 NAME IGC7103D(R)
 INCLUDE CI505(IEE7503D)
 NAME IGC7503D(R)
 INCLUDE CI505(IEE7603D)
 NAME IGC7603D(R)
 INCLUDE CI505(IEE7703D)
 NAME IGC7703D(R)
 INCLUDE CI505(IEE7803D)
 NAME IGC7803D(R)
 INCLUDE CI505(IEE7903D)
 NAME IGC7903D(R)
 INCLUDE CI505(IEE00110)
 ALIAS IGC00110
 NAME IGC0011{(R)
 INCLUDE CI505(IEE10110)
 NAME IGC10110(R)
 INCLUDE CI505(IEE11110)
 NAME IGC11110(R)
 INCLUDE CI505(IEE12110)
 NAME IGC12110(R)
 INCLUDE CI505(IEE20110)
 NAME IGC20110(R)
 INCLUDE CI505(IEE21110)
 NAME IGC21110(R)
 INCLUDE CI505(IEE22110)
 NAME IGC22110(R)
 INCLUDE CI505(IEE23110)
 NAME IGC23110(R)
 INCLUDE CI505(IEE40110)
 NAME IGC40110(R)
 INCLUDE CI535(IEE50110)
 NAME IGC50110(R)
 INCLUDE CI505(IEE60110)
 NAME IGC60110(R)
 INCLUDE CI505(IED1303D)
 NAME IGC1303D(R)
 INCLUDE CI555(IKJ5803D)
 NAME IGC5803D(R)
 INCLUDE CI505(IEE3103D)
 NAME IGC3103D(R)
 INCLUDE CI505(IHK1503D)
 NAME IGC1503D(R)
 INCLUDE CI505(IEE2103D)
 NAME IGG2103D(R)
 INCLUDE CI505(IEE2303D)
 NAME IGC2303D(R)
 INCLUDE DN539(IGF2503D)
 NAME IGC2503D(R)
 INCLUDE DN539(IGF2403D)
 NAME IGC2403D(R)
 INCLUDE SYSPUNCH(IEE3203D)
 NAME IGC3203D(R)
 INCLUDE CI505(IEE2903D)
 NAME IGC2903D(R)
 INCLUDE CI505(IEECMOCP)
 NAME IGC2I07B(R)
 INCLUDE CI535(IEEMVWTO)
 NAME IGC0003E(R)
 INCLUDE CI505(IEECVOCX)
 NAME IGC0I07B(R)
 INCLUDE CI505(IEECVOCC)
 NAME IGC1I07B(R)
 INCLUDE CI505(IEEVWTOR)
 NAME IGC0103E(R)
 INCLUDE CI505(IEFWTP00)
 NAME IGC0203E(R)
 INCLUDE CI505(IEFWTP01)
 NAME IGC0303E(R)
 INCLUDE CI505(IEFWTP02)
 NAME IGC0403E(R)
 INCLUDE CI505(IEFXQM00)
 NAME IGC0009{(R)
 INCLUDE CI505(IEFXQM01)
 NAME IGC0109{(R)
 INCLUDE CI505(IEFXQM02)
 NAME IGC0209{(R)
 INCLUDE CI505(IEFXQM03)
 NAME IGC0309{(R)
 INCLUDE CI505(IEE1603D)
 NAME IGC1603D(R)
 INCLUDE CI505(IEE0303F)
 NAME IGC0003F(R)
 INCLUDE CI505(IEE0403F)
 NAME IGC0403F(R)
 INCLUDE CI505(IEECLCTX)
 NAME IGCXL07B(R)
 INCLUDE CI505(IEECMCTX)
 NAME IGCXM07B(R)
 INCLUDE CI505(IEECNCTX)
 NAME IGCXN07B(R)
 INCLUDE CI505(IEECOCTX)
 NAME IGCXO07B(R)
 INCLUDE CI505(IEE1A03D)
 NAME IGC1203D(R)
 INCLUDE CI505(IEE1B03D)
 NAME IGC1B03D(R)
 INCLUDE CI505(IEECMCTR)
 NAME IGC0007B(R)
 INCLUDE CI505(IEECMPMP)
 NAME IGC2107B(R)
 INCLUDE CI505(IEECMPMC)
 NAME IGC1107B(R)
 INCLUDE CI505(IEECMPMX)
 NAME IGC0107B(R)
 INCLUDE CI505(IEECVETW)
 NAME IGC5W07B(R)
 INCLUDE CI505(IEECMWTL)
 NAME IGC0907B(R)
 INCLUDE CI505(IEECMPM1)
 NAME IGC0207B(R)
 INCLUDE CI505(IEECVML3)
 NAME IGC0603E(R)
 INCLUDE CI505(IEECVML5)
 NAME IGC0703E(R)
 INCLUDE CI505(IEECVML6)
 NAME IGC0803E(R)
 INCLUDE CI505(IEECVML7)
 NAME IGC0903E(R)
 INCLUDE CI505(IEECVFT1)
 NAME IGC6107B(R)
 INCLUDE CI505(IEECVFTA)
 NAME IGC6A07B(R)
 INCLUDE CI505(IEECVFTB)
 NAME IGC6B07B(R)
 INCLUDE CI505(IEECVFT2)
 NAME IGC6207B(R)
 INCLUDE CI505(IEECVFTD)
 NAME IGC6D07B(R)
 INCLUDE CI505(IEECVFTN)
 NAME IGC6N07B(R)
 INCLUDE CI505(IEECVFTP)
 NAME IGC6P07B(R)
 INCLUDE CI505(IEECVFTL)
 NAME IGC6L07B(R)
 INCLUDE CI505(IEECVFTM)
 NAME IGC6M07B(R)
 INCLUDE CI505(IEECVFTZ)
 NAME IGC6Z07B(R)
 INCLUDE CI505(IEECVFTO)
 NAME IGC6O07B(R)
 INCLUDE CI505(IEECVFTQ)
 NAME IGC6Q07B(R)
 INCLUDE CI505(IEECXDOM)
 NAME IGC0008G(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK66  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK67 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG78 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 CHANGE IEFSD059(IEFVM2)
 INCLUDE CI505(IEFVMLS1)
 INCLUDE CI535(IEFSD180)
 INCLUDE CI505(IEFSD21Q,IEF41FAK,IEFWSTRT)
 CHANGE IEFSD059(IEFVM2)
 INCLUDE CI505(IEFVM3LS)
 CHANGE IEFSD059(IEFVM2)
 INCLUDE CI505(IEFVM5LS,IEFVM2LS,IEFVM4LS)
 INCLUDE CI505(IEFQMLK1,IEFYSVMS,IEFVM76)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQMRAW)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI505(IEFCVFAK)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFXCSSS)
 INCLUDE CI505(IEFSCAN)
 INCLUDE SYSPUNCH(IEFDEVPT)
 INCLUDE SYSPUNCH(CHLOADTB)
 INCLUDE CI505(IEFVKMSG,IEFWAFAK)
 INCLUDE CI505(IEFXAMSG,IEFWCFAK,IEFWDFAK)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFVKIMP)
 INCLUDE CI505(IEFVMLK5)
 INCLUDE CI505(IEFACTFK)
 ALIAS IEFVM1,IEFXA,IEFVMCVL
 ENTRY IEFW21SD
 NAME IEFW21SD(R)
 INCLUDE SYSPUNCH(IEFWMAS1)
 NAME DEVNAMET(R)
 INCLUDE SYSPUNCH(IEFWMSKA)
 NAME DEVMASKT(R)
 INCLUDE SYSPUNCH(CHLOADTB)
 NAME CHLOADTB(R)
 INCLUDE CI535(IEFDSOCR)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI535(IEFSD112)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI505(IEFQMNQQ)
 CHANGE IEFSD598(IEFSD068)
 CHANGE IEFSD510(IEFSD068)
 CHANGE IEFSD061(IEFSD068)
 CHANGE IEFVSDRA(IEFSD068)
 INCLUDE CI505(IEFSD168)
 ENTRY IEFDSOCR
 NAME IEFDSOCR(R)
 INCLUDE CI505(IEFDSOFB)
 NAME IEFDSOFB(R)
 INCLUDE CI505(IEESMFIT)
 ALIAS IEESMFI4
 ENTRY IEESMFIT
 NAME IEESMFIT(R)
 INCLUDE CI505(IEESMFI3)
 ALIAS IEESMFMS,IEESMFIO
 NAME IEESMFI3(R)
 INCLUDE CI505(IEESMFI2)
 ENTRY IEESMFI2
 NAME IEESMFI2(R)
 INCLUDE CI505(IEESMFOI)
 ENTRY IEESMFOI
 NAME IEESMFOI(R)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFMCVOL)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFVMLS6)
 INCLUDE CI505(IEFVMLS7,IEFVMFAK)
 INCLUDE CI505(IEFVMMS1,IEF41FAK)
 INCLUDE CI505(IEFYSVMS,IEFQMLK1)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQMRAW)
 INCLUDE CI535(IEFSD111)
 ALIAS IEFCVOL1,IEFCVOL2,IEFCVOL3
 ENTRY IEFCVOL1
 NAME  IEFMCVOL(R)
 INCLUDE CI505(IEFXV001,IEFXVMSG,IEFXVNSL,IEFX5000)
 INCLUDE CI505(IEFSCAN)
 INCLUDE SYSPUNCH(IEFDEVPT)
 INCLUDE CI505(IEFXV002)
 INCLUDE CI505(IEFXV003)
 INCLUDE CI505(IEFXDPTH)
 INCLUDE CI505(IEFXJFAK,IEFSD551,IEFX300A,IEFXH000)
 INCLUDE CI505(IEFWCFAK,IEFSD552,IEFWD001)
 CHANGE IEFXT000(IEFXV001)
 CHANGE IEFW1FAK(IEFXV001)
 CHANGE IEFW2FAK(IEFXV001)
 CHANGE IEFXK000(IEFXV001)
 INCLUDE CI505(IEFWD000)
 INCLUDE CI505(IEFCVFAK)
 CHANGE IEFQASGN(IEFQMRAW)
 INCLUDE CI505(IEFQMLK1)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI535(IEFSD111)
 ALIAS IEFXV001
 ENTRY IEFXV001
 NAME IEFXVAVR(R)
 INCLUDE CI505(IEFWA000,IEFX300A)
 INCLUDE CI505(IEFAVFAK)
 INCLUDE CI505(IEFWSWIN)
 CHANGE IEFSEPAR(IEFW41SD)
 INCLUDE SYSPUNCH(IEFSGOPT)
 INCLUDE CI505(IEFSCAN)
 INCLUDE CI505(IEFXDPTH)
 INCLUDE CI505(IEFSD552)
 INCLUDE CI505(IEFX5000,IEFWCIMP,IEFXH000)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI505(IEFQMLK1,IEFYSVMS)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQMRAW)
 INCLUDE CI505(IEFWDFAK,IEFXJFAK,IEF41FAK)
 INCLUDE CI505(IEFSD551)
 INCLUDE SYSPUNCH(IEFDEVPT)
 ALIAS IEFWC000
 ENTRY IEFWA000
 NAME IEFWA000(R)
 INCLUDE CI505(IEEVPRES,IEFK1MSG,IEFPRES)
 INCLUDE CI505(IEFSCAN)
 INCLUDE SYSPUNCH(IEFDEVPT)
 ENTRY IEEVPRES
 NAME IEEVPRES(R)
 INCLUDE CI505(IEFWD000,IEFWD001)
 INCLUDE CI505(IEFXT00D,IEFXTDMY,IEFSD195,IEFSD096)
 CHANGE IEFW41SD(IEFWEXTA)
 INCLUDE CI505(IEFXT002)
 INCLUDE CI505(IEFSD097,IEFQMLK1,IEFYSVMS,IEFQMRAW)
 INCLUDE CI505(IEFXT003)
 INCLUDE CI505(IEFXKFAK)
 INCLUDE CI505(IEFWEXTA)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFSD41Q,IEFXJFAK)
 INCLUDE CI505(IEFVMMS1)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI505(IEFXTMSG)
 INCLUDE CI505(IEFCVFAK)
 ALIAS IEFW41SD
 ENTRY IEFWD000
 NAME IEFWD000(R)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFVMLS6,IEFVMLS7)
 INCLUDE CI505(IEFSD195,IEFSD096)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFXJIMP,IEFXJMSG)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFXKIMP,IEFXKMSG)
 INCLUDE CI505(IEFSD41Q,IEFXAFAK)
 INCLUDE CI505(IEFCVFAK,IEFVMMS1,IEFQMLK1)
 INCLUDE CI505(IEFYSVMS,IEFQMRAW)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 INCLUDE CI535(IEFSD111)
 ALIAS IEFXJX5A,IEFV15XL,IEFXJ000,IEFXK000
 ENTRY IEFVM6
 NAME IEFVM6LS(R)
 INCLUDE CI535(IEEPALTR)
 NAME IEEPALTR(R)
 INCLUDE CI505(IEFPRTXX)
 ALIAS IEFPRT,SPRINTER
 NAME IEFPRINT(R)
 INCLUDE SYSPUNCH(IEEVIPL)
 INCLUDE DN539(ICFBIX00)
 ENTRY IEEVIPL
 NAME IEEVIPL(R)
 INCLUDE CI555(IEEVSIPL)
 NAME IEEVSIPL(R)
 INCLUDE CI505(IEE2103D)
 NAME IEE2103D(R)
 INCLUDE CI535(IEECVINT)
 INCLUDE CI505(IEEVRFRX)
 ENTRY IEECVCTI
 NAME IEECVCTI(R)
 INCLUDE CI535(IEEVDSP1,IEEVDRGN)
 ENTRY IEEVDSP1
 NAME IEEVDSP1(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK67  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK68 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG79 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,REFR,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI535(IEFIRC)
 INCLUDE CI505(IEEVSMSG)
 ENTRY IEFIRC
 NAME IEFIRC(R)
 INCLUDE CI505(IEFVH1,IEEVSMSG)
 CHANGE IEFK2(IEFVH2)
 INCLUDE CI505(IEFVH2)
 ENTRY IEFVH1
 NAME IEFVH1(R)
 CHANGE IEFK3(IEFVHN)
 INCLUDE CI505(IEFVHN)
 NAME IEFVHN(R)
 CHANGE INEPKG03(IEFVHA)
 INCLUDE CI505(IEFVHA)
 INCLUDE CI505(IEFVHAA,IEFVHB,IEFVHC)
 INCLUDE CI505(IEFVHCB,IEFVHE,IEFVHEB,IEFVHEC)
 INCLUDE CI505(IEFVHF,IEFVHL,IEFHMFAK,IEFVHG)
 INCLUDE CI505(IEFVHH,IEFVHQ,IEFVFA,IEFVGK)
 INCLUDE CI505(IEFVGT,IEFVGM,IEFJAFAK,IEFVEA)
 INCLUDE CI505(IEFVDA,IEFVGI,IEFVGS)
 INCLUDE CI535(IEFHRFK1)
 INCLUDE CI505(IEFVSD12,IEFVSD13)
 INCLUDE CI505(IEFVDBSD)
 INCLUDE CI505(IEFACT)
 INCLUDE CI505(IEFVHHB,IEFQMDUM,IEFVFB)
 INCLUDE CI535(IEFVKG)
 INCLUDE CI505(IEFVIND)
 ALIAS IEFVHCB
 ALIAS IEFVHREP
 ALIAS IEFVHF
 ENTRY IEFVHA
 NAME IEFVHA(R)
 INCLUDE CI535(IEFHRFK2)
 INCLUDE CI535(IEFVHR)
 ALIAS IEFHRFK2
 NAME IEFMVTHR(R)
 CHANGE IEFQMSSS(IEFVHQ)
 INCLUDE CI505(IEFVHQ,IEFHFFAK,IEFVGM)
 INCLUDE CI505(IEFVGT,IEFVGK,IEFVJA)
 INCLUDE CI535(IEFVHR)
 ALIAS IEFVJA
 ENTRY IEFVJA
 NAME IEFMVTJA(R)
 CHANGE IEFQMSSS(IEFVHQ)
 INCLUDE CI505(IEFVHQ,IEFVHM,IEFVGM)
 INCLUDE CI505(IEFHAFAK)
 INCLUDE CI535(IEFVHR)
 ALIAS IEFVHM
 ENTRY IEFVHM
 NAME IEFMVTHM(R)
 INCLUDE CI505(IEFVINA,IEFVINB,IEFVINC,IEFVINE)
 INCLUDE CI505(IEZNCODE,IEFVGM)
 CHANGE IEFQMSSS(IEFVHQ)
 INCLUDE CI505(IEFVHQ)
 INCLUDE CI535(IEFVHR)
 ENTRY IEFVINA
 NAME IEFVINA(R)
 INCLUDE CI505(IEZDCODE)
 NAME IEZDCODE(R)
 INCLUDE CI535(IEFSD162,IEFSD103,IEF064SD)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQMRAW,IEFSD514)
 INCLUDE CI535(IEFSD110,IEFSD111,IEFSD112)
 INCLUDE CI535(IEF061SD)
 ALIAS IEFV4221
 ENTRY IEFSD062
 NAME IEFSD062(R)
 INCLUDE CI535(IEFSD161,IEFSD164,IEFSD166)
 INCLUDE CI535(IEFDSTBL,IEFDSLST,IEFDSTRT)
 INCLUDE CI505(IEFSMFLK,IEFACTRT,IEFUJI,IEFUSI)
 INCLUDE CI505(IEFSMFWI,IEFSMFIE)
 INCLUDE CI535(IEFSD101,IEFSD104)
 INCLUDE CI505(IEFSDPPT)
 INCLUDE CI505(IEFIDMPM,IEFSD42Q,IEFIDUMP)
 INCLUDE CI505(IEFYNIMP,IEFYPJB3,IEFVJIMP,IEFZGST1)
 INCLUDE CI505(IEFZGST2)
 INCLUDE CI505(IEFSD22Q,IEFZGMSG,IEFZHMSG)
 INCLUDE CI505(IEFWTERM,IEFSD31Q)
 INCLUDE CI505(IEFSD32Q)
 INCLUDE CI535(IEF060SD)
 INCLUDE CI505(IEFYTVMS,IEFQMLK1,IEFYSVMS)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 INCLUDE CI505(IEFQMRAW,IEFQMNQQ,IEFQMDQQ,IEFQDELQ)
 INCLUDE CI505(IEFQMUNQ,IEFVJMSG,IEFYNMSG,IEFYPMSG)
 INCLUDE CI535(IEFSD110,IEFSD111,IEFSD112)
 INCLUDE CI505(IEFZAJB3,IEFZGJB1)
 INCLUDE CI505(IEFRPREP)
 INCLUDE CI505(IEFSD514)
 CHANGE IEFSD598(IEFSD061),IEFSD510(IEFSD061)
 INCLUDE CI505(IEFSD168)
 INCLUDE CI505(IEFVSDRA)
 INCLUDE SYSPUNCH(IEFYRCDS)
 ALIAS IEFSD064
 ALIAS IEFW42SD
 ALIAS IEFSD104
 ENTRY IEFSD061
 NAME IEFSD061(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK68  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK69 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG80 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IEFSD055,IEFORMAT,IEF300SD,IEF304SD)
 INCLUDE CI505(IEFSD311)
 INCLUDE SYSPUNCH(IEFQMSGV)
 ENTRY IEFSD055
 NAME IEFSQINT(R)
 INCLUDE CI505(IEFSD312)
 INCLUDE CI505(IEFSD300,IEFSD301,IEFSD302)
 INCLUDE CI505(IEFSD303,IEFSD310)
 ENTRY IEFSD300
 NAME IEFSD300(R)
 INCLUDE CI505(IEFSD304,IEFSD305)
 INCLUDE CI505(IEFSD310,IEFSD312)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 CHANGE IEFSD112(IEFQDELE)
 INCLUDE CI505(IEFQDELQ)
 INCLUDE CI505(IEFVSDRD)
 INCLUDE CI505(IEFVSDRA)
 INCLUDE CI505(IEFSD514)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 CHANGE IEFSD111(IEFQMRAW)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 ENTRY IEFSD305
 NAME IEFSD304(R)
 INCLUDE CI505(IEFSD308)
 NAME IEFSD308(R)
 INCLUDE CI505(IEEVSTAR,IEEVJCL)
 ENTRY IEEVSTAR
 NAME IEEVSTAR(R)
 INCLUDE CI535(IEEPRWI2)
 NAME IEEPRWI2(R)
 INCLUDE CI535(IEEVMNT1)
 INCLUDE CI505(IEEVJCL)
 ENTRY IEEVMNT1
 NAME IEEVMNT1(R)
 INCLUDE CI535(IEEVMNT2)
 INCLUDE CI505(IEEVSMSG)
 ENTRY IEEVMNT2
 NAME IEEVMNT2(R)
 INCLUDE CI505(IEEVRCTL)
 NAME IEEVRCTL(R)
 INCLUDE CI505(IEEVRC)
 INCLUDE CI505(IEEVSMSG,IEFCNVRT,IEFRDWRT)
 INCLUDE CI535(IEEVICTL)
 ALIAS IEEVIC
 ENTRY IEEVRC
 NAME IEEVRC(R)
 INCLUDE CI505(IEEVOMSG)
 NAME IEEVOMSG(R)
 INCLUDE CI505(IEFVINB)
 NAME IEFVINB(R)
 INCLUDE CI505(IEZNCODE)
 NAME IEZNCODE(R)
 INCLUDE CI535(IEFVMA)
 ENTRY IEFVMA
 NAME IEFVMA(R)
 INCLUDE CI535(IEFVMB)
 CHANGE IEFSD110(IEFQAGST)
 INCLUDE CI505(IEFQAGST)
 CHANGE IEFSD111(IEFQASGN)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 INCLUDE CI505(IEZNCODE)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 ENTRY IEFVMB
 NAME IEFVMB(R)
 INCLUDE CI535(IEFVMBC)
 ENTRY IEFVMBC
 NAME IEFVMBC(R)
 INCLUDE CI535(IEFVMC)
 ENTRY IEFVMC
 NAME IEFVMC(R)
 INCLUDE CI535(IEFVMD)
 CHANGE IEFSD112(IEFQDELE)
 INCLUDE CI505(IEFQDELQ)
 ENTRY IEFVMD
 NAME IEFVMD(R)
 INCLUDE CI535(IEFVME)
 ENTRY IEFVME
 NAME IEFVME(R)
 INCLUDE CI535(IEFVMF)
 INCLUDE CI535(IEFVMG)
 INCLUDE CI535(IEFVMH)
 INCLUDE CI535(IEFSD110)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI535(IEFSD112)
 INCLUDE CI505(IEFQBVMS)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI505(IEFQMNQQ)
 INCLUDE CI505(IEFQAGST)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 INCLUDE CI505(IEFQMDQQ)
 INCLUDE CI505(IEFQDELQ)
 INCLUDE CI505(IEFQMUNQ)
 INCLUDE CI505(IEZDCODE)
 ENTRY IEFVMF
 NAME IEFVMF(R)
 INCLUDE CI505(IEEVICLR)
 ALIAS IEFICR
 NAME IEEVICLR(R)
 INCLUDE CI505(IEEVLDSP)
 NAME IEEVLDSP(R)
 INCLUDE CI505(IEEVLOUT)
 NAME IEEVLOUT(R)
 INCLUDE CI535(IEEVLIN1)
 INCLUDE CI505(IEEVRFRX)
 ENTRY IEEVLIN
 NAME IEEVLIN(R)
 INCLUDE CI535(IEELOG01)
 NAME IEEVLIN2(R)
 INCLUDE CI535(IEEVLIN3)
 NAME IEEVLIN3(R)
 INCLUDE CI535(IEEPPRES)
 ENTRY IEEPPRES
 NAME IEEPPRES(R)
 INCLUDE CI505(IEFRCLN1)
 NAME IEFRCLN1(R)
 INCLUDE CI505(IEFRCLN2)
 NAME IEFRCLN2(R)
 INCLUDE CI505(IEFVRRC)
 INCLUDE CI505(IEFSD514)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 CHANGE IEFSD111(IEFQASGN)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 ALIAS IEFVRRCA,IEFVRRCB
 ENTRY IEFVRRC
 NAME IEFVRRC(R)
 INCLUDE CI505(IEFVRR1)
 INCLUDE CI505(IEFLOCDQ,IEFCNVRT,IEFRDWRT)
 ENTRY IEFVRR1
 NAME IEFVRR1(R)
 INCLUDE CI505(IEFVRR2)
 ENTRY IEFVRR2
 ALIAS IEFVR2AE
 NAME IEFVRR2(R)
 INCLUDE CI505(IEFVRR3)
 INCLUDE CI505(IEFQDELQ)
 INCLUDE CI535(IEFSD112)
 ENTRY IEFVRR3
 ALIAS IEFVR3AE
 NAME IEFVRR3(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK69  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK70 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG81 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IEESD562)
 ENTRY IEESD562
 ALIAS IEESD562
 NAME IEEVDNX1(R)
 INCLUDE CI505(IEESD563)
 ENTRY IEESD563
 NAME IEESD563(R)
 INCLUDE CI505(IEESD564)
 ENTRY IEESD564
 NAME IEESD564(R)
 INCLUDE CI505(IEESD584)
 NAME IEESD584(R)
 INCLUDE CI505(IEESD565)
 ENTRY IEESD565
 NAME IEESD565(R)
 INCLUDE CI505(IEESD575,IEESD581)
 ENTRY IEESD575
 ALIAS IEESD581
 NAME IEESD575(R)
 CHANGE IEFSD112(IEESD576)
 INCLUDE CI505(IEFQDELQ,IEESD576,IEESD580)
 ENTRY IEESD576
 ALIAS IEESD580
 NAME IEESD576(R)
 INCLUDE CI505(IEESD577)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 ENTRY IEESD577
 NAME IEESD577(R)
 INCLUDE CI505(IEESD579)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 ENTRY IEESD579
 NAME IEESD579(R)
 INCLUDE CI505(IEESD578)
 ENTRY IEESD578
 NAME IEESD578(R)
 INCLUDE CI505(IEESD582)
 ENTRY IEESD582
 ALIAS IEESD82A
 NAME IEESD582(R)
 INCLUDE CI505(IEESD583)
 ENTRY IEESD583
 NAME IEESD583(R)
 INCLUDE CI505(IEFBR14)
 NAME IEFBR14(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK70  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK71 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG82 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI535(IEEPDISC)
 ENTRY IEEPDISC
 NAME IEEPDISC(R)
 INCLUDE CI505(IEEXEDNA)
 ENTRY IEEXEDNA
 NAME IEEXEDNA(R)
 INCLUDE CI535(IEELWAIT)
 INCLUDE CI505(IEESMFWR)
 ENTRY IEELWAIT
 ALIAS IEESMFWR
 NAME IEELWAIT(R)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI505(IEFDSDRP)
 CHANGE IEFSD111(IEFQMRAW)
 CHANGE IEFSD113(IEFQMRAW)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 CHANGE IEFQMNQ2(IEFQMRAW)
 CHANGE IEFQDELE(IEFQMRAW)
 CHANGE IEFQAGST(IEFQMRAW)
 INCLUDE CI505(IEFQBVMS)
 INCLUDE SYSPUNCH(IEFDEVPT)
 ENTRY IEFDSDRP
 NAME IEFDSDRP(R)
 INCLUDE CI505(IEFRSTRT)
 ALIAS IEFSMR
 NAME IEFRSTRT(R)
 INCLUDE CI535(IEFIIC)
 NAME IEFIIC(R)
 INCLUDE CI535(IEEPRTN2)
 ALIAS IEERGN
 NAME IEEPRTN(R)
 INCLUDE CI535(IEFSD160,IEF061SD)
 ENTRY IEFSD060
 NAME IEFSD060(R)
 INCLUDE CI535(IEFSD102)
 ENTRY IEFSD102
 NAME IEFSD102(R)
 INCLUDE CI505(IEFUJV)
 NAME IEFUJV(R)
 INCLUDE CI505(IFASMFDP)
 NAME IFASMFDP(R)
 INCLUDE CI505(IEEVRJCL,IEEPSN)
 ENTRY IEEVRJCL
 ALIAS IEEPSN
 NAME IEEVRJCL(R)
 INCLUDE CI505(IEEVLNKT)
 NAME IEEVLNKT(R)
 INCLUDE CI535(IEEVWAIT)
 ALIAS IEEVWDAR
 NAME IEEVWAIT(R)
 INCLUDE CI505(IEFSMFAT,IEFUTL,IEFUSO)
 INCLUDE CI535(IEFSD263)
 ENTRY IEFSD263
 NAME IEFSD263(R)
 INCLUDE CI535(IEFDSOLP)
 NAME IEFDSOLP(R)
 INCLUDE CI505(IEFSD078,IEF079SD)
 ENTRY IEFSD078
 NAME IEFSD078(R)
 INCLUDE CI505(IEFSD070)
 ALIAS IEFSD70A
 NAME IEFSD070(R)
 INCLUDE CI505(IEFSDXYZ)
 ENTRY IEFSDXYZ
 NAME IEFSDXYZ(R)
 INCLUDE CI505(IEFSD080,IEFSD081,IEFSD083)
 INCLUDE CI505(IEFQMUNQ,IEFSD082)
 INCLUDE CI505(IEFSD079,IEFSD084,IEF078SD)
 CHANGE IEFSD112(IEFQDELE)
 INCLUDE  CI505(IEFQDELQ)
 CHANGE IEFSD110(IEFQMDQ2),IEFSD111(IEFQMDQ2)
 INCLUDE CI505(IEFQMDQQ)
 ALIAS IEEVWTR1
 ALIAS IEFSD079
 ENTRY IEFSD080
 NAME IEFSD080(R)
 INCLUDE CI505(IEFSD085,IEFSD171)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 ALIAS IEF085SD
 ALIAS IEF850SD
 ALIAS IEFSD071
 ENTRY IEFSD085
 NAME IEFSD085(R)
 INCLUDE CI505(IEFSD086,IEFSD088,IEFSD089)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 ALIAS IEF086SD
 ENTRY IEFSD086
 NAME IEFSD086(R)
 INCLUDE CI505(IEFSD087,IEFSD088,IEFSD089)
 ENTRY IEFSD087
 NAME IEFSD087(R)
 INCLUDE CI505(IEFSD094,IEFSD095)
 INCLUDE CI505(IEFSD088,IEFSD089)
 ENTRY IEFSD094
 NAME IEFSD094(R)
 INCLUDE CI505(IEFSDXXX)
 ENTRY IEFSDXXX
 NAME IEFSDXXX(R)
 INCLUDE CI505(IEFSDTTE)
 ENTRY IEFSDTTE
 NAME IEFSDTTE(R)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 NAME IEFQMNQ2(R)
 CHANGE IEFSD110(IEFQMDQ2),IEFSD111(IEFQMDQ2)
 INCLUDE CI505(IEFQMDQQ)
 ALIAS IEFQMDQ2
 NAME IEFQMDQQ(R)
 CHANGE IEFSD112(IEFQDELE)
 INCLUDE CI505(IEFQDELQ)
 NAME IEFQDELE(R)
 INCLUDE CI505(IEFQMUNQ)
 NAME IEFQMUNC(R)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 NAME IEFQMRAW(R)
 INCLUDE CI505(IEFQINTZ)
 NAME IEFQINTZ(R)
 INCLUDE CI535(IEFSD0XX)
 NAME IEFSD0XX(R)
 INCLUDE CI505(IEFSD105)
 ENTRY IEFSD105
 NAME IEFSD105(R)
 INCLUDE CI505(IEFQBVMS)
 CHANGE IEFSD110(IEFQAGST)
 INCLUDE CI505(IEFQAGST)
 CHANGE IEFSD111(IEFQASGN)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI535(IEFIRCB)
 ALIAS IEFIRCB
 ENTRY IEFQMSSS
 NAME IEFQMSSS(R)
 INCLUDE CI505(IEE0503D)
 NAME IEE0503D(R)
 INCLUDE CI505(IEFQAGST)
 INCLUDE CI535(IEFSD110)
 ENTRY IEFQAGST
 NAME IEFQMSTK(R)
 CHANGE IEFSD110(IEFQMRAW)
 INCLUDE CI505(IEFQAGST)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQBVMS)
 CHANGE IEFSD112(IEFQMRAW)
 INCLUDE CI505(IEFQMNQQ)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI535(IEFSD111)
 ENTRY IEFQMSSS
 NAME IEFQMSK1(R)
 INCLUDE CI505(IEFDSOCP)
 ENTRY IEFDSOCP
 NAME IEFDSO(R)
 CHANGE IEFSD514(IEFDSOSM)
 CHANGE IEFQMRAW(IEFDSOSM)
 INCLUDE CI505(IEFDSOSM)
 NAME IEFDSOSM(R)
 INCLUDE CI505(IEFDSOAL)
 NAME IEFDSOAL(R)
 INCLUDE CI505(IEFDSOWR)
 NAME IEFDSOWR(R)
 INCLUDE CI505(IEFVGM1)
 NAME IEFVGM1(R)
 INCLUDE CI505(IEFVGM2)
 NAME IEFVGM2(R)
 INCLUDE CI505(IEFVGM3)
 NAME IEFVGM3(R)
 INCLUDE CI505(IEFVGM4)
 NAME IEFVGM4(R)
 INCLUDE CI505(IEFVGM5)
 NAME IEFVGM5(R)
 INCLUDE CI505(IEFVGM6)
 NAME IEFVGM6(R)
 INCLUDE CI505(IEFVGM7)
 NAME IEFVGM7(R)
 INCLUDE CI505(IEFVGM8)
 NAME IEFVGM8(R)
 INCLUDE CI505(IEFVGM9)
 NAME IEFVGM9(R)
 INCLUDE CI505(IEFVGM10)
 NAME IEFVGM10(R)
 INCLUDE CI505(IEFVGM11)
 NAME IEFVGM11(R)
 INCLUDE CI505(IEFVGM12)
 NAME IEFVGM12(R)
 INCLUDE CI505(IEFVGM13)
 NAME IEFVGM13(R)
 INCLUDE CI505(IEFVGM14)
 NAME IEFVGM14(R)
 INCLUDE CI505(IEFVGM15)
 NAME IEFVGM15(R)
 INCLUDE CI505(IEFVGM16)
 NAME IEFVGM16(R)
 INCLUDE CI505(IEFVGM17)
 NAME IEFVGM17(R)
 INCLUDE CI505(IEFVGM18)
 NAME IEFVGM18(R)
 INCLUDE CI505(IEFVGM19)
 NAME IEFVGM19(R)
 INCLUDE CI505(IEFVGM67)
 NAME IEFVGM67(R)
 INCLUDE CI505(IEFVGM70)
 NAME IEFVGM70(R)
 INCLUDE CI505(IEFVGM71)
 NAME IEFVGM71(R)
 INCLUDE CI505(IEFVGM76)
 NAME IEFVGM76(R)
 INCLUDE CI505(IEFVGM78)
 NAME IEFVGM78(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK71  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK72 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG83 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IEECVGCI)
 NAME IEECVGCI(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK72  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK73 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG84 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.SVCLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IEECVFTT)
 NAME IGC6T07B(R)
 INCLUDE CI505(IEECVFTG)
 NAME IGC6G07B(R)
 INCLUDE CI505(IEECVET1)
 NAME IGC5107B(R)
 INCLUDE CI505(IEECVET2)
 NAME IGC5207B(R)
 INCLUDE CI505(IEECVET3)
 NAME IGC5307B(R)
 INCLUDE CI505(IEECVET4)
 NAME IGC5407B(R)
 INCLUDE CI505(IEECVET6)
 NAME IGC5607B(R)
 INCLUDE CI505(IEECVET7)
 NAME IGC5707B(R)
 INCLUDE CI505(IEECVET8)
 NAME IGC5807B(R)
 INCLUDE CI505(IEECVET9)
 NAME IGC5907B(R)
 INCLUDE CI505(IEECVETA)
 NAME IGC5A07B(R)
 INCLUDE CI505(IEECVETC)
 NAME IGC5C07B(R)
 INCLUDE CI505(IEECVETD)
 NAME IGC5D07B(R)
 INCLUDE CI505(IEECVETE)
 NAME IGC5E07B(R)
 INCLUDE CI505(IEECVETF)
 NAME IGC5F07B(R)
 INCLUDE CI505(IEECVETG)
 NAME IGC5G07B(R)
 INCLUDE CI505(IEECVETJ)
 NAME IGC5J07B(R)
 INCLUDE CI505(IEECVETK)
 NAME IGC5K07B(R)
 INCLUDE CI505(IEECVETZ)
 NAME IGC5Z07B(R)
 INCLUDE CI505(IEECVETU)
 NAME IGC5U07B(R)
 INCLUDE CI505(IEECVETV)
 NAME IGC5V07B(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK73  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK74 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG85 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,DC'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//DN527 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN527
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN527(IFCEREP0)
 NAME IFCEREP0(R)
 INCLUDE DN527(IFCEP005)
 NAME IFCEP005(R)
 INCLUDE DN527(IFCEP007)
 NAME IFCEP007(R)
 INCLUDE DN527(IFCEP008)
 NAME IFCEP008(R)
 INCLUDE DN527(IFCEP009)
 NAME IFCEP009(R)
 INCLUDE DN527(IFCRE002)
 NAME IFCRE002(R)
 INCLUDE DN527(IFCRE003)
 NAME IFCRE003(R)
 INCLUDE DN527(IFCMSG00)
 NAME IFCMSG00(R)
 INCLUDE DN527(IFCMES00)
 NAME IFCMES00(R)
 INCLUDE DN527(IFCECUA0)
 NAME IFCECUA0(R)
 INCLUDE DN527(IFCSCUA0)
 NAME IFCSCUA0(R)
 INCLUDE DN527(IFCECUA1)
 NAME IFCECUA1(R)
 INCLUDE DN527(IFCSCUA1)
 NAME IFCSCUA1(R)
 INCLUDE DN527(IFCEVOL0)
 NAME IFCEVOL0(R)
 INCLUDE DN527(IFCSVOL0)
 NAME IFCSVOL0(R)
 INCLUDE DN527(IFCEUKNO)
 ALIAS IFCEUCPU
 ALIAS IFCEUCCH
 ALIAS IFCEUTYP
 ALIAS IFCEUOBR
 NAME IFCEUKNO(R)
 INCLUDE DN527(IFCSUKNO)
 ALIAS IFCSUCPU
 ALIAS IFCSUCCH
 ALIAS IFCSUTYP
 ALIAS IFCSUOBR
 NAME IFCSUKNO(R)
 INCLUDE DN527(IFCEXXXX)
 NAME IFCEXXXX(R)
 INCLUDE DN527(IFCSXXXX)
 NAME IFCSXXXX(R)
 INCLUDE DN527(IFCEXXX0)
 ALIAS IFCE2955
 ALIAS IFCE2703
 ALIAS IFCE2702
 NAME IFCE2701(R)
 INCLUDE DN527(IFCSXXX0)
 ALIAS IFCS2955
 ALIAS IFCS2703
 ALIAS IFCS2702
 NAME IFCS2701(R)
 INCLUDE DN527(IFCEXXX1)
 ALIAS IFCE2495
 ALIAS IFCE2520
 ALIAS IFCE2501
 ALIAS IFCE1442
 NAME IFCE2540(R)
 INCLUDE DN527(IFCSXXX1)
 ALIAS IFCS2495
 ALIAS IFCS2520
 ALIAS IFCS2501
 ALIAS IFCS1442
 NAME IFCS2540(R)
 INCLUDE DN527(IFCEXXX2)
 ALIAS IFCE3210
 ALIAS IFCE3215
 ALIAS IFCE3213
 ALIAS IFCE1053
 ALIAS IFCE2150
 ALIAS IFCE1052
 ALIAS IFCE1445
 NAME IFCE1403(R)
 INCLUDE DN527(IFCSXXX2)
 ALIAS IFCS3210
 ALIAS IFCS3215
 ALIAS IFCS3213
 ALIAS IFCS1053
 ALIAS IFCS2150
 ALIAS IFCS1052
 ALIAS IFCS1445
 NAME IFCS1403(R)
 INCLUDE DN527(IFCEXXX3)
 ALIAS IFCE2671
 ALIAS IFCE1285
 ALIAS IFCE1275
 ALIAS IFCE1419
 NAME IFCE1443(R)
 INCLUDE DN527(IFCSXXX3)
 ALIAS IFCS2671
 ALIAS IFCS1285
 ALIAS IFCS1275
 ALIAS IFCS1419
 NAME IFCS1443(R)
 INCLUDE DN527(IFCEXXX4)
 ALIAS IFCE2321
 ALIAS IFCE2303
 ALIAS IFCE2302
 NAME IFCE2311(R)
 INCLUDE DN527(IFCSXXX4)
 ALIAS IFCS2321
 ALIAS IFCS2303
 ALIAS IFCS2302
 NAME IFCS2311(R)
 INCLUDE DN527(IFCEXXX5)
 NAME IFCE2301(R)
 INCLUDE DN527(IFCSXXX5)
 NAME IFCS2301(R)
 INCLUDE DN527(IFCEXXX6)
 NAME IFCE2314(R)
 INCLUDE DN527(IFCSXXX6)
 NAME IFCS2314(R)
 INCLUDE DN527(IFCEXXX7)
 ALIAS IFCE2245
 ALIAS IFCE3158
 ALIAS IFCE3277
 ALIAS IFCE3284
 ALIAS IFCE3286
 NAME IFCE1015(R)
 INCLUDE DN527(IFCSXXX7)
 ALIAS IFCS2245
 ALIAS IFCS3158
 ALIAS IFCS3277
 ALIAS IFCS3284
 ALIAS IFCS3286
 NAME IFCS1015(R)
 INCLUDE DN527(IFCEXXX8)
 ALIAS IFCE5450
 ALIAS IFCE3066
 ALIAS IFCE1288
 NAME IFCE1287(R)
 INCLUDE DN527(IFCSXXX8)
 ALIAS IFCS5450
 ALIAS IFCS3066
 ALIAS IFCS1288
 NAME IFCS1287(R)
 INCLUDE DN527(IFCEXXX9)
 ALIAS IFCE2282
 ALIAS IFCE2280
 ALIAS IFCE2260
 ALIAS IFCE3505
 ALIAS IFCE3525
 NAME IFCE2250(R)
 INCLUDE DN527(IFCSXXX9)
 ALIAS IFCS2282
 ALIAS IFCS2280
 ALIAS IFCS2260
 ALIAS IFCS3505
 ALIAS IFCS3525
 NAME IFCS2250(R)
 INCLUDE DN527(IFCEXXXA)
 ALIAS IFCE3211
 NAME IFCE2400(R)
 INCLUDE DN527(IFCSXXXA)
 ALIAS IFCS3211
 NAME IFCS2400(R)
 INCLUDE DN527(IFCEXXXB)
 NAME IFCE3420(R)
 INCLUDE DN527(IFCSXXXB)
 NAME IFCS3420(R)
 INCLUDE DN527(IFCEXXXC)
 ALIAS IFCET001
 ALIAS IFCET009
 ALIAS IFCET00A
 NAME IFCE3330(R)
 INCLUDE DN527(IFCEMER0)
 NAME IFCEMER0(R)
 INCLUDE DN527(IFCEMER1)
 NAME IFCEMER1(R)
 INCLUDE DN527(IFCEMER2)
 NAME IFCEMER2(R)
 INCLUDE DN527(IFCEMER3)
 NAME IFCEMER3(R)
 INCLUDE DN527(IFCEMER4)
 NAME IFCEMER4(R)
 INCLUDE DN527(IFCEMER5)
 NAME IFCEMER5(R)
 INCLUDE DN527(IFCSXXXC)
 ALIAS IFCST001
 ALIAS IFCST00A
 NAME IFCS3330(R)
 INCLUDE DN527(IFCET003)
 NAME IFCET003(R)
 INCLUDE DN527(IFCST003)
 NAME IFCST003(R)
 INCLUDE DN527(IFCET004)
 NAME IFCET004(R)
 INCLUDE DN527(IFCET005)
 NAME IFCET005(R)
 INCLUDE DN527(IFCETRN0)
 NAME IFCETRN0(R)
 INCLUDE DN527(IFCETRN1)
 NAME IFCETRN1(R)
 INCLUDE DN527(IFCETRN2)
 NAME IFCETRN2(R)
 INCLUDE DN527(IFCETRN3)
 NAME IFCETRN3(R)
 INCLUDE DN527(IFCETRN4)
 NAME IFCETRN4(R)
 INCLUDE DN527(IFCST005)
 NAME IFCST005(R)
 INCLUDE DN527(IFCET006)
 NAME IFCET006(R)
 INCLUDE DN527(IFCST006)
 NAME IFCST006(R)
 INCLUDE DN527(IFCET00B)
 NAME IFCET00B(R)
 INCLUDE DN527(IFCST00B)
 NAME IFCST00B(R)
 INCLUDE DN527(IFCE0155)
 ALIAS IFCE0158
 NAME IFCE0155(R)
 INCLUDE DN527(IFCEA155)
 ALIAS IFCEA158
 NAME IFCEA155(R)
 INCLUDE DN527(IFCEB155)
 ALIAS IFCEB158
 NAME IFCEB155(R)
 INCLUDE DN527(IFCEC155)
 ALIAS IFCEC158
 NAME IFCEC155(R)
 INCLUDE DN527(IFCED155)
 ALIAS IFCED158
 NAME IFCED155(R)
 INCLUDE DN527(IFCEE155)
 ALIAS IFCEE158
 NAME IFCEE155(R)
 INCLUDE DN527(IFCEF155)
 ALIAS IFCEF158
 NAME IFCEF155(R)
 INCLUDE DN527(IFCEG155)
 ALIAS IFCEG158
 NAME IFCEG155(R)
 INCLUDE DN527(IFCEL155)
 ALIAS IFCEL158
 NAME IFCEL155(R)
 INCLUDE DN527(IFCEM155)
 ALIAS IFCEM158
 NAME IFCEM155(R)
 INCLUDE DN527(IFCS0155)
 ALIAS IFCS0158
 NAME IFCS0155(R)
 INCLUDE DN527(IFCEI155)
 ALIAS IFCEI158
 NAME IFCEI155(R)
 INCLUDE DN527(IFCSI155)
 ALIAS IFCSI158
 NAME IFCSI155(R)
/*
//SG86 EXEC PGM=IEWL,PARM='NCAL,LIST,XREF',
//             COND=(8,LT)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(500,40),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),
//             SYSOUT=A
//SYSLMOD DD DISP=(OLD,PASS),UNIT=3330,
//             VOL=SER=MVTRES,
//             DSNAME=MVT1.DCMLIB
//SYSPUNCH DD DISP=OLD,VOL=(,RETAIN),DSN=SYS1.OBJPDS
//SYSLIN DD *
  INCLUDE SYSPUNCH(DCM0C0)
  NAME DCM0C0(R)
    INCLUDE SYSPUNCH(IEEPFKEY)
   NAME  IEEPFKEY(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK74  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK75 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG87 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REUS,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEHDASDR)
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHDASDR)
 NAME IEHDASDR(R)
 INCLUDE UT506(IEHDASDS,IEHDCONS)
 ENTRY IEHDASDS
 NAME IEHDASDS(R)
 INCLUDE UT506(IEHDPRNT,IEHDDATE)
 ENTRY IEHDPRNT
 NAME IEHDPRNT(R)
 INCLUDE UT506(IEHDMSGB,IEHDMSGS)
 ENTRY IEHDMSGB
 NAME IEHDMSGB(R)
 INCLUDE UT506(IEHDSCAN)
 NAME IEHDSCAN(R)
 INCLUDE UT506(IEHDREST)
 NAME IEHDREST(R)
 INCLUDE UT506(IEHDDUMP,IEHDEXCP,IEHDDOIO)
 ENTRY IEHDDUMP
 NAME IEHDDUMP(R)
 INCLUDE UT506(IEHDAOUT)
 NAME IEHDAOUT(R)
 INCLUDE UT506(IEHDANAL)
 NAME IEHDANAL(R)
 INCLUDE UT506(IEHDVTOC)
 NAME IEHDVTOC(R)
 INCLUDE UT506(IEHDCELL)
 NAME IEHDCELL(R)
 INCLUDE UT506(IEHDLABL)
 NAME IEHDLABL(R)
 INCLUDE UT506(IEHDGETA)
 NAME IEHDGETA(R)
 INCLUDE UT506(IEHDPASS)
 NAME IEHDPASS(R)
 INCLUDE UT506(IEHDRCVR)
 NAME IEHDRCVR(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK75  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK76 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG88 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHIOSUP)
 NAME   IEHIOSUP(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK76  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK77 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG89 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHATLAS,IEHMESS)
 ENTRY  IEHATLAS
 NAME   IEHATLAS(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK77  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK78 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG90 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,OVLY,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEBPTPCH)
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEBPPUN1,IEBPPMSG)
 INCLUDE UT506(IEBPPAL1,IEBCCS02)
 INCLUDE UT506(IEBPPCH1)
 ENTRY PRPCH        ** CANCEL OVERLAY FOR IEBPTPCH   **
 NAME   IEBPTPCH(R) ** WHEN MSG IEW0201 IS GENERATED **
 INCLUDE UT506(IEBGENRT,IEBGMESG)
 INCLUDE UT506(IEBCCS02,IEBGSCAN)
 INCLUDE UT506(IEBGENR3,IEBCONP2,IEBCONH2)
 INCLUDE UT506(IEBCONZ2,IEBEDIT2,IEBLENP2)
 INCLUDE UT506(IEBMOVE2)
 INCLUDE UT506(IEBGENS3)
 INCLUDE UT506(IEBGEN03)
 ENTRY IEBGENER     ** CANCEL OVERLAY FOR IEBGENER   **
 NAME   IEBGENER(R) ** WHEN MSG IEW0201 IS GENERATED **
 INCLUDE UT506(IEBCROOT,IEBCOMPM,IEBCULET)
 INCLUDE UT506(IEBCCS02,IEBCANAL)
 INCLUDE UT506(IEBCMAIN,IEBCQSAM)
 ENTRY COMPARE      ** CANCEL OVERLAY FOR IEBCOMPR   **
 NAME   IEBCOMPR(R) ** WHEN MSG IEW0201 IS GENERATED **
 INCLUDE UT506(IEBUPDTE,IEBUPLOG,IEBUPDT2,IEBUPXIT)
 INCLUDE UT506(IEBUPNIT)
 INCLUDE UT506(IEBASCAN,IEBBSCAN)
 ENTRY IEBUPDTE     ** CANCEL OVERLAY FOR IEBUPDTE   **
 NAME   IEBUPDTE(R) ** WHEN MSG IEW0201 IS GENERATED **
 INCLUDE UT506(IEBDSCPY,IEBVMS)
 INCLUDE UT506(IEBBAM,IEBDV1)
 INCLUDE UT506(IEBSCN)
 INCLUDE UT506(IEBVCT)
 INCLUDE UT506(IEBIOE)
 INCLUDE UT506(IEBDRD,IEBWSU,IEBDWR)
 INCLUDE UT506(IEBVDM)
 INCLUDE UT506(IEBMCM)
 INCLUDE UT506(IEBDRB)
 INCLUDE UT506(IEBVTM)
 INCLUDE UT506(IEBVTT)
 INSERT IEBDSCPY,IEBDSCP2,IEBDSMCA,IEBVMS,IEBVMTXT
 OVERLAY 1
 INSERT IEBBAM,IEBDV1,IEBDV1MG
 OVERLAY 1
 INSERT IEBSCN
 OVERLAY 1
 INSERT IEBVCT
 OVERLAY 1
 INSERT IEBIOE,IEBIOEMG
 OVERLAY 1
 INSERT IEBDRD,IEBDRDR,IEBWSU,IEBWSUMG,IEBDWR,IEBDWRR
 OVERLAY 2
 INSERT IEBVDM
 OVERLAY 2
 INSERT IEBMCM
 OVERLAY 2
 INSERT IEBDRB
 OVERLAY 2
 INSERT IEBVTM
 OVERLAY 2
 INSERT IEBVTT
 ENTRY IEBDSCPY
 NAME    IEBCOPY(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK78  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK79 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG91 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REUS,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHMVESI)
 NAME       IEHMVESI(R)
 INCLUDE UT506(IEHMVESH)
 NAME       IEHMVESH(R)
 INCLUDE UT506(IEHMVESU)
 NAME       IEHMVESU(R)
 INCLUDE UT506(IEHMVESO)
 NAME       IEHMVESO(R)
 INCLUDE UT506(IEHMVESP)
 NAME       IEHMVESP(R)
 INCLUDE UT506(IEHMVESC)
 NAME       IEHMVESC(R)
 INCLUDE UT506(IEHMVESK)
 NAME       IEHMVESK(R)
 INCLUDE UT506(IEHMVESR)
 NAME       IEHMVESR(R)
 INCLUDE UT506(IEHMVESJ)
 NAME       IEHMVESJ(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK79  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK80 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG92 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEHMVXSF)
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHMVXSF,IEHMVSSF)
 ENTRY   IEHMVXSF
 NAME    IEHMVXSF(R)
 INCLUDE UT506(IEHMVSRX,IEHMVSRM,IEHMVSSY)
 INCLUDE UT506(IEHMVMSY)
 ENTRY   IEHMVESY
 NAME    IEHMVESY(R)
 INCLUDE UT506(IEHMVSSX,IEHMVSRY,IEHMVSTC)
 INCLUDE UT506(IEHMVMRY)
 ENTRY   IEHMVESY
 NAME    IEHMVESV(R)
 INCLUDE UT506(IEHMVSRV,IEHMVSRZ,IEHMVSRK)
 INCLUDE UT506(IEHMVMRZ)
 ENTRY   IEHMVESZ
 NAME    IEHMVESX(R)
 INCLUDE UT506(IEHMVSSZ,IEHMVSSV)
 INCLUDE UT506(IEHMVMRZ)
 ENTRY   IEHMVESZ
 NAME    IEHMVESZ(R)
 INCLUDE UT506(IEHMVSRD,IEHMVSRM)
 ENTRY   IEHMVERD
 NAME    IEHMVERD(R)
 INCLUDE UT506(IEHMVSRA,IEHMVSRK)
 ENTRY   IEHMVERA
 NAME    IEHMVERA(R)
 INCLUDE UT506(IEHMVSTA,IEHMVSRK,IEHMVSRM)
 INCLUDE UT506(IEHMVMTA)
 ENTRY   IEHMVETA
 NAME    IEHMVETA(R)
 INCLUDE UT506(IEHMVSTL,IEHMVSRK,IEHMVSRM)
 INCLUDE UT506(IEHMVMTL)
 ENTRY   IEHMVETL
 NAME    IEHMVETL(R)
 INCLUDE UT506(IEHMVSSS)
 ENTRY   IEHMVESS
 NAME    IEHMVESS(R)
 INCLUDE UT506(IEHMVETG)
 ENTRY IEHMVETG
 NAME IEHMVETG(R)
 INCLUDE UT506(IEHMVESM)
 ENTRY IEHMVESM
 NAME IEHMVESM(R)
 INCLUDE UT506(IEHMVESL)
 ENTRY IEHMVESL
 NAME IEHMVESL(R)
 INCLUDE UT506(IEHMVETJ)
 ENTRY IEHMVETJ
 NAME IEHMVETJ(R)
 INCLUDE UT506(IEHMVESQ,IEHMVMSQ)
 ENTRY IEHMVESQ
 NAME IEHMVESQ(R)
 INCLUDE UT506(IEHMVESN,IEHMVMSN)
 ENTRY IEHMVESN
 NAME IEHMVESN(R)
 INCLUDE UT506(IEHMVESA)
 ENTRY IEHMVESA
 NAME IEHMVESA(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK80  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK81 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG93 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHMVXSE)
 ALIAS      IEHMVESE
 NAME       IEHMVXSE(R)
 INCLUDE UT506(IEHMVEST)
 NAME       IEHMVEST(R)
 INCLUDE UT506(IEHMOVE)
 ENTRY IEHMVESD
 NAME       IEHMOVE(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK81  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK82 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG94 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEBISAM)
 NAME IEBISAM(R)
 INCLUDE UT506(IEBISU,IEBISSO)
 ENTRY IEBISU
 NAME IEBISU(R)
 INCLUDE UT506(IEBISL,IEBISSI)
 ENTRY IEBISL
 NAME IEBISL(R)
 INCLUDE UT506(IEBISF,IEBISMES)
 ENTRY IEBISF
 NAME IEBISF(R)
 INCLUDE UT506(IEBISC)
 NAME IEBISC(R)
 INCLUDE UT506(IEBISPL)
 NAME IEBISPL(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK82  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK83 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG95 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEBDG)
 NAME IEBDG(R)
 INCLUDE UT506(IEBDGCUP)
 NAME IEBDGCUP(R)
 INCLUDE UT506(IEBFDANL)
 NAME IEBFDANL(R)
 INCLUDE UT506(IEBFDTBL)
 NAME IEBFDTBL(R)
 INCLUDE UT506(IEBCRANL)
 NAME IEBCRANL(R)
 INCLUDE UT506(IEBCREAT)
 NAME IEBCREAT(R)
 INCLUDE UT506(IEBDGMSG)
 NAME IEBDGMSG(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK83  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK84 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG96 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN539(IGFCCH35)
 ENTRY CCHNIPIN
 NAME IGFCCH35(R)
 INCLUDE DN539(IGFCCH48)
 ENTRY CCHNIPIN
 NAME IGFCCH48(R)
 INCLUDE DN539(IGFCCH60)
 ENTRY CCHNIPIN
 NAME IGFCCH60(R)
 INCLUDE DN539(IGFCCH68)
 ENTRY CCHNIPIN
 NAME IGFCCH68(R)
 INCLUDE DN539(IGFCCH70)
 ENTRY CCHNIPIN
 NAME IGFCCH70(R)
 INCLUDE DN539(IGFCCH80)
 ENTRY CCHNIPIN
 NAME IGFCCH80(R)
 INCLUDE DN539(IGFCCHIN)
 NAME IGFCCHIN(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK84  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK85 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG97 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.SVCLIB
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN539(IGC0008E)
 NAME IGC0008E(R)
 INCLUDE DN539(IGC0108E)
 NAME IGC0108E(R)
 INCLUDE DN539(IGC0208E)
 NAME IGC0208E(R)
 INCLUDE DN539(IGC0308E)
 NAME IGC0308E(R)
 INCLUDE DN539(IGC0408E)
 NAME IGC0408E(R)
 INCLUDE DN539(IGC0508E)
 NAME IGC0508E(R)
 INCLUDE DN539(IGC0608E)
 NAME IGC0608E(R)
 INCLUDE DN539(IGC0708E)
 NAME IGC0708E(R)
 INCLUDE DN539(IGC0808E)
 NAME IGC0808E(R)
 INCLUDE DN539(IGC0908E)
 NAME IGC0908E(R)
 INCLUDE DN539(IGE0660A)
 NAME IGE0660A(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK85  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK86 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG98 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,DC'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN539(IGFMCHF0)
 NAME IGFMCHF0(R)
 INCLUDE DN539(IGFMCHE0)
 INCLUDE DN539(ICFBDX00)
 NAME IGFMCHE0(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK86  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK87 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG99 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,DC'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.SVCLIB
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN539(IGFMCHE1)
 NAME IGCR207B(R)
 INCLUDE DN539(IGFMCHE2)
 NAME IGCR107B(R)
 INCLUDE DN539(IGFMCHF5)
 NAME IGFMCHF5(R)
 INCLUDE DN539(IGFMCHF6)
 NAME IGFMCHF6(R)
 INCLUDE DN539(IGFMCHE3)
 NAME IGFMCHE3(R)
 INCLUDE DN539(IGFMVTF1)
 NAME IGFMCHF1(R)
 INCLUDE DN539(IGFMVTF2)
 NAME IGFMCHF2(R)
 INCLUDE DN539(IGFMVTF3)
 NAME IGFMCHF3(R)
 INCLUDE CI555(IKJEAM00)
 NAME IGFMCH91(R)
 INCLUDE DN539(IGF29601)
 NAME IGF29601(R)
 INCLUDE DN539(IGFMCH20)
 NAME IGFMCH20(R)
 INCLUDE DN539(IGFMCH21)
 NAME IGFMCH21(R)
 INCLUDE DN539(IGFMCH22)
 NAME IGFMCH22(R)
 INCLUDE DN539(IGFMCH23)
 NAME IGFMCH23(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK87  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK88 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG100 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IFDOLT)
//DN533 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN533
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN533(IFDOLT00,IFDOLT18,IFDOLT23,IFDOLT29,IFDOLT30)
 INCLUDE DN533(IFDOLT39,IFDOLT51,IFDOLT52,IFDOLT48,IFDMSG00)
 INCLUDE CI505(IECIOLTS)
 INCLUDE DN533(IFDOLT59)
 ENTRY IFDOLT00
 ALIAS IFDOLT00
 NAME IFDOLT(R)
 INCLUDE DN533(IFDOLT01)
 NAME  IFDOLT01(R)
 INCLUDE DN533(IFDOLT02,IFDMSG02)
 ENTRY IFDOLT02
 NAME IFDOLT02(R)
 INCLUDE DN533(IFDOLT03,IFDMSG03)
 ENTRY IFDOLT03
 NAME  IFDOLT03(R)
 INCLUDE DN533(IFDOLT04,IFDMSG04)
 ENTRY IFDOLT04
 NAME IFDOLT04(R)
 INCLUDE DN533(IFDOLT05,IFDMSG05)
 ENTRY IFDOLT05
 NAME  IFDOLT05(R)
 INCLUDE DN533(IFDOLT06,IFDMSG06)
 ENTRY IFDOLT06
 NAME  IFDOLT06(R)
 INCLUDE DN533(IFDOLT07,IFDMSG07)
 ENTRY IFDOLT07
 NAME  IFDOLT07(R)
 INCLUDE DN533(IFDOLT08,IFDMSG08)
 ENTRY IFDOLT08
 NAME  IFDOLT08(R)
 INCLUDE DN533(IFDOLT09)
 NAME  IFDOLT09(R)
 INCLUDE DN533(IFDOLT10)
 NAME  IFDOLT10(R)
 INCLUDE DN533(IFDOLT11)
 NAME  IFDOLT11(R)
 INCLUDE DN533(IFDOLT13,IFDMSG13)
 ENTRY IFDOLT13
 NAME  IFDOLT13(R)
 INCLUDE DN533(IFDOLT14)
 NAME  IFDOLT14(R)
 INCLUDE DN533(IFDOLT15)
 NAME  IFDOLT15(R)
 INCLUDE DN533(IFDOLT16)
 NAME  IFDOLT16(R)
 INCLUDE DN533(IFDOLT17)
 NAME  IFDOLT17(R)
 INCLUDE DN533(IFDOLT20,IFDMSG20)
 ENTRY IFDOLT20
 NAME  IFDOLT20(R)
 INCLUDE DN533(IFDOLT21)
 NAME  IFDOLT21(R)
 INCLUDE DN533(IFDOLT22,IFDMSG22)
 ENTRY IFDOLT22
 NAME  IFDOLT22(R)
 INCLUDE DN533(IFDOLT24)
 NAME  IFDOLT24(R)
 INCLUDE DN533(IFDOLT25,IFDMSG25)
 ENTRY IFDOLT25
 NAME  IFDOLT25(R)
 INCLUDE DN533(IFDOLT26)
 NAME  IFDOLT26(R)
 INCLUDE DN533(IFDOLT31,IFDMSG31)
 ENTRY IFDOLT31
 NAME  IFDOLT31(R)
 INCLUDE DN533(IFDOLT32,IFDMSG32)
 ENTRY IFDOLT32
 NAME  IFDOLT32(R)
 INCLUDE DN533(IFDOLT33,IFDMSG33)
 ENTRY IFDOLT33
 NAME  IFDOLT33(R)
 INCLUDE DN533(IFDOLT34)
 NAME  IFDOLT34(R)
 INCLUDE DN533(IFDOLT35)
 ENTRY IFDOLT35
 NAME  IFDOLT35(R)
 INCLUDE DN533(IFDOLT36)
 ENTRY IFDOLT36
 NAME  IFDOLT36(R)
 INCLUDE DN533(IFDOLT37,IFDMSG37)
 ENTRY IFDOLT37
 NAME  IFDOLT37(R)
 INCLUDE DN533(IFDOLT38,IFDMSG38)
 ENTRY IFDOLT38
 NAME  IFDOLT38(R)
 INCLUDE DN533(IFDOLT41)
 NAME  IFDOLT41(R)
 INCLUDE DN533(IFDOLT44)
 ENTRY IFDOLT44
 NAME IFDOLT44(R)
 INCLUDE DN533(IFDOLT46)
 NAME  IFDOLT46(R)
 INCLUDE DN533(IFDOLT50,IFDMSG50)
 ENTRY IFDOLT50
 NAME  IFDOLT50(R)
 INCLUDE DN533(IFDOLT53,IFDMSG53)
 ENTRY IFDOLT53
 NAME  IFDOLT53(R)
 INCLUDE DN533(IFDOLT61,IFDMSG61)
 ENTRY IFDOLT61
 NAME IFDOLT61(R)
 INCLUDE DN533(IFDOLT73,IFDMSG73)
 ENTRY IFDOLT73
 NAME IFDOLT73(R)
 INCLUDE DN533(IFDOLT74)
 ENTRY IFDOLT74
 NAME IFDOLT74(R)
 INCLUDE DN533(IFDOLTAJ,IFDMSGAJ)
 ENTRY IFDOLTAJ
 NAME  IFDOLTAJ(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK88  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK89 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG101 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,MAP,OL,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.IMAGELIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 REPLACE UCS1PN,UCS1TN,UCS2P11,UCS2T11   **UCS1AN**
 INCLUDE SYSPUNCH(UCSIMAGE)
 NAME UCS1AN(R)
 REPLACE UCS1AN,UCS1TN,UCS2P11,UCS2T11   **UCS1PN**
 INCLUDE SYSPUNCH(UCSIMAGE)
 NAME UCS1PN(R)
 REPLACE UCS1AN,UCS1PN,UCS2P11,UCS2T11   **UCS1TN**
 INCLUDE SYSPUNCH(UCSIMAGE)
 NAME UCS1TN(R)
 REPLACE UCS1AN,UCS1PN,UCS1TN,UCS2T11   **UCS2P11**
 INCLUDE SYSPUNCH(UCSIMAGE)
 NAME UCS2P11(R)
 REPLACE UCS1AN,UCS1PN,UCS1TN,UCS2P11   **UCS2T11**
 INCLUDE SYSPUNCH(UCSIMAGE)
 NAME UCS2T11(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK89  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK90 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG102 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEWSZOVR)
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE    CI535(IEWSWOVR)
 NAME   IEWSZOVR(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK90  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK91 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG103 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,OVLY,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IHGUAP)
//UT506 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IHGROOT,IHGURD,IHGANY,IHGCTB)
 INCLUDE UT506(IHGUALOG,IHGTAB)
 INSERT IHGROOT
 OVERLAY  IHGSEGA
 INSERT   IHGURD
 OVERLAY  IHGSEGA
 INSERT   IHGANY
 OVERLAY  IHGSUBA
 INSERT   IHGCTB
 OVERLAY  IHGSUBA
 INSERT   IHGUALOG
 OVERLAY  IHGREG2(REGION)
 INSERT   IHGTAB
 ENTRY IHGROOT
 NAME IHGUAP(R)
 INCLUDE UT506(IEHPRINT,IEHPRMSG,IEHQSCAN,IEHMVSSF)
 ENTRY   IEHROOT    * * MSG IEW0201 VALID IF USER DID * *
 NAME    IEHLIST(R) * * NOT SPECIFY OVERLAY OPTION    * *
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK91  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK92 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG104 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,OVLY,XCAL'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEHPROGM)
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHPROG1,IEHPROG2,IEHPROG3,IEHPROG4)
 INCLUDE UT506(IEHPROG5,IEHMVSSF)
 ENTRY   IEHEBASE   * * MSG IEW0201 VALID IF USER DID * *
 NAME    IEHPROGM(R) * * NOT SPECIFY OVERLAY OPTION   * *
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK92  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK93 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG105 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHINITT)
 NAME IEHINITT(R)
 INCLUDE UT506(IEHPRNT)
 NAME IEHPRNT(R)
 INCLUDE UT506(IEHSCAN)
 NAME IEHSCAN(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK93  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK94 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG106 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REUS,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEBEDIT)
 NAME IEBEDIT(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK94  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK95 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG107 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//DN554 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN554
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN554(IMDPRCTL,IMDPRCOM,IMDPRRDC)
 INCLUDE DN554(IMDPRPMG,IMDPRSEG)
 ENTRY IMDPRDMP
 NAME IMDPRDMP(R)
 INCLUDE DN554(IMDPRSCN,IMDPRSN2,IMDPRSN3,IMDPRSMG,IMDPREID)
 ENTRY IMDPRSCN
 NAME IMDPRSCN(R)
 INCLUDE DN554(IMDSYS01,IMDSY101)
 ENTRY IMDSYS01
 NAME IMDSYS01(R)
 INCLUDE DN554(IMDPRFRM,IMDPRFMG,IMDPRGET,IMDPRFLT)
 INCLUDE DN554(IMDPREXT,IMDPRAPP,IMDPRREC)
 ENTRY IMDPRFRM
 NAME IMDPRXED(R)
 INCLUDE DN554(IMCOSMCI,IMCOSAPP)
 ENTRY IMCOSMCI
 NAME IMCOSJQD(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK95  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK96 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG108 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//CI505  DD  DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IHLGTF01,IHLGTF02,IHLGTF03)
 ENTRY IHLGTF01
 NAME IHLGTF(R)
 INCLUDE CI505(IHLGTF11,IHLGTF12,IHLGTF13)
 ENTRY IHLGTF11
 NAME IHLGTF1(R)
 INCLUDE CI505(IHLSCAN1,IHLSCMSG)
 ENTRY IHLSCAN1
 NAME IHLSCAN(R)
 INCLUDE CI505(IHLINT21,IHLINT22)
 ENTRY IHLINT21
 NAME IHLINT2(R)
 INCLUDE CI505(IHLINT31,IHLINT32)
 ENTRY IHLINT31
 NAME IHLINT3(R)
 INCLUDE CI505(IHLINT41,IHLINT43)
 ENTRY IHLINT41
 NAME IHLINT4(R)
 INCLUDE CI505(IHLTERM,IHLRMMSG)
 ENTRY IHLTERM
 NAME IHLTERM(R)
 INCLUDE CI505(IHLROUT,IHLSERV)
 ENTRY IHLROUT
 NAME IHLROUT(R)
 INCLUDE CI505(IHLRMON,IHLRMSTA,IHLRCOV,IHLRMMSG)
 ENTRY IHLRMON
 NAME IHLRMON(R)
 INCLUDE CI505(IHLTAIR1,IHLTAIR2)
 ENTRY IHLTAIR1
 NAME IHLTAIR(R)
 INCLUDE CI505(IHLTCTL1,IHLTCTL2)
 ENTRY IHLTCTL1
 NAME IHLTCTL(R)
 INCLUDE CI505(IHLTMG1,IHLTCIR,IHLTMG2)
 ENTRY IHLTMG1
 NAME IHLTMG1(R)
 INCLUDE CI505(IHLTSV1,IHLTSV2)
 ENTRY IHLTSV1
 NAME IHLTSVC(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK96  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK97 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG109 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,OVLY,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//DN554  DD  DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN554  SERVICE AIDS
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE  DN554(IMBLKCTL,IMBLKOBJ,IMBLKLDM,IMBLKXRF,IMBLKIDR)
 INCLUDE  DN554(IMBLKMSG,IMBLKERR,IMBLKSZE)
 INSERT  IMBLKCTL,IMBLKERR,IMBLKMSG,IMBLKSZE
 OVERLAY  ONE
 INSERT  IMBLKOBJ
 OVERLAY  ONE
 INSERT  IMBLKXRF
 OVERLAY  ONE
 INSERT  IMBLKLDM
 OVERLAY  ONE
 INSERT  IMBLKIDR
 ENTRY  IMBLKCTL
 NAME  IMBLIST(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK97  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK98 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG110 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,OVLY'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//DN554 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN554
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INSERT HMASMDRV
 INSERT HMASMMSG
 INSERT HMASMIO
 INSERT HMASMSCN
 OVERLAY ONE
 INSERT HMASMUPD
 INSERT HMASMCPY
 INSERT HMASMLKD
 INSERT HMASMASM
 INSERT HMASMIC
 OVERLAY ONE
 INSERT HMASMUCL
 OVERLAY ONE
 INSERT HMASMASI
 OVERLAY TWO
 INSERT HMASMREC
 INSERT HMASMEXT
 OVERLAY TWO
 INSERT HMASMCPI
 INSERT HMASMLKI
 OVERLAY THREE
 INSERT HMASMRES
 OVERLAY THREE
 INSERT HMASMAPA
 INSERT HMASMZAP
 OVERLAY ONE
 INSERT HMASMLOG
 OVERLAY ONE
 INSERT HMASMLCD
 OVERLAY ONE
 INSERT HMASMTBL
 INCLUDE DN554(HMASMDRV,HMASMMSG,HMASMIO,HMASMSCN)
 INCLUDE DN554(HMASMUPD,HMASMCPY,HMASMLKD,HMASMASM,HMASMIC)
 INCLUDE DN554(HMASMUCL,HMASMREC,HMASMASI,HMASMRES)
 INCLUDE DN554(HMASMAPA,HMASMZAP,HMASMLOG,HMASMLCD)
 INCLUDE DN554(HMASMCPI,HMASMLKI,HMASMTBL)
 INCLUDE DN554(HMASMEXT)
 ENTRY HMASMDRV
 NAME HMASMP(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK98  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK99 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG111 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//RC536 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.RC536
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE  CI505(IEFLOCDQ)
 INCLUDE  CI505(IEFCNVRT)
 INCLUDE  CI505(IEFRDWRT)
 ALIAS LOC
 ALIAS LOCCAN
 ALIAS LOCDQ
 NAME IEFLOCDQ(R)
 CHANGE IEFSD111(IEFQMDQ2),IEFSD110(IEFQMDQ2)
 INCLUDE  CI505(IEFQMDQQ)
 ENTRY IEFQMDQ2
 ALIAS IEFQMDQ2
 NAME IEFQMDQQ(R)
 INCLUDE  RC536(IHKCDBSH)
 ALIAS IHKCDMSH
 NAME IHKCDBSH(R)
 INCLUDE  RC536(IHKCDBTX)
 ALIAS IHKCDBTW
 NAME IHKCDBTX(R)
 INCLUDE  RC536(IHKCFSTA)
 ALIAS IHKCFSTB
 NAME IHKCFSTA(R)
 INCLUDE  RC536(IHKCFOUT)
 ALIAS IHKCFQOP
 NAME IHKCFOUT(R)
 INCLUDE RC536(IHKCHATS)
 ALIAS IHKCASHA
 NAME IHKCASHT(R)
 INCLUDE RC536(IHKCHSUP)
 NAME IHKCASHU(R)
 INCLUDE RC536(IHKCHJIR)
 ALIAS IHKCASHD
 NAME IHKCASHJ(R)
 INCLUDE RC536(IHKCHIRP)
 ALIAS IHKCARJN
 NAME IHKCHIRP(R)
 INCLUDE RC536(IHKCHOSE)
 ALIAS IHKCAOSR
 NAME IHKCHOSE(R)
 INCLUDE RC536(IHKBBNIT)
 NAME IHKBBNIT(R)
 INCLUDE RC536(IHKQMNGR)
 NAME IHKQMNGR(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK99  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK100 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG112 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.TELCMLIB
//RC536 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.RC536
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE RC536(IHKCHDSP)
 NAME IHKAADSP(R)
 INCLUDE RC536(IHKABORT)
 ALIAS IHKABLWT
 NAME IHKABORT(R)
 INCLUDE RC536(IHKCHPUP)
 ALIAS IHKCHPCK
 ALIAS IHKCHUPK
 NAME IHKCHPUP(R)
 INCLUDE RC536(IHKCHOFS)
 ALIAS IHKCHUM0
 NAME IHKCHOFS(R)
 INCLUDE RC536(IHKCRIME)
 ALIAS IHKBBCCR
 NAME IHKCRIME(R)
 INCLUDE RC536(IHKCRUMB)
 ALIAS IHKCBLDM
 NAME IHKCRUMB(R)
 INCLUDE RC536(IHKABLWR)
 NAME IHKABLWR(R)
 INCLUDE RC536(IHKABLRD)
 NAME IHKABLRD(R)
 INCLUDE RC536(IHKABALC)
 NAME IHKABALC(R)
 INCLUDE RC536(IHKXJBGN)
 NAME IHKRJBGN(R)
 INCLUDE RC536(IHKXHRDR)
 NAME IHKCHRDR(R)
 INCLUDE RC536(IHKXEDIT)
 NAME IHKCEDIT(R)
 INCLUDE RC536(IHKBBRII)
 NAME IHKBBRII(R)
 INCLUDE RC536(IHKXAINT)
 NAME IHKCAINT(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK100  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK101 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG113 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//RC551 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.RC551
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE  CI505(IEFLOCDQ)
 INCLUDE  CI505(IEFCNVRT)
 INCLUDE  CI505(IEFRDWRT)
 ENTRY LOC
 NAME IHKLOC(R)
 INCLUDE RC551(IHKRER)
 ENTRY IHKRER
 ALIAS IHKRER01
 ALIAS IHKRER02
 ALIAS IHKRER03
 NAME IHKRER(R)
 INCLUDE RC551(IHKLGF)
 INCLUDE RC551(IHKEND)
 ENTRY IHKEND
 ALIAS IHKLGF
 NAME IHKEND(R)
 INCLUDE RC551(IHKALC)
 INCLUDE RC551(IHKERR)
 ENTRY IHKALC
 ALIAS IHKERR
 NAME IHKALC(R)
 INCLUDE RC551(IHKIPT)
 INCLUDE RC551(IHKOUT)
 ENTRY IHKIPT
 ALIAS IHKOUT
 NAME IHKIPT(R)
 INCLUDE RC551(IHKTAB)
 INCLUDE RC551(IHKSTP)
 ENTRY IHKTAB
 ALIAS IHKSTP
 NAME IHKTAB(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK101  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21CY102 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG114  EXEC PGM=IEBCOPY,COND=(8,LT)
//SYSUT3  DD DISP=OLD,DSN=SYS1.SYSUT3
//SYSUT4 DD DISP=SHR,DSNAME=SYS1.SYSUT4
//SYSPRINT DD SPACE=(121,(500,100),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3630),                  X
//             SYSOUT=A
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//CI555 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CI555
//DM508 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DM508
//CQ548 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CQ548
//IO523 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.IO523
//RC536 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.RC536
//DN533 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN533
//DN554 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN554
//CQ513 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CQ513
//CQ548 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CQ548
//DM509 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.DM509
//IO526 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.IO526
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SVCLIB DD DSNAME=MVT1.SVCLIB,VOLUME=(,RETAIN,SER=MVTRES),
// UNIT=3330,DISP=OLD
//IMAGELIB DD DISP=OLD,DSN=MVT1.IMAGELIB,VOL=(,RETAIN,SER=MVTRES),
// UNIT=3330
//LINKLIB DD DSNAME=MVT1.LINKLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//PL1LIB DD DSNAME=MVT1.PL1LIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXXXX
//             UNIT=3330,DISP=OLD
//FORTLIB DD DSNAME=MVT1.FORTLIB,VOLUME=(,RETAIN,SER=MVTRES),    XXXXXXXXXX
//             UNIT=3330,DISP=OLD
//COBLIB DD DSNAME=MVT1.COBLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXXXX
//             UNIT=3330,DISP=OLD
//RC551 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.RC551
//TELCMLIB DD DSNAME=MVT1.TELCMLIB,VOLUME=(,RETAIN,SER=MVTRES),    XXXXXXXX
//             UNIT=3330,DISP=OLD
//SYSIN DD *
  COPY  OUTDD=SVCLIB,INDD=DM508
  SELECT MEMBER=(IGC0010E)
 COPY OUTDD=SVCLIB,INDD=IO526
 SELECT MEMBER=(IGG019GG,IGG019HA,IGG019JH)
 COPY OUTDD=SVCLIB,INDD=IO526
 SELECT MEMBER=(IGG0192A,IGG0192B,IGG01921,IGG01920,IGG0202D,IGG0192C)
 SELECT MEMBER=(IGG01922)
 SELECT MEMBER=(IGG0192D,IGG0192E,IGG01925,IGG01927,IGG0192F,IGG0192G)
 SELECT MEMBER=(IGG0192U,IGG0192R,IGG0192S,IGG0192V,IGG0192T)
 SELECT MEMBER=(IGG019GA,IGG019GB,IGG019GC,IGG019GD,IGG019GE,IGG019GF)
 SELECT MEMBER=(IGG019IA,IGG019IB,IGG019IE,IGG019IF)
 SELECT MEMBER=(IGG0202I,IGG0202J,IGG0202K,IGG0202L,IGG0202M,IGG0202N)
 SELECT MEMBER=(IGG019HB,IGG019HD,IGG019HF,IGG019HG)
 SELECT MEMBER=(IGG01924,IGG01928,IGG01929)
 SELECT MEMBER=(IGG02028,IGG02029,IGG019HL,IGG019HN)
 SELECT MEMBER=(IGG019HH,IGG019HI,IGG019HJ,IGG019HK)
 SELECT MEMBER=(IGG0195D,IGG0195G,IGG0196D,IGG0196G)
 SELECT MEMBER=(IGG0196C)
 SELECT MEMBER=(IGG0195T,IGG0195U,IGG019I1,IGG019I2)
 SELECT MEMBER=(IGG0192H,IGG0192P,IGG0192I,IGG0192K,IGG0192L,IGG0192M)
 SELECT MEMBER=(IGG0192Q,IGG0192N,IGG0192O,IGG0192J,IGG0202A,IGG019JU)
 SELECT MEMBER=(IGG0192W,IGG0192X,IGG0192Z,IGG01950)
 SELECT MEMBER=(IGG019J6,IGG019J7,IGG019JX,IGG019J0)
 SELECT MEMBER=(IGG019J3,IGG019JV,IGG019H3,IGG019H7)
 SELECT MEMBER=(IGG019JW,IGG019G0,IGG019G1,IGG019G2,IGG019G3,IGG019G4)
 SELECT MEMBER=(IGG019G5,IGG019G6,IGG019G7,IGG019G8,IGG019G9)
 SELECT MEMBER=(IGG019GO,IGG019GL,IGG019GM,IGG019GN)
 SELECT MEMBER=(IGG019IM,IGG019IN,IGG019IO,IGG019I9)
 SELECT MEMBER=(IGG019GW,IGG019GX,IGG019GY,IGG019GV,IGG019GZ)
 SELECT MEMBER=(IGG019IX,IGG019IY,IGG019IZ,IGG019JC)
 SELECT MEMBER=(IGG019JI,IGG019JJ,IGG019JK,IGG019JL,IGG019JM,IGG019JN)
 SELECT MEMBER=(IGG019JO,IGG019JP,IGG019JQ,IGG019JR)
 SELECT MEMBER=(IGG019JS,IGG019JT,IGG019HP)
 SELECT MEMBER=(IGG032I1,IGG032I2,IGG032I3,IGG032I4,IGG032I5,IGG032I6)
 SELECT MEMBER=(IGG032I7)
  SELECT  MEMBER=(IGG032I8)
 COPY OUTDD=SVCLIB,INDD=CI505
   SELECT MEMBER=(IGG019C5)
   SELECT MEMBER=(IGE0000I,IGE0100I,IGE0200I,IGE0300I)
      SELECT  MEMBER=(IGE0400I)
     SELECT MEMBER=(IGE0800I)
     SELECT MEMBER=(IGE0900I)
        SELECT MEMBER=(IGE0000A)
        SELECT MEMBER=(IGE0000D)
        SELECT MEMBER=(IGE0000G)
        SELECT MEMBER=(IGE0000E)
        SELECT MEMBER=(IGE0001C,IGE0101C)
  SELECT MEMBER=(IGE0000F,IGE0100F)
  SELECT MEMBER=(IGE0200F)
 SELECT MEMBER=(IGX00015)
    SELECT MEMBER=(IGE0025E)
  SELECT MEMBER=(IGE0125E,IGE0225E)
     SELECT MEMBER=(IGE0025C,IGE0025D)
   SELECT MEMBER=(IGE0125C,IGE0225C,IGE0325C)
    SELECT MEMBER=(IGE0425C,IGC0001G)
   SELECT MEMBER=(IGC0003C)
          SELECT MEMBER=(IGC0009A,IGC0109A)
  SELECT MEMBER=(IGE0025F,IGE0125F)
   SELECT MEMBER=(IGE0625F)
 COPY OUTDD=SVCLIB,INDD=CQ513
  SELECT MEMBER=(IGE0010E,IGE0110E,IGE0210E)
 COPY OUTDD=SVCLIB,INDD=CI505
 SELECT MEMBER=((IEAAST00,IGC0006{))
 SELECT MEMBER=((IFBSTAT,IGC0007F))
 SELECT MEMBER=((IFBSTAT1,IGC0107F))
 SELECT MEMBER=((IFBSTAT0,IGC0307F))
 SELECT MEMBER=((IFBSTAT2,IGC0207F))
 SELECT MEMBER=((IEE1403D,IGC1403D))
 COPY OUTDD=SVCLIB,INDD=CI535
 SELECT MEMBER=((IEAQTM00,IGC0001C),(IEAQTM01,IGC0101C))
 SELECT MEMBER=((IEAQTM03,IGC0301C))
 SELECT MEMBER=((IEAQTM04,IGC0401C),(IEAQTM05,IGC0501C))
 SELECT MEMBER=((IEAQTM07,IGC0701C),(IEAQTM08,IGC0801C))
 SELECT MEMBER=((IEAQTM09,IGC0901C),(IEAQTM0B,IGC0B01C))
 SELECT MEMBER=((IEAQTM0C,IGC0C01C),(IEAQTM0D,IGC0D01C))
 SELECT MEMBER=((IEAQTM0F,IGC0F01C),(IEAQTM0G,IGC0G01C))
 SELECT MEMBER=((IEAQTM0L,IGC0L01C),(IEAQTM0M,IGC0M01C))
 SELECT MEMBER=((IEAQTM0N,IGC0N01C),(IEAQTM0P,IGC0P01C))
 SELECT MEMBER=((IEAQTM0R,IGC0R01C),(IEAQTM0S,IGC0S01C))
 SELECT MEMBER=((IEAQTM0T,IGC0T01C),(IEAQTM0U,IGC0U01C))
 SELECT MEMBER=((IEAQTM0V,IGC0V01C),(IEAQTM0W,IGC0W01C))
 SELECT MEMBER=((IEAQAD0Y,IGC0005A),(IEAQAD0Z,IGC0Z05A))
 SELECT MEMBER=((IEAQAD00,IGC0L05A),(IEAQAD01,IGC0105A))
 SELECT MEMBER=((IEAQAD02,IGC0205A),(IEAQAD03,IGC0305A))
 SELECT MEMBER=((IEAQAD04,IGC0405A),(IEAQAD05,IGC0505A))
 SELECT MEMBER=((IEAQAD06,IGC0605A),(IEAQAD07,IGC0705A))
 SELECT MEMBER=((IEAQAD08,IGC0805A),(IEAQAD0A,IGC0A05A))
 SELECT MEMBER=((IEAQAD0J,IGC0J05A),(IEAQAD0M,IGC0M05A))
 SELECT MEMBER=((IEAQAD0N,IGC0N05A))
 SELECT MEMBER=((IEAQAD0C,IGC0C05A))
 SELECT MEMBER=((IEAQAD0Q,IGC0Q05A))
 SELECT MEMBER=((IEAQAD0D,IGC0D05A))
 SELECT MEMBER=((IEAQAD0E,IGC0E05A))
 SELECT MEMBER=((IEAQAD0F,IGC0F05A))
 SELECT MEMBER=((IEAQAD0G,IGC0G05A))
 SELECT MEMBER=((IEAQAD0R,IGC0R05A))
 SELECT MEMBER=((IEAQAD0S,IGC0S05A))
 SELECT MEMBER=((IEAQAD0H,IGC0H05A),(IEAQAD0I,IGC0I05A))
 COPY OUTDD=LINKLIB,INDD=CI505
 SELECT MEMBER=(IEAXPSIM,IEAXPALL,IEAXPDXR)
 SELECT MEMBER=(IFCDIP00)
 COPY OUTDD=SVCLIB,INDD=IO523
 SELECT MEMBER=(IGGIFF01)
 COPY OUTDD=LINKLIB,INDD=CI505
 SELECT MEMBER=(IHLWRTE,IHLWRAP,IHLTDCB)
 SELECT MEMBER=(IHLTAR2,IHLTAR3,IHLTAR4,IHLTAR5)
 SELECT MEMBER=(IHLTAR6,IHLTSCN,IHLTPMT,IHLT103)
 SELECT MEMBER=(IHLTTAB,IHLTUSR,IHLTSIO,IHLTPED)
 SELECT MEMBER=(IHLTFIL)
 SELECT MEMBER=(IHLTSYSV)
 COPY OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=((IGC00020,IGC0002{))
 SELECT MEMBER=(IGC0001I)
 SELECT MEMBER=(IGC0002B)
 SELECT MEMBER=(IGC0002C,IFG0232A)
 SELECT MEMBER=(IGC0003A)
 SELECT MEMBER=(READPSWD)
 SELECT MEMBER=(SECLOADA)
 SELECT MEMBER=(IGG0196M)
 SELECT MEMBER=(IGC0005E)
 SELECT MEMBER=(IGC0006D)
 SELECT MEMBER=(IFG0190P)
 SELECT MEMBER=(IFG0190R,IFG0200R,IFG0550R)
 SELECT MEMBER=(IFG0193A,IFG0193B,IFG0193D)
 SELECT MEMBER=(IFG0193C,OMODVOL1)
 SELECT MEMBER=(IFG0193E,IFG0194A,IFG0194C,IFG0194D)
 SELECT MEMBER=(IFG0194E,IFG0194F,IFG0194G,IFG0194H)
 SELECT MEMBER=(IFG0194I,IFG0194R)
 SELECT MEMBER=(IFG0194J,IGG0190A)
 SELECT MEMBER=(IFG0195A,IFG0195B)
 SELECT MEMBER=(IFG0195C,IFG0195E,IFG0195G)
 SELECT MEMBER=(IFG0195D,IGG0190B)
 SELECT MEMBER=(IFG0195H,IFG0195J,IFG0195K,IFG0195M)
 SELECT MEMBER=(IFG0195N,IFG0195O,IFG0195P,IFG0195T)
 SELECT MEMBER=(IFG0195U,IFG0196J,IFG0196K)
 SELECT MEMBER=(IFG0196L,IFG0196M,IFG0196N)
 SELECT MEMBER=(IFG0195V)
 SELECT MEMBER=(IFG0196O,IGG0190R)
 SELECT MEMBER=(IFG0196Q,IFG0196T,IFG0196U,IFG0196V)
 SELECT MEMBER=(IFG0196W,IGG0190S)
 SELECT MEMBER=(IFG0196X,IFG0198N)
 SELECT MEMBER=(IFG0199B,IFG0209B,IFG0239B,IFG0559B)
 SELECT MEMBER=(IFG0199D,IFG0209D,IFG0239D,IFG0559D)
 SELECT MEMBER=(IFG0199E,IFG0209E,IFG0239E,IFG0559E)
 SELECT MEMBER=(IFG0199R,IFG0209R,IFG0239R,IFG0559R)
 SELECT MEMBER=(IFG019TR,IFG020TR,IFG023TR,IFG055TR)
 SELECT MEMBER=(IFG0200P,IGG0206M)
 SELECT MEMBER=(IFG0200V,IFG0200W,IFG0200Z)
 SELECT MEMBER=(IFG0200Y,IGG0200G)
 SELECT MEMBER=(IFG0201R,IFG0201U)
 SELECT MEMBER=(IFG0202A)
 SELECT MEMBER=(IFG0202B,IGG0200B,IFG0232Y,IFG0556B)
 SELECT MEMBER=(IFG0202C,IFG0202D,IFG0202E,IFG0202F)
 SELECT MEMBER=(IFG0202H,IFG0553B)
 SELECT MEMBER=(IFG0202G,IFG0202I,IFG0202J)
 SELECT MEMBER=(IFG0202K,IFG0202L)
 SELECT MEMBER=(IFG0230P,IFG0232D,IFG0232G,IFG0232J)
 SELECT MEMBER=(IFG0232M,IFG0232S)
 SELECT MEMBER=(IFG0232Z,IFG0202U)
 SELECT MEMBER=(IFG0550P,IFG0551B,IFG0551D,IFG0551F)
 SELECT MEMBER=(IFG0551H,IFG0551J)
 SELECT MEMBER=(IFG0551L,IGG0551A)
 SELECT MEMBER=(IFG0551N,IGG0551B)
 SELECT MEMBER=(IFG0551P,IFG0551R,IFG0551V,IFG0551Z)
 SELECT MEMBER=(IFG0551T,IGG0550F)
 SELECT MEMBER=(IFG0551X,IGG0550P)
 SELECT MEMBER=(IFG0552B,IFG0552D,IFG0552F,IFG0552H)
 SELECT MEMBER=(IFG0552J,EMODVOL1)
 SELECT MEMBER=(IFG0552N,IGG0550H)
 SELECT MEMBER=(IFG0552R,IGG0550B)
 SELECT MEMBER=(IFG0552L,IFG0552P,IFG0552T)
 SELECT MEMBER=(IFG0552V,IFG0552X,IFG0552Y,IFG0552Z)
 SELECT MEMBER=(IFG0553D,IFG0553F,IFG0553P,IFG0553R)
 SELECT MEMBER=(IFG0553H,IGG0550D)
 SELECT MEMBER=(IFG0553T,IFG0553V,IFG0553X,IFG0553Z)
 SELECT MEMBER=(IFG0554B,IFG0554D,IFG0554J,IFG0554N)
 SELECT MEMBER=(IFG0554L,IFG0195F)
 SELECT MEMBER=(IFG0554P,IGG0550K)
 SELECT MEMBER=(IFG0554R,IGG0552K)
 SELECT MEMBER=(IFG0554T,IGG0550S)
 SELECT MEMBER=(IFG0554V,IFG0554X,IFG0554Z,IFG0555B)
 SELECT MEMBER=(IFG0555D,IFG0555F,IFG0555H)
 SELECT MEMBER=(IFG0555J,IFG0196P)
 COPY OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGG019AA,IGG019AB,IGG019AC,IGG019AD)
 SELECT MEMBER=(IGG019AF,IGG019AG,IGG019AI,IGG019AJ)
 SELECT MEMBER=(IGG019AK,IGG019AL,IGG019AM,IGG019AN)
 SELECT MEMBER=(IGG019AQ,IGG019AR,IGG019AT,IGG019AV)
 SELECT MEMBER=(IGG019AW,IGG019AX)
 SELECT MEMBER=(IGG019BA,IGG019BB,IGG019BD,IGG019BE)
 SELECT MEMBER=(IGG019BF,IGG019BG,IGG019BI,IGG019BL)
 SELECT MEMBER=(IGG019BM,IGG019BN,IGG019BO,IGG019BP)
 SELECT MEMBER=(IGG019BQ,IGG019BU,IGG019BV)
 SELECT MEMBER=(IGG019CA,IGG019CB,IGG019CC,IGG019CD)
 SELECT MEMBER=(IGG019CE,IGG019CF,IGG019CH)
 SELECT MEMBER=(IGG019CL,IGG019CM,IGG019CN,IGG019CO)
 SELECT MEMBER=(IGG019CP,IGG019CQ,IGG019CR,IGG019CS)
 SELECT MEMBER=(IGG019CT,IGG019CX,IGG019CY,IGG019CZ)
 SELECT MEMBER=(IGG019C0,IGG019C1,IGG019C2,IGG019C3)
 SELECT MEMBER=(IGG019C4)
 SELECT MEMBER=(IGG019EA,IGG019EB,IGG019EC,IGG019ED)
 SELECT MEMBER=(IGG019EE,IGG019EF)
 SELECT MEMBER=(IGG019EI,IGG019EJ)
 SELECT MEMBER=(IGG019FB,IGG019FD,IGG019FF,IGG019FG)
 SELECT MEMBER=(IGG019FJ,IGG019FL,IGG019FN)
 SELECT MEMBER=(IGG019FP)
 SELECT MEMBER=(IGG019TC,IGG019TD)
 SELECT MEMBER=(IGG019T2)
 SELECT MEMBER=(IGG0191A,IGG0191B,IGG0191C,IGG0191D)
 SELECT MEMBER=(IGG0191E,IGG0191F,IGG0191G,IGG0191H)
 SELECT MEMBER=(IGG0191I,IGG0191J,IGG0191K,IGG0191N)
 SELECT MEMBER=(IGG0191O,IGG0191P,IGG0191Q,IGG0191R)
 SELECT MEMBER=(IGG0191S,IGG0191T,IGG0191U,IGG0191V)
 SELECT MEMBER=(IGG0191W,IGG0191X,IGG0191Y,IGG0191Z)
 SELECT MEMBER=(IGG01910,IGG01911,IGG01912,IGG01913)
 SELECT MEMBER=(IGG01914,IGG01915,IGG01916,IGG01917)
 SELECT MEMBER=(IGG01918,IGG01919,IGG01923)
 SELECT MEMBER=(IGG01926,IGG0193I)
 SELECT MEMBER=(IGG0196A,IGG0196B)
 SELECT MEMBER=(IGG0196J,IGG0196K,IGG0196L)
 SELECT MEMBER=(IGG0196I)
 SELECT MEMBER=(IGG0196P)
 SELECT MEMBER=(IGG0197U)
 SELECT MEMBER=(IGG0199K,IGG0199O)
 SELECT MEMBER=(IGG01990,IGG01991,IGG01992,IGG01993)
 SELECT MEMBER=(IGG01994)
 SELECT MEMBER=(IGG0201A,IGG0201B)
 SELECT MEMBER=(IGG0210A,IGG021AB)
 SELECT MEMBER=(IGG0201X,IGG0201Y,IGG0201Z)
 SELECT MEMBER=(IGC0002E,IGC0002A,IGC0002D)
 SELECT MEMBER=(IGC0005G)
 SELECT MEMBER=(IGC0006I)
 SELECT MEMBER=(IGC0006H,IGC0106H,IGC0206H,IGC0306H)
 SELECT MEMBER=(IGC0406H,IGC0506H,IGC0606H,IGC0706H)
 SELECT MEMBER=(IGC0806H,IGC0906H)
 SELECT MEMBER=(IGC0008A,IGG08101,IGG08102)
 COPY  OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGGAARPS)
 SELECT MEMBER=((IGGR19AE,IGG019AE,R))
 SELECT MEMBER=((IGGR19BC,IGG019BC,R))
 SELECT MEMBER=((IGGR19BH,IGG019BH,R))
 SELECT MEMBER=((IGGR19BK,IGG019BK,R))
 SELECT MEMBER=((IGGR19CW,IGG019CW,R))
 SELECT MEMBER=((IGGR19CG,IGG019CG,R))
 SELECT MEMBER=((IGGR19CI,IGG019CI,R))
 SELECT MEMBER=((IGGR19CJ,IGG019CJ,R))
 SELECT MEMBER=((IGGR19CU,IGG019CU,R))
 SELECT MEMBER=((IGGR19CV,IGG019CV,R))
 SELECT MEMBER=((IGGR19TV,IGG019TV,R))
 SELECT MEMBER=((IGGR19TW,IGG019TW,R))
 COPY OUTDD=LINKLIB,INDD=DM508
 SELECT MEMBER=(IECQBFG1,IECBBFB1)
 SELECT MEMBER=(IGG019B0)
 COPY OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGG0197E,IGG0197F,IGG08103,IGG08104)
 SELECT MEMBER=(IGG019FR,IGG019FS)
 COPY OUTDD=IMAGELIB,INDD=DM508
 SELECT MEMBER=(IGG0197J,FCB2STD1,IGG0197K,FCB2STD2)
 COPY OUTDD=SVCLIB,INDD=DM509
 SELECT MEMBER=(IGG019KC,IGG019KE,IGG019KG)
 SELECT MEMBER=(IGG019KR,IGG0193G,IGG0193F)
 SELECT MEMBER=(IGG019KA,IGG019KJ,IGG019KL)
 SELECT MEMBER=(IGG019KQ,IGG019KU,IGG0193A,IGG0193C)
 SELECT MEMBER=(IGG0203A,IGG019DC,IGG0191L)
 SELECT MEMBER=(IGG019BR,IGG019BS,IGG019BT,IGG0199L)
 SELECT MEMBER=(IGG0191M,IGG019KF,IGG019KH)
 SELECT MEMBER=(IGG019LG)
 SELECT MEMBER=(IGC0005C)
 SELECT MEMBER=(IGG019KW,IGG019KY,IGG019LA,IGG019LC,IGG019LI)
 SELECT MEMBER=(IGG019LE,IGG0193E)
 COPY  OUTDD=SVCLIB,INDD=DM509
 SELECT MEMBER=((IGGR19DA,IGG019DA,R),(IGGR19DB,IGG019DB,R))
 SELECT MEMBER=((IGGR19DD,IGG019DD,R),(IGGR19KN,IGG019KN,R))
 SELECT MEMBER=((IGGR19KI,IGG019KI,R),(IGGR19KK,IGG019KK,R))
 SELECT MEMBER=((IGGR19KM,IGG019KM,R),(IGGR19KO,IGG019KO,R))
 COPY OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGC0002G)
 SELECT MEMBER=(IGC0002I,IGG0290A,IGG0290B,IGG0290C)
 SELECT MEMBER=(IGG0290D,IGG0290E,IGG0290F,IGG0299A)
 SELECT MEMBER=((IGC00030,IGC0003{),IGG03001)
 SELECT MEMBER=(IGG03002,IGG03003)
 SELECT MEMBER=(IGC0003B,IGG0325A,IGG0325B,IGG0325C,IGG0325D)
 SELECT MEMBER=(IGG0325E,IGG0325G,IGG0325H,IGG0325K)
 SELECT MEMBER=(IGG0325F,IGG0325J,IGG0325L)
 SELECT MEMBER=(IGG0325M,IGG0325S)
 SELECT MEMBER=(IGG0325P,IGG0325Q,IGG0325R,IGG0325T)
 SELECT MEMBER=(IGG0325U,IGG0325V,IGG0325W,IGG0325Z)
 SELECT MEMBER=(IGC0007H,IGC0107H)
 SELECT MEMBER=(IGC0009H,IGC0109H,IGC0209H)
 SELECT MEMBER=(IGG019EK)
 SELECT MEMBER=(IGG020P1,IGG020P2,IGG020P3,IGG020D0,IGG020D1)
 SELECT MEMBER=(IGG0553A,IGG0553B,IGG0553C,IGG0553D)
 SELECT MEMBER=(IGG0553E,IGG0553F,IGG0553G)
 SELECT MEMBER=(IGC0002F,IGC0002H)
 SELECT MEMBER=(IGG0CLF2,IGG0CLC1,IGG0CLC2,IGG0CLC3)
 SELECT MEMBER=(IGG0CLC4,IGG0CLC5,IGG0CLC6,IGG0CLC7)
 SELECT MEMBER=(IGG0CLC8)
 COPY OUTDD=SVCLIB,INDD=UT506
 SELECT MEMBER=(IGC0008B,IGC0108B,IGC0208B,IGG019P8,IGG019P9)
 SELECT MEMBER=(IGC0008F,IGG0860A,IGG0860B,IGG0860C,IGG0860D)
 SELECT MEMBER=(IGG086AE,IGC0308B,IGG019C8)
 COPY OUTDD=LINKLIB,INDD=RC536
  SELECT  MEMBER=(IHKABRER,IHKCDRIN,IHKCDMDQ,IHKCDRMV)
  SELECT  MEMBER=(IHKCHNIP,IHKCHUM1,IHKCHUM2,IHKCHUM3)
  SELECT  MEMBER=(IHKCASHB,IHKCASHM)
  SELECT  MEMBER=(IHKCASHL,IHKCHCNT,IHKCBUID,IHKCDBDC)
  SELECT  MEMBER=(IHKCDBPK,IHKCDMEQ,IHKCDBMI,IHKCASTP)
 SELECT MEMBER=(IHKCFWMS,IHKCBCLD,IHKCDMDE)
  SELECT MEMBER=(IHKCDBIS,IHKCDBIN)
  SELECT MEMBER=(IHKCHUM4,IHKCBRJS,IHKCBLGN,IHKCHUM5)
  SELECT MEMBER=(IHKCGDLT,IHKCGDT2,IHKCFBDR,IHKCGALT)
  SELECT MEMBER=(IHKCFMSG,IHKCHNDJ,IHKCHJPR,IHKCHUCK)
 SELECT MEMBER=(IHKCHUM6,IHKCHUM7,IHKCHUM8,IHKCHUM9)
 SELECT MEMBER=(IHKCHUMA,IHKCHUMB,IHKCHUMC,IHKCHUMD)
 SELECT MEMBER=(IHKCHUME,IHKCHUMF,IHKCHUMG,IHKCHUMH)
 SELECT MEMBER=(IHKCHUMI,IHKCHUMJ)
 COPY OUTDD=TELCMLIB,INDD=RC536
  SELECT  MEMBER=(IHKCDINI,IHKCCSGN,IHKCDSCH,IHKCCSCN)
  SELECT  MEMBER=(IHKCCPLM,IHKCDFMR,IHKABLST)
  SELECT  MEMBER=(IHKCCSUD,IHKCBSTD,IHKCCQMG)
  SELECT  MEMBER=(IHKCHSDQ)
  SELECT  MEMBER=(IHKABXMT,IHKCAMSN)
 COPY OUTDD=LINKLIB,INDD=CI505
  SELECT  MEMBER=IEFSD447
 COPY OUTDD=LINKLIB,INDD=RC551
   SELECT MEMBER=(IHKAST,IHKAWS,IHKBSH,IHKBST,IHKCC1,IHKCC2)
   SELECT MEMBER=(IHKCC3,IHKCC4,IHKCC5,IHKCC6,IHKCC7,IHKCC8)
   SELECT MEMBER=(IHKCDP,IHKCGN,IHKCIP)
   SELECT MEMBER=(IHKCLN,IHKDEQ,IHKEDT,IHKED1,IHKEOS,IHKGET)
   SELECT MEMBER=(IHKLAY,IHKLDC,IHKLDS,IHKLGN,IHKMAA,IHKMGE)
   SELECT MEMBER=(IHKMUF,IHKOPN,IHKPUT,IHKRNR,IHKSAV,IHKSND)
   SELECT MEMBER=(IHKSRV,IHKSTS,IHKSUB)
 COPY OUTDD=TELCMLIB,INDD=RC551
   SELECT MEMBER=(IHKAFI,IHKAVT,IHKBGN,IHKBPM,IHKCCI,IHKCCS)
   SELECT MEMBER=(IHKCMD,IHKDEF,IHKDSP,IHKEXC,IHKEXF,IHKGCW)
   SELECT MEMBER=(IHKINI,IHKIRL,IHKIRP,IHKLAB,IHKLAD,IHKLAP)
   SELECT MEMBER=(IHKLAT,IHKLEW,IHKLST,IHKMOD,IHKMSG,IHKNBX)
   SELECT MEMBER=(IHKNUM,IHKRNQ,IHKSCN,IHKSDQ,IHKSMG,IHKSYN)
   SELECT MEMBER=(IHKUTM,IHKWTR)
 COPY OUTDD=SVCLIB,INDD=CQ548
 SELECT MEMBER=(IGC0J05B)
 COPY OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGC0506C,IGC0N06C,IGC0G95B,IGC0G05B)
 SELECT MEMBER=(IGC0H05B,IGC0I05B,IGC0K05B,IGC0L05B,IGC0M05B)
 SELECT MEMBER=(IGC0M95B,IGC0K95B,IGC0L95B)
 SELECT MEMBER=(IGC0N05B,IGC0P05B,IGC0S05B,IGC0W05B,IGC0Q05B)
 SELECT MEMBER=(IGC0N95B)
 SELECT MEMBER=(IGC0R05B,IGC0T05B,IGC0U05B)
 COPY OUTDD=SVCLIB,INDD=CI505
 SELECT MEMBER=((IHJACP00,IGC0006C),(IHJACP01,IGC0106C))
 SELECT MEMBER=((IHJACP02,IGC0206C),(IHJACP20,IGC0A06C))
 SELECT MEMBER=((IHJACP50,IGC0Q06C),(IHJARS00,IGC0105B))
 SELECT MEMBER=((IHJACP25,IGC0D06C),(IHJACP70,IGC0S06C))
 SELECT MEMBER=((IEFVSMBR,IGC0005B))
 SELECT MEMBER=((IHJARS01,IGC0205B),(IHJARS60,IGC0V05B))
 COPY OUTDD=SVCLIB,INDD=CI535
 SELECT MEMBER=((IHJQCP30,IGC0F06C),(IHJQCP31,IGC0G06C))
 SELECT MEMBER=((IHJQCP32,IGC0H06C),(IHJQRS20,IGC0505B))
 SELECT MEMBER=((IHJQRS21,IGC0605B),(IHJQRS22,IGC0705B))
 SELECT MEMBER=((IHJQRS23,IGC0805B),(IHJQRS24,IGC0905B))
 COPY OUTDD=SVCLIB,INDD=DN533
 SELECT MEMBER=(IGC0005I,IGC0205I,IGC0405I,IGC0505I)
 SELECT MEMBER=(IGC0605I,IGC0705I,IGC0905I)
 COPY OUTDD=SVCLIB,INDD=CI505
 SELECT MEMBER=(IGC0105I,IGC0305I)
 COPY OUTDD=LINKLIB,INDD=DN554
 SELECT MEMBER=(IMAPTFLE,IMAPTF01,IMAPTF02)
 SELECT MEMBER=(IMASPZAP)
 SELECT MEMBER=(IMBMDMAP)
 SELECT MEMBER=(IMDPRLPA,IMDPRQCB,IMDPRDPS,IMDPRFSR)
 SELECT MEMBER=(IMDPRFUR,IMDPRFXT,IMDPRPMS,IMDPRNUC)
 SELECT MEMBER=(IMDPRPAL,IMDPRFUB,IMDPRPCR,IMDPRPDR)
 SELECT MEMBER=(IMDPRPJB,IMDDREAD,IMDTREAD,IMDPRLOD)
 SELECT MEMBER=(IMDPROOT,IMDSYS00,IMDSYS02,IMDSYS03)
 SELECT MEMBER=(IMDPRMST,IMDPRTSO,IMDPRSWP)
 SELECT MEMBER=(IMDUSRFF)
 COPY OUTDD=LINKLIB,INDD=CQ513
 SELECT MEMBER=(IDFCT,IDFST,IDFM01)
 COPY OUTDD=TELCMLIB,INDD=CQ513
 SELECT MEMBER=(IECTEDIT)
 COPY OUTDD=SVCLIB,INDD=CQ513
 SELECT MEMBER=(IGE0004A)
 COPY OUTDD=SVCLIB,INDD=CQ513
 SELECT MEMBER=(IGC0006F,IGC0106F,IGC0206F,IGC0306F)
 SELECT MEMBER=(IGC0406F,IGC0506F,IGC0606F)
 SELECT MEMBER=(IGC0706F,IGC0806F,IGC0906F,IGC0A06F)
 SELECT MEMBER=(IGC0B06F,IGC0C06F,IGC0D06F)
 SELECT MEMBER=(IGC0E06F,IGC0F06F,IGC1006F)
 SELECT MEMBER=(IGC1106F,IGC1206F,IGC1306F)
 SELECT MEMBER=(IGC1406F)
 SELECT MEMBER=(IGG019PI)
 SELECT MEMBER=(IGG019MR)
 SELECT MEMBER=(IGE0104A,IGE0204A,IGE0304A)
 SELECT MEMBER=(IGE0404A,IGE0504A,IGE0604A,IGE0704A)
 SELECT MEMBER=(IGE0804A,IGE0904A,IGE0004B,IGE0104B)
 SELECT MEMBER=(IGE0204B,IGE0304B,IGE0404B,IGE0504B)
 SELECT MEMBER=(IGE0604B,IGE0704B,IGE0804B)
 SELECT MEMBER=(IGE0004C,IGE0104C,IGE0204C,IGE0304C)
 SELECT MEMBER=(IGE0404C,IGE0504C,IGE0604C,IGE0704C)
 SELECT MEMBER=(IGE0804C,IGE0904C)
 SELECT MEMBER=(IGE0504D,IGE0904D)
 SELECT MEMBER=(IGG019MA,IGG019MB,IGG019MC,IGG019MS)
 SELECT MEMBER=(IGG019PK)
 SELECT MEMBER=(IGG019PA)
 SELECT MEMBER=(IGG019MD,IGG019MF,IGG019MI,IGG019MJ)
 SELECT MEMBER=(IGG019ML,IGG019MN,IGG019MP)
 SELECT MEMBER=(IGG019MT,IGG019MU,IGG019MV,IGG019MW)
 SELECT MEMBER=(IGG019MX,IGG019MY,IGG019MZ,IGG019M0)
 SELECT MEMBER=(IGG019M3)
 SELECT MEMBER=(IGG019ME,IGG019MK,IGG019M1,IGG019M2)
 SELECT MEMBER=(IGG019M4)
 SELECT MEMBER=(IGG019M5,IGG019M6)
 SELECT MEMBER=(IGG019PB,IGG019PC,IGG019PD)
 SELECT MEMBER=(IGG019PE,IGG019PF)
 SELECT MEMBER=(IGG019PL,IGG019PM)
 SELECT MEMBER=(IGG019PN,IGG019PO)
 SELECT MEMBER=(IGG019PP,IGG019PQ)
 SELECT MEMBER=(IGG019PG,IGG019PH)
 SELECT MEMBER=(IGG019UP)
 SELECT MEMBER=(IGG0201E)
 SELECT MEMBER=(IGG0193M,IGG0193Q,IGG0193S,IGG0203M)
 SELECT MEMBER=(IGG0194N,IGG0195N)
 SELECT MEMBER=(IGG0194P,IGG0194Q)
 COPY OUTDD=SVCLIB,INDD=CQ548
 SELECT MEMBER=(IGE0004G,IGE0104G,IGE0204G,IGE0304G)
 SELECT MEMBER=(IGE0404G,IGE0504G,IGE0604G,IGE0804G)
 SELECT MEMBER=(IGE0904G,IGE0004H,IGE0104H,IGE0204H)
 SELECT MEMBER=(IGE0404H,IGE0504H,IGE0804H)
 SELECT MEMBER=(IGE0904H)
 SELECT MEMBER=(IGE0004I,IGE0104I,IGE0904I)
 SELECT MEMBER=(IGG019RH,IGG019RI,IGG019RJ,IGG019RL)
 SELECT MEMBER=(IGG019RM,IGG019RG)
 SELECT MEMBER=(IGG019Q2,IGG019Q3,IGG019Q4,IGG019Q8)
 SELECT MEMBER=(IGG019Q5,IGG019Q6,IGG019Q7)
 SELECT MEMBER=(IGG019Q9)
 SELECT MEMBER=(IGG019Q0,IGG019Q1,IGG019RA,IGG019RB)
 SELECT MEMBER=(IGG019RC,IGG019RD,IGG019RN,IGG019RO)
 SELECT MEMBER=(IGG019RR,IGG019RS,IGG019RT,IGG019RU)
 SELECT MEMBER=(IGG019RV,IGG019RW,IGG019RX,IGG019RY)
 SELECT MEMBER=(IGG019RF,IGG019RK)
 SELECT MEMBER=(IGG019RE,IGG019EM)
 SELECT MEMBER=(IGG019RP,IGG019RQ,IGG019R0,IGG019R1)
 SELECT MEMBER=(IGG019R2,IGG019R3,IGG019R4,IGG019R5)
 SELECT MEMBER=(IGG019R6,IGG019R7,IGG019R8,IGG019R9)
 SELECT MEMBER=(IGG019TE,IGG019TF,IGG019TG)
 SELECT MEMBER=(IGG019TH,IGG019TI,IGG019TJ)
 SELECT MEMBER=(IGG019TM,IGG019TN)
 SELECT MEMBER=(IGC0010D,IGC0110D,IGC0310D)
 SELECT MEMBER=(IGC0210D)
 SELECT MEMBER=(IGC0410D,IGC0510D,IGC0610D)
 SELECT MEMBER=(IGC0710D,IGC0810D,IGC0910D)
 SELECT MEMBER=(IGC0B10D,IGC0C10D)
 SELECT MEMBER=(IGC0D10D,IGC0E10D)
 SELECT MEMBER=(IGC0G10D)
 SELECT MEMBER=(IGC1210D)
 SELECT MEMBER=(IGCC010D,IGCC110D)
 SELECT MEMBER=(IGCI010D,IGCI110D,IGCH010D)
 SELECT MEMBER=(IGCI210D,IGCI310D)
 SELECT MEMBER=(IGCR010D,IGCZ010D,IGCZ110D)
 SELECT MEMBER=(IGCV010D,IGCV110D,IGCV210D)
 SELECT MEMBER=(IGCV310D,IGCV410D,IGCM010D)
 SELECT MEMBER=(IGCM110D,IGCM210D,IGCM410D)
 SELECT MEMBER=(IGCM310D)
 SELECT MEMBER=(IGCM510D,IGCM610D,IGCM710D)
 SELECT MEMBER=(IGCM810D,IGCM910D,IGCMA10D)
 SELECT MEMBER=(IGCMB10D)
 SELECT MEMBER=(IGCMD10D,IGCME10D,IGCMF10D)
 SELECT MEMBER=(IGCMG10D,IGCMH10D,IGCMI10D)
 SELECT MEMBER=(IGCMJ10D)
 SELECT MEMBER=(IGCMK10D,IGCML10D,IGCMM10D)
 SELECT MEMBER=(IGCMN10D)
 SELECT MEMBER=(IGCMO10D)
 SELECT MEMBER=(IGCMP10D)
 SELECT MEMBER=(IGCMR10D,IGCMS10D,IGCMT10D)
 SELECT MEMBER=(IGCMX10D,IGCMY10D)
 SELECT MEMBER=(IGCD010D,IGCD110D,IGCD210D)
 SELECT MEMBER=(IGCD310D,IGCD410D,IGCD510D)
 SELECT MEMBER=(IGCD610D,IGCD710D,IGCD810D)
 SELECT MEMBER=(IGCD910D,IGCV510D,IGCV610D)
 SELECT MEMBER=(IGCDB10D,IGCDC10D,IGCDD10D)
 SELECT MEMBER=(IGCSW10D)
 SELECT MEMBER=(IGCT010D,IGCT110D,IGCT210D)
 SELECT MEMBER=(IGCT310D,IGCT410D)
 SELECT MEMBER=(IEDQOT01)
 SELECT MEMBER=(IGCVA10D,IGCVB10D)
 SELECT MEMBER=(IGCVE10D,IGCVF10D,IGCVG10D)
 SELECT MEMBER=(IGCVH10D)
 SELECT MEMBER=(IGCV710D)
 SELECT MEMBER=(IGCV810D,IGCV910D)
 SELECT MEMBER=(IGG019AO,IGG019AP)
 SELECT MEMBER=(IGG01930,IGG01931,IGG01933,IGG01934)
 SELECT MEMBER=(IGG01935,IGG01936,IGG01937,IGG01938)
 SELECT MEMBER=(IGG01939,IGG01940,IGG01941,IGG01942)
 SELECT MEMBER=(IGG01943,IGG01944,IGG01945,IGG01946)
 SELECT MEMBER=(IGG01947,IGG01948,IGG01949)
 SELECT MEMBER=(IGG0194B,IGG0194D)
 SELECT MEMBER=(IGG0198B)
 SELECT MEMBER=(IGG0198D,IGG0198E)
 SELECT MEMBER=(IGG02030,IGG02035,IGG02036)
 SELECT MEMBER=(IGG0203B)
 SELECT MEMBER=(IGG02041)
 SELECT MEMBER=(IGG02046,IGG02047)
 COPY OUTDD=TELCMLIB,INDD=CQ513
 SELECT MEMBER=(IECTLERP,IECTLOPN,IECTONLT,IECTTRNS)
 SELECT MEMBER=(IECTCHGN)
 SELECT MEMBER=(IECTSCAN)
 COPY OUTDD=TELCMLIB,INDD=CQ548
 SELECT MEMBER=(IEDNID)
 SELECT MEMBER=(IEDN25)
 SELECT MEMBER=(IEDQAA,IEDQAC,IEDQAD,IEDQAE)
 SELECT MEMBER=(IEDQAF,IEDQAG,IEDQAH,IEDQAI,IEDQAJ)
 SELECT MEMBER=(IEDQAK,IEDQAB,IEDQA9)
 SELECT MEMBER=(IEDQAL,IEDQAM,IEDQAN,IEDQAO,IEDQAP)
 SELECT MEMBER=(IEDQAQ,IEDQAR,IEDQAS,IEDQAT,IEDQAU)
 SELECT MEMBER=(IEDQAV,IEDQAW,IEDQAX,IEDQAY,IEDQAZ)
 SELECT MEMBER=(IEDQA0,IEDQA1,IEDQA2,IEDQA8,IEDQA4)
 SELECT MEMBER=(IEDQA3)
 SELECT MEMBER=(IEDQA5,IEDQA6,IEDQA7,IEDQBA,IEDQBB)
 SELECT MEMBER=(IEDQBC,IEDQBD,IEDQBE,IEDQBF,IEDQBG)
 SELECT MEMBER=(IEDQBI,IEDQBJ)
 SELECT MEMBER=(IEDQBH,IEDQBL,IEDQBM,IEDQBN)
 SELECT MEMBER=(IEDQBO,IEDQBP,IEDQBQ,IEDQBR)
 SELECT MEMBER=(IEDQBT,IEDQBU,IEDQBX,IEDQBY)
 SELECT MEMBER=(IEDQBV,IEDQB4)
 SELECT MEMBER=(IEDQBZ)
 SELECT MEMBER=(IEDQB1,IEDQB2,IEDQB3)
 SELECT MEMBER=(IEDQB7)
 SELECT MEMBER=(IEDQES,IEDQEU,IEDQE8)
 SELECT MEMBER=(IEDQFA,IEDQFA1,IEDQFA2,IEDQFE)
 SELECT MEMBER=(IEDQGA,IEDQGH)
 SELECT MEMBER=(IEDQGP,IEDQGR)
 SELECT MEMBER=(IEDQGT,IEDQHG,IEDQHK,IEDQHM)
 SELECT MEMBER=(IEDQHM1,IEDQHM2,IEDQKB,IEDQKC,IEDQKD)
 SELECT MEMBER=(IEDQKA,IEDQKE,IEDQNA,IEDQUI)
 SELECT MEMBER=(IEDQ10,IEDQ11,IEDQ12,IEDQ13,IEDQ14)
 SELECT MEMBER=(IEDQ15,IEDQ16,IEDQ17,IEDQ18,IEDQ19)
 SELECT MEMBER=(IEDQ20,IEDQ21,IEDQ22,IEDQ23,IEDQ24)
 SELECT MEMBER=(IEDQ25,IEDQ26,IEDQ27,IEDQ28)
 COPY OUTDD=LINKLIB,INDD=CQ548
 SELECT MEMBER=(IEDNAR)
 SELECT MEMBER=(IEDNLT)
 SELECT MEMBER=(IEDNMG)
 SELECT MEMBER=(IEDNRE)
 SELECT MEMBER=(IEDNTR)
 SELECT MEMBER=(IEDQCA)
 SELECT MEMBER=(IEDQEC,IEDQET,IEDQEW)
 SELECT MEMBER=(IEDQEZ,IEDQE6,IEDQE7)
 SELECT MEMBER=(IEDQFE10,IEDQFE20,IEDQFE30)
 SELECT MEMBER=(IEDQFW,IEDQNA2)
 SELECT MEMBER=(IEDQGQ)
 SELECT MEMBER=(IEDQHI)
 SELECT MEMBER=(IEDQNB,IEDQNB02,IEDQNB05)
 SELECT MEMBER=(IEDQND,IEDQNF,IEDQNG,IEDQNH,IEDQNJ)
 SELECT MEMBER=(IEDQNK,IEDQNM,IEDQNO,IEDQNP,IEDQNQ)
 SELECT MEMBER=(IEDQNR,IEDQNS,IEDQNX,IEDQOA,IEDQOB)
 SELECT MEMBER=(IEDQWA,IEDQWAB,IEDQWAJ,IEDQWB)
 SELECT MEMBER=(IEDQWB1,IEDQWC,IEDQWC1,IEDQWC2)
 SELECT MEMBER=(IEDQWD)
 SELECT MEMBER=(IEDQWE,IEDQWE1)
 SELECT MEMBER=(IEDQWF,IEDQWH)
 SELECT MEMBER=(IEDQWI,IEDQWI1)
 SELECT MEMBER=(IEDQWIA)
 SELECT MEMBER=(IEDQWID,IEDQWIE,IEDQWI5U)
 SELECT MEMBER=(IEDQWI7,IEDQWI8,IEDQWI9,IEDQWJ)
 SELECT MEMBER=(IEDQWJ1,IEDQWJ2,IEDQWK,IEDQWL)
 SELECT MEMBER=(IEDQWK1)
 SELECT MEMBER=(IEDQWL1,IEDQWL2,IEDQWL3)
 SELECT MEMBER=(IEDQWM2)
 SELECT MEMBER=((IEDQWN,IEDQW35,R))
 SELECT MEMBER=(IEDQWO,IEDQWP1,IEDQWP2)
 SELECT MEMBER=((IEDQWP,IEDQW39,R))
 SELECT MEMBER=((IEDQWQ,IEDQW37,R))
 SELECT MEMBER=((IEDQWR,IEDQW28,R))
 SELECT MEMBER=((IEDQWS,IEDQW36,R))
 SELECT MEMBER=(IEDQWV,IEDQW21,IEDQWAC)
 SELECT MEMBER=((IEDQWX,IEDQW41,R))
 SELECT MEMBER=((IEDQWY,IEDQW16,R))
 SELECT MEMBER=(IEDQW42,IEDQW43)
 SELECT MEMBER=(IEDQW44,IEDQW47)
 SELECT MEMBER=(IEDQWAA,IEDQWB2)
 SELECT MEMBER=(IEDQWE2,IEDQWEC)
 SELECT MEMBER=(IEDQXA,IEDQXB,IEDQXC)
 SELECT MEMBER=(IEDQE1,IEDQE2,IEDQE3,IEDQE4)
 COPY OUTDD=TELCMLIB,INDD=CQ548
 SELECT MEMBER=(IEDAYA,IEDAYC,IEDAYD,IEDAYE)
 SELECT MEMBER=(IEDAYB)
 SELECT MEMBER=(IEDAYH,IEDAYI,IEDAYL,IEDAYM)
 SELECT MEMBER=(IEDAYO,IEDAYR,IEDAYS,IEDAYT)
 SELECT MEMBER=(IEDAYX,IEDAYY,IEDAYZ,IEDAYF)
 SELECT MEMBER=(IEDAYAB)
 COPY OUTDD=LINKLIB,INDD=UT506
 SELECT MEMBER=(IHGUADEL)
 COPY OUTDD=SVCLIB,INDD=UT506
 SELECT MEMBER=(IGC0003I)
 COPY OUTDD=SVCLIB,INDD=IO523
 SELECT MEMBER=(IGG0193Y,IGG0193Z,IGG0203Y)
 SELECT MEMBER=(IGG0193L,IGG0203X)
 SELECT MEMBER=(IGG019OA,IGG019OB)
 COPY OUTDD=LINKLIB,INDD=IO523
 SELECT MEMBER=(IFFPAAST,GSTOR)
 SELECT MEMBER=(IFFPBAPR,GCPRNT)
 SELECT MEMBER=(IFFPCAAR,GARC)
 SELECT MEMBER=(IFFPDAPL,GSPLOT)
 SELECT MEMBER=(IFFPEAGR,GCGRID)
 SELECT MEMBER=(IFFPFAVA,GVARC)
 SELECT MEMBER=(IFFPGAVP,GSVPLT)
 SELECT MEMBER=(IFFPHALA,GLABEL)
 SELECT MEMBER=(IFFPIAPG,GPGRID)
 SELECT MEMBER=(IFFPJAPV,GPVGRD)
 SELECT MEMBER=(IFFPPASG,GOFFSG)
 SELECT MEMBER=(IFFPLARE,PENTRK)
 SELECT MEMBER=(IFFPKADG,GSDPLT)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21CY102  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21LK103 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG115 EXEC PGM=IEWL,COND=(8,LT),REGION=300K,                         XXXXXXXX
//             PARM='OVLY,LET,LIST,XREF,SIZE=(250K,50K)'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(500,1000),RLSE),                             X
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A
//SYSLMOD DD DISP=(OLD,PASS),UNIT=3330,                             XXXXXXXX
//             VOLUME=SER=MVTRES,DSNAME=MVT1.LINKLIB(IEKAA00)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//FO500 DD DISP=SHR,DSNAME=SYS1.FO500,VOLUME=(,RETAIN)
//SYSABEND DD SYSOUT=A
//SYSLIN DD *
 INCLUDE   SYSPUNCH(IEK201)
          INCLUDE FO500(IEKAA00)
          INCLUDE FO500(IEKATB)
          INCLUDE FO500(IEKAPT)
          INCLUDE FO500(IEKTLOAD)
          INCLUDE FO500(IEKFCOMH)
          INCLUDE FO500(IEKFIOCS)
          INCLUDE FO500(IEKATM)
          INCLUDE FO500(IEKAFP)
          INCLUDE FO500(IEKTDC)
          INCLUDE FO500(IEKAINIT)
          INCLUDE FO500(IEKCGC)
          INCLUDE FO500(IEKCAA)
          INCLUDE FO500(IEKCCR)
          INCLUDE FO500(IEKXRS)
          INCLUDE FO500(IEKCSR)
          INCLUDE FO500(IEKCGW)
          INCLUDE FO500(IEKCGO)
          INCLUDE FO500(IEKCPX)
          INCLUDE FO500(IEKCLT)
          INCLUDE FO500(IEKCDT)
          INCLUDE FO500(IEKCAR)
          INCLUDE FO500(IEKCDO)
          INCLUDE FO500(IEKDIO)
          INCLUDE FO500(IEKCDP)
          INCLUDE FO500(IEKCTN)
          INCLUDE FO500(IEKCSP)
          INCLUDE FO500(IEKKOS)
          INCLUDE FO500(IEKGST)
          INCLUDE FO500(IEKCIO)
          INCLUDE FO500(IEKDCL)
          INCLUDE FO500(IEKTFM)
          INCLUDE FO500(IEKXRF)
          INCLUDE FO500(IEKJA1)
          INCLUDE FO500(IEKJA3)
          INCLUDE FO500(IEKJAL)
          INCLUDE FO500(IEKJBF)
          INCLUDE FO500(IEKJCP)
          INCLUDE FO500(IEKLMA)
          INCLUDE FO500(IEKKRE)
          INCLUDE FO500(IEKJDF)
          INCLUDE FO500(IEKLTB)
          INCLUDE FO500(IEKLOK)
          INCLUDE FO500(IEKKUN)
          INCLUDE FO500(IEKKST)
          INCLUDE FO500(IEKLRG)
          INCLUDE FO500(IEKLGN)
          INCLUDE FO500(IEKKOP)
          INCLUDE FO500(IEKKSM)
          INCLUDE FO500(IEKJFI)
          INCLUDE FO500(IEKJGR)
          INCLUDE FO500(IEKKSA)
          INCLUDE FO500(IEKJAN)
          INCLUDE FO500(IEKLER)
          INCLUDE FO500(IEKJA)
          INCLUDE FO500(IEKKCN)
          INCLUDE FO500(IEKKPA)
          INCLUDE FO500(IEKJFU)
          INCLUDE FO500(IEKLAB)
          INCLUDE FO500(IEKGEV)
          INCLUDE FO500(IEKGCZ)
          INCLUDE FO500(IEKTDT)
          INCLUDE FO500(IEKGDA)
          INCLUDE FO500(IEKTNL)
          INCLUDE FO500(IEKTDF)
          INCLUDE FO500(IEKGCR)
          INCLUDE FO500(IEKPLS)
          INCLUDE FO500(IEKPGK)
          INCLUDE FO500(IEKPT)
          INCLUDE FO500(IEKARW)
          INCLUDE FO500(IEKPZ)
          INCLUDE FO500(IEKQAA)
          INCLUDE FO500(IEKPB)
          INCLUDE FO500(IEKPO)
          INCLUDE FO500(IEKQXM)
          INCLUDE FO500(IEKQKO)
          INCLUDE FO500(IEKQXS)
          INCLUDE FO500(IEKQCF)
          INCLUDE FO500(IEKQCL)
          INCLUDE FO500(IEKQBM)
          INCLUDE FO500(IEKQSR)
          INCLUDE FO500(IEKQMT)
          INCLUDE FO500(IEKQWT)
          INCLUDE FO500(IEKQPF)
          INCLUDE FO500(IEKQSM)
          INCLUDE FO500(IEKQTL)
          INCLUDE FO500(IEKRFR)
          INCLUDE FO500(IEKRL1)
          INCLUDE FO500(IEKRFP)
          INCLUDE FO500(IEKRGB)
          INCLUDE FO500(IEKRBP)
          INCLUDE FO500(IEKRCI)
          INCLUDE FO500(IEKRS)
          INCLUDE FO500(IEKSBS)
          INCLUDE FO500(IEKRRG)
          INCLUDE FO500(IEKRSX)
          INCLUDE FO500(IEKRFL)
          INCLUDE FO500(IEKRBK)
          INCLUDE FO500(IEKRF1)
          INCLUDE FO500(IEKRSS)
          INCLUDE FO500(IEKRLL)
          INCLUDE FO500(IEKRSL)
          INCLUDE FO500(IEKP30)
          INCLUDE FO500(IEKP31)
          INCLUDE FO500(IEKUEN)
          INCLUDE FO500(IEKTEN)
          INCLUDE FO500(IEKTPR)
          INCLUDE FO500(IEKTA)
          INCLUDE FO500(IEKWCN)
          INCLUDE FO500(IEKVSU)
          INCLUDE FO500(IEKVUN)
          INCLUDE FO500(IEKVTS)
          INCLUDE FO500(IEKTIS)
          INCLUDE FO500(IEKGMP)
          INCLUDE FO500(IEKVAD)
          INCLUDE FO500(IEKVBL)
          INCLUDE FO500(IEKVFN)
          INCLUDE FO500(IEKVM2)
          INCLUDE FO500(IEKVTN)
          INCLUDE FO500(IEKTIO)
          INCLUDE FO500(IEKTEP)
          INCLUDE FO500(IEKTSR)
          INCLUDE FO500(IEKTPK)
          INCLUDE FO500(IEKWKK)
          INCLUDE FO500(IEKTLS)
          INCLUDE FO500(IEKTLB)
          INCLUDE FO500(IEKTRN)
          INCLUDE FO500(IEKVPL)
          INCLUDE FO500(IEKVFP)
 OVERLAY PHASE
  INSERT IEKCAA
  INSERT IEKAINIT
  INSERT IEKDIO#
  INSERT IEKCSP#
  INSERT IEKCTN#
  INSERT IEKCCR
  INSERT IEKCDP#
  INSERT IEKCGC
  INSERT IEKCGW
  INSERT IEKCLT#
  INSERT IEKCPX#
  INSERT IEKCAR#
  INSERT IEKDCL#
  INSERT IEKCDT#
  INSERT IEKCDO#
  INSERT IEKCGO#
  INSERT IEKCIO#
  INSERT IEKCSR#
  INSERT IEKGST#
  INSERT IEKKOS#
  INSERT IEKTFM
  INSERT IEKXRS
 OVERLAY PHASE
  INSERT IEKXRF
 OVERLAY PHASE
  INSERT IEKJA2
  INSERT IEKJA4
 OVERLAY COMMON
  INSERT IEKJA1
  INSERT IEKJAL#
  INSERT IEKJFU#
  INSERT IEKJFI#
  INSERT IEKLER#
  INSERT IEKLOK
  INSERT IEKJAN#
  INSERT IEKKSM#
  INSERT IEKLMA#
  INSERT IEKKSA#
  INSERT IEKLTB
  INSERT IEKKUN#
  INSERT IEKKRE#
  INSERT IEKKPA#
  INSERT IEKKOP#
  INSERT IEKKST#
  INSERT IEKJCP#
  INSERT IEKJGR#
  INSERT IEKKCN#
  INSERT IEKLGN#
  INSERT IEKLAB#
  INSERT IEKJA#
  INSERT IEKLRG#
  INSERT IEKJDF#
  INSERT IEKJBF#
  INSERT IEKJA3
 OVERLAY COMMON
  INSERT IEKGA1
  INSERT IEKGCR#
  INSERT IEKTDT#
  INSERT IEKTNL#
  INSERT IEKGEV#
  INSERT IEKGDA#
  INSERT IEKGCZ#
  INSERT IEKTDF#
 OVERLAY COMMON
  INSERT IEKPOP
  INSERT IEKPLS#
  INSERT IEKPGK#
  INSERT IEKARW
  INSERT IEKPT#
 OVERLAY LOOPS
  INSERT IEKPBL
  INSERT IEKPB#
  INSERT IEKPZ#
  INSERT IEKPO#
  INSERT IEKQAA#
 OVERLAY LOOPS
  INSERT IEKQBM#
  INSERT IEKQCF#
  INSERT IEKQCL#
  INSERT IEKQMT#
  INSERT IEKQSR#
  INSERT IEKQSM#
  INSERT IEKQKO
  INSERT IEKQXS#
  INSERT IEKQTL#
  INSERT IEKQWT#
  INSERT IEKQPF#
  INSERT IEKQXM#
 OVERLAY LOOPS
  INSERT IEKSBS#
  INSERT IEKRSX#
  INSERT IEKRBK#
  INSERT IEKRBP#
  INSERT IEKRCI#
  INSERT IEKRFL#
  INSERT IEKRFP#
  INSERT IEKRF1#
  INSERT IEKRFR#
  INSERT IEKRGB#
  INSERT IEKRL1
  INSERT IEKRRG#
  INSERT IEKRS#
 OVERLAY LOOPS
  INSERT IEKRLL#
  INSERT IEKRSL#
  INSERT IEKRSS#
 OVERLAY COMMON
  INSERT IEKP30
  INSERT IEKP31
 OVERLAY PHASE
  INSERT IEKVTS#
  INSERT IEKVFN#
  INSERT IEKTRN#
  INSERT IEKTIO#
  INSERT IEKTIS#
  INSERT IEKVPL#
  INSERT IEKVSU#
  INSERT IEKP25
  INSERT IEKWCN
  INSERT IEKVTN#
  INSERT IEKTPK#
  INSERT IEKTLS
  INSERT IEKVBL#
  INSERT IEKTSR
  INSERT IEKTEN#
  INSERT IEKUEN#
  INSERT IEKVFP#
  INSERT IEKTA#
  INSERT IEKTLB#
  INSERT IEKVUN#
  INSERT IEKGMP
  INSERT IEKTPR#
  INSERT IEKVAD#
  INSERT IEKWKK
  INSERT IEKVM2
  INSERT IEKTEP#
 ENTRY IEKAA00
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK103  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK104 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG116 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEYFORT)
//FO520 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.FO520
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
         INCLUDE    SYSPUNCH(IEY201)
         INCLUDE      FO520(IEYFORT,IEYFORT2,IEYROL,IEYINT)
         ENTRY         IEYFORT
         NAME         IEYFORT(R)
         INCLUDE      FO520(IEYPAR)
         NAME         IEYPAR(R)
         INCLUDE      FO520(IEYALL)
         NAME         IEYALL(R)
         INCLUDE      FO520(IEYUNF)
         NAME         IEYUNF(R)
         INCLUDE      FO520(IEYGEN)
         NAME         IEYGEN(R)
         INCLUDE      FO520(IEYEXT)
         NAME         IEYEXT(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK104  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK105 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG117 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.FORTLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
        INCLUDE     SYSPUNCH(IEK205)
      NAME    IHCUATBL(R)
    INCLUDE      SYSPUNCH(IEK206)
     NAME    IHCUOPT(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK105  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK106 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG118 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.FORTLIB
//LM501 DD DSNAME=SYS1.LM501,DISP=SHR,VOLUME=(,RETAIN)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
         INCLUDE    LM501(IHCFIXPI)
         ALIAS      FIXPI#
         NAME       IHCFIXPI(R)
         INCLUDE    LM501(IHCFRXPI)
         ALIAS      FRXPI#
         NAME       IHCFRXPI(R)
         INCLUDE    LM501(IHCFDXPI)
         ALIAS      FDXPI#
         NAME       IHCFDXPI(R)
         INCLUDE    LM501(IHCFRXPR)
         ALIAS      FRXPR#
         NAME       IHCFRXPR(R)
         INCLUDE    LM501(IHCFDXPD)
         ALIAS      FDXPD#
         NAME       IHCFDXPD(R)
         INCLUDE    LM501(IHCDIOSE)
         ALIAS      DIOCS#
         NAME       IHCDIOSE(R)
         INCLUDE    LM501(IHCFIOSH)
         ALIAS      FIOCS#
         NAME       IHCFIOSH(R)
         INCLUDE    LM501(IHCIBERH)
         ALIAS      IBERH#
         NAME       IHCIBERH(R)
         INCLUDE    LM501(IHCCLAS)
         ALIAS      CDMPY#
         ALIAS      CDDVD#
         NAME       IHCCLAS(R)
         INCLUDE    LM501(IHCCSAS)
         ALIAS      CMPY#
         ALIAS      CDVD#
         NAME       IHCCSAS(R)
         INCLUDE    LM501(IHCFCDXI)
         ALIAS      FCDXI#
         NAME       IHCFCDXI(R)
         INCLUDE    LM501(IHCFCXPI)
         ALIAS      FCXPI#
         NAME       IHCFCXPI(R)
         INCLUDE    LM501(IHCFCVTH)
         ALIAS      ADCON#
         NAME       IHCFCVTH(R)
         INCLUDE    LM501(IHCLATN2)
         ALIAS      DATAN
         ALIAS      DATAN2
         NAME       IHCLATN2(R)
         INCLUDE    LM501(IHCSATN2)
         ALIAS      ATAN
         ALIAS      ATAN2
         NAME       IHCSATN2(R)
         INCLUDE    LM501(IHCNAMEL)
         ALIAS      FRDNL#
         ALIAS      FWRNL#
         NAME       IHCNAMEL(R)
         INCLUDE    LM501(IHCDBUG)
         ALIAS      DEBUG#
         NAME       IHCDBUG(R)
     INCLUDE     LM501(IHCFCOMH)
     ALIAS       IBCOM#
     NAME      IHCFCOMH(R)
     INCLUDE   LM501(IHCFINTH)
     ALIAS     ARITH#
     NAME      IHCFINTH(R)
   INCLUDE   LM501(IHCTRCH)
   ALIAS      IHCERRM
   ALIAS      ERRMON
   NAME    IHCTRCH(R)
         INCLUDE    LM501(IHCCGOTO)
         ALIAS      CGOTO#
         NAME       IHCCGOTO(R)
         INCLUDE    LM501(IHCIBERR)
         ALIAS      IBERR#
         NAME       IHCIBERR(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK106  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK107 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG119 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,OVLY'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IERRCM)
//SM023 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.SM023
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE   SM023(IERRCM)
 INCLUDE SYSPUNCH(IERAM1)
 INCLUDE   SM023(IERRCU)
 OVERLAY A01
 INCLUDE  SM023(IER8CM)
 OVERLAY A01
 INCLUDE   SM023(IERRCQ)
 OVERLAY A02
 INCLUDE   SM023(IERRCC,IERRCY)
 OVERLAY A02
 INCLUDE   SM023(IERRCD,IERRC3)
 OVERLAY A03
 INCLUDE   SM023(IERRCE,IERRCF)
 OVERLAY A03
 INCLUDE   SM023(IERRCG,IERRCW)
 OVERLAY A03
 INCLUDE   SM023(IERRCH,IERRCX)
 OVERLAY A02
 INCLUDE   SM023(IERRCP)
 OVERLAY A01
 INCLUDE   SM023(IERRCI)
 INCLUDE  SM023(IER8CI)
 OVERLAY A01
 INCLUDE   SM023(IERRC2)
 OVERLAY A01
 INCLUDE   SM023(IERRCN)
 OVERLAY A01
 INCLUDE  SM023(IERBGB)
 OVERLAY A01
 INCLUDE   SM023(IERRCK)
 OVERLAY A01
 ENTRY IERRCM
 NAME IERRCM(R)
 INCLUDE   SM023(IERRCZ)
 INCLUDE   SM023(IERRCU)
 OVERLAY B01
 INCLUDE   SM023(IERRC1)
 OVERLAY B01
 INCLUDE   SM023(IERRC4)
 OVERLAY B01
 INCLUDE   SM023(IERRCJ)
 OVERLAY B01
 INCLUDE   SM023(IERAO1)
 OVERLAY B01
 INCLUDE   SM023(IERAOL)
 OVERLAY B01
 INCLUDE   SM023(IERAOM)
 ENTRY IERRCZ
 NAME IERRCZ(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK107  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK108 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG120 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEPCBL00)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE SYSPUNCH(IEPCBL00)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK108  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK109 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG121 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IKFCBL01)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE SYSPUNCH(IKFCBL01)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK109  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK110 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG122 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEX00)
//AL531  DD    DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AL531
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE SYSPUNCH(IEXCWKA)
 INCLUDE AL531(IEX00)
 ENTRY IEX00000
 ALIAS ALGOL
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK110  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK111 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG123 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//AL531  DD    DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AL531
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE AL531(IEX21)
 INCLUDE AL531(IEX21M)
 ENTRY IEX21000
 ALIAS IEX21000
 NAME IEX21(R)
 INCLUDE AL531(IEX31)
 INCLUDE AL531(IEX31M)
 ENTRY IEX31000
 ALIAS IEX31000
 NAME IEX31(R)
 INCLUDE AL531(IEX51)
 INCLUDE AL531(IEX51M)
 ENTRY IEX51000
 ALIAS IEX51000,IEX51002,IEX51ER1,IEX51ER2
 NAME IEX51(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK111  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK112 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG124 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IHIERR)
//LM532  DD    DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM532
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE LM532(IHIERR)
 INCLUDE LM532(IHIERM)
 ENTRY IHIERROR
 ALIAS IHIERROR
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK112  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK113 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG125 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB(IEMAF)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE SYSPUNCH(IEMAF)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK113  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK114 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG126 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//RG038 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.RG038
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE RG038(IESRPG)
 ENTRY IESRPG
 ALIAS RPG
 NAME IESRPG(R)
 INCLUDE RG038(IES00010,IES00910)
 ENTRY IESCEX
 NAME RPG10000(R)
 INCLUDE RG038(IES03010,IES03910)
 ENTRY IESCEX
 NAME RPG10030(R)
 INCLUDE RG038(IES04010,IES04910)
 ENTRY IESCEX
 NAME RPG10040(R)
 INCLUDE RG038(IES05010,IES05910)
 ENTRY IESCEX
 NAME RPG10050(R)
 INCLUDE RG038(IES06010,IES06910)
 ENTRY IESCEX
 NAME RPG10060(R)
 INCLUDE RG038(IES07010,IES07910)
 ENTRY IESCEX
 NAME RPG10070(R)
 INCLUDE RG038(IES08010,IES08910)
 ENTRY IESCEX
 NAME RPG10080(R)
 INCLUDE RG038(IES08A10)
 ENTRY IES08A10
 NAME RPG1008A(R)
 INCLUDE RG038(IES09010,IES09910)
 ENTRY IESCEX
 NAME RPG10090(R)
 INCLUDE RG038(IES10010,IES10910)
 ENTRY IESCEX
 NAME RPG10100(R)
 INCLUDE RG038(IES11010,IES11910)
 ENTRY IESCEX
 NAME RPG10110(R)
 INCLUDE RG038(IES12010,IES12910)
 ENTRY IESCEX
 NAME RPG10120(R)
 INCLUDE RG038(IES13010,IES13910)
 ENTRY IESCEX
 NAME RPG10130(R)
 INCLUDE RG038(IES14010,IES14910)
 ENTRY IESCEX
 NAME RPG10140(R)
 INCLUDE RG038(IES15010,IES15910)
 ENTRY IESCEX
 NAME RPG10150(R)
 INCLUDE RG038(IES16010,IES16910)
 ENTRY IESCEX
 NAME RPG10160(R)
 INCLUDE RG038(IES17010,IES17910)
 ENTRY IESCEX
 NAME RPG10170(R)
 INCLUDE RG038(IES18010,IES18910)
 ENTRY IESCEX
 NAME RPG10180(R)
 INCLUDE RG038(IES19010,IES19910)
 ENTRY IESCEX
 NAME RPG10190(R)
 INCLUDE RG038(IES20010,IES20910)
 ENTRY IESCEX
 NAME RPG10200(R)
 INCLUDE RG038(IES21010,IES21910)
 ENTRY IESCEX
 NAME RPG10210(R)
 INCLUDE RG038(IES22010,IES22910)
 ENTRY IESCEX
 NAME RPG10220(R)
 INCLUDE RG038(IES23010,IES23910)
 ENTRY IESCEX
 NAME RPG10230(R)
 INCLUDE RG038(IES24010,IES24110,IES24210)
 INCLUDE RG038(IES24310,IES24410,IES24510)
 INCLUDE RG038(IES24610,IES24710,IES24910)
 ENTRY IESCEX
 NAME RPG10240(R)
 INCLUDE RG038(IES25010)
 ENTRY IES25010
 NAME RPG10250(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK114  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK115 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG127 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//AS037 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AS037
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE  AS037(IEUASM)
 ENTRY IEUASM
 ALIAS ASMBLR
 NAME IEUASM(R)
 INCLUDE  AS037(IEUFI)
 ENTRY IEUFI
 NAME IEUFI(R)
 INCLUDE  AS037(IEUFPP)
 INCLUDE  AS037(IEUFD)
 ENTRY IEUFPP
 NAME IEUFPP(R)
 INCLUDE  AS037(IEUF1)
 ENTRY IEUF1
 NAME IEUF1(R)
 INCLUDE  AS037(IEUF2)
 INCLUDE  AS037(IEUF2A)
 ENTRY IEUF2
 NAME IEUF2(R)
 INCLUDE  AS037(IEUF3)
 ENTRY IEUF3
 NAME IEUF3(R)
 INCLUDE  AS037(IEUF3E)
 NAME IEUF3E(R)
 INCLUDE  AS037(IEUF7C)
 INCLUDE  AS037(IEUF7D)
 INCLUDE  AS037(IEUF7E)
 INCLUDE  AS037(IEUF7G)
 INCLUDE  AS037(IEUF7I)
 INCLUDE  AS037(IEUF7N)
 INCLUDE  AS037(IEUF7V)
 INCLUDE  AS037(IEUF7X)
 ENTRY IEUF7
 NAME IEUF7(R)
 INCLUDE  AS037(IEUF8A)
 INCLUDE  AS037(IEUF8C)
 INCLUDE  AS037(IEUF8D)
 INCLUDE  AS037(IEUF8I)
 INCLUDE  AS037(IEUF8L)
 INCLUDE  AS037(IEUF8M)
 INCLUDE  AS037(IEUF8N)
 INCLUDE  AS037(IEUF8P)
 INCLUDE  AS037(IEUF8S)
 INCLUDE  AS037(IEUF8V)
 ENTRY IEUF8
 NAME IEUF8(R)
 INCLUDE  AS037(IEUMAC)
 ENTRY IEUMAC
 NAME IEUMAC(R)
 INCLUDE  AS037(IEURTA)
 ENTRY IEURTA
 NAME IEURTA(R)
 INCLUDE  AS037(IEUERR)
 NAME IEUERR(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK115  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK116 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG128 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,OVLY,XCAL,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//ED521  DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.ED521    'F' EDITORS
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE ED521(IEWLMROU,IEWLMAPT,IEWLMINT,IEWLMOPT)
 INCLUDE ED521(IEWLMINP,IEWLMRAT,IEWLMEND,IEWLMESD)
 INCLUDE ED521(IEWLMRCG,IEWLMSYM,IEWLMINC,IEWLMSCN)
 INCLUDE ED521(IEWLMADA,IEWLMOUT,IEWLMENT,IEWLMENS)
 INCLUDE ED521(IEWLMFNL,IEWLMBTP,IEWLMMAP,IEWLMSCD)
 INCLUDE ED521(IEWLMREL,IEWLMIDR)
 INCLUDE SYSPUNCH(IEWLM128)
 ALIAS LINKEDIT
 ALIAS IEWL
 ENTRY IEWLMROU
 NAME IEWLF128(R)       * * *   IEW0201   CANCEL OVERLAY FOR F128
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK116  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK117 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG129 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//PL552 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.PL552
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE  PL552(IKM001,IKM02,IKM03,IKM11,IKM12)
 INCLUDE  PL552(IKM131,IKM132,IKM133,IKM134)
 INCLUDE  PL552(IKM135,IKM136)
 ENTRY IKM001
 ALIAS  PLICHK20
 ALIAS PLIFSCAN
 ALIAS PLISCAN
 NAME  IKM001(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK117  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK118 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG130 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//FO550 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.FO550
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE FO550(IPDSN,IPDER)
  NAME IPDSNEXC(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK118  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK119 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG131 EXEC PGM=IEWL,COND=(8,LT),REGION=200K,                       XXXXXXXXXX
//             PARM='NCAL,LIST,XREF,RENT,REFR,REUS,OL'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SYSUT3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=MVT1.LINKLIB
//LD547  DD DSNAME=SYS1.LD547,DISP=SHR,VOLUME=(,RETAIN)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE LD547(IEWLDIOC,IEWLDREL,IEWLDLIB,IEWLDIDY)
 INCLUDE SYSPUNCH(IEWLDDEF)
 ENTRY IEWLIOCA
 ALIAS IEWLOAD
 NAME IEWLOADR(R)
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK119  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21CY120 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG132  EXEC PGM=IEBCOPY,COND=(8,LT)
//SYSUT3  DD DISP=OLD,DSN=SYS1.SYSUT3
//SYSUT4 DD DISP=SHR,DSNAME=SYS1.SYSUT4
//SYSPRINT DD SPACE=(121,(750,100),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3630),                  X
//             SYSOUT=A
//PARMLIBA DD DSNAME=SYS1.DPARMLIB,
// DISP=SHR
//PARMLIB DD DSNAME=MVT1.PARMLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//NL511 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.NL511
//LM512 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM512
//PL1LIBA DD DSNAME=SYS1.DPL1LIB,
// DISP=SHR
//PL1LIB DD DSNAME=MVT1.PL1LIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=3330,DISP=OLD
//LM501 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM501
//FORTLIBA DD DSNAME=SYS1.DFORTLIB,
// DISP=SHR
//FORTLIB DD DSNAME=MVT1.FORTLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//CO503 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CO503
//CB545  DD  DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CB545
//COBLIBA DD DSNAME=SYS1.DCOBLIB,
// DISP=SHR
//LM546  DD  DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM546
//COBLIB DD DSNAME=MVT1.COBLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=3330,DISP=OLD
//SM023 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.SM023
//SORTLIBA DD DSNAME=SYS1.DSORTLIB,
// DISP=SHR
//SORTLIB DD DSNAME=MVT1.SORTLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//AL531 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AL531
//LM532 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM532
//ALGLIB DD DSNAME=MVT1.ALGLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=3330,DISP=OLD
//PROCLIBA DD DSNAME=SYS1.DPROCLIB,
// DISP=SHR
//PROCLIB DD DSNAME=MVT1.PROCLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//LD547 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LD547
//PL552 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.PL552
//FO550 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.FO550
//SVCLIB DD DSNAME=MVT1.SVCLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=3330,DISP=OLD
//LINKLIB DD DSNAME=MVT1.LINKLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//SYSIN DD *
 COPY OUTDD=LINKLIB,INDD=NL511
 COPY OUTDD=LINKLIB,INDD=LM512
 SELECT MEMBER=(IHEOPNA,IHEOPOA,IHEOPPA,IHEOPQA,IHEOPZA)
 SELECT MEMBER=(IHETOMA,IHETOMB,IHETOMC,IHETOMD,IHETOME)
 SELECT MEMBER=(IHECLSA)
 SELECT MEMBER=(IHEITBA,IHEITCA)
 SELECT MEMBER=(IHEITDA,IHEITEA)
 SELECT MEMBER=(IHEITFA,IHEITGA)
 SELECT MEMBER=(IHEITKA,IHEITLA)
 SELECT MEMBER=(IHEITJA,IHEITHA)
 SELECT MEMBER=(IHECLTA,IHECLTB,IHECTTA,IHECTTB,IHECTTC)
 SELECT MEMBER=(IHEERNA,IHEERSA,IHEESSA,IHEESSB,IHEERSB)
 SELECT MEMBER=(IHEESMA,IHEESMB)
 SELECT MEMBER=(IHEERIA,IHEERDA,IHEEREA,IHEEROA,IHEERPA)
 SELECT MEMBER=(IHEERTA,IHETEXA,IHETEXB,IHETEXC)
 SELECT MEMBER=(IHEZZAA,IHEZZBA)
 SELECT MEMBER=(IHEZZCA,IHEZZFA)
 SELECT MEMBER=(IHESUBA,IHEITPA,IHESTAA)
 SELECT MEMBER=(IHEITMA,IHEITNA,IHEITOA)
 COPY OUTDD=PL1LIB,INDD=PL1LIBA
 COPY OUTDD=PL1LIB,INDD=LM512
 SELECT MEMBER=(IHEVCSA,IHEVCSB,IHEVCS)
 SELECT MEMBER=(IHEOSTA)
 SELECT MEMBER=(IHEOSIA)
 SELECT MEMBER=(IHEOSWA)
 COPY OUTDD=FORTLIB,INDD=LM501
 SELECT MEMBER=(IHCLLOG,DLOG,DLOG10,IHCSLOG,ALOG,ALOG10)
 SELECT MEMBER=(IHCLEXP,DEXP,IHCSEXP,EXP,IHCLSQRT,DSQRT)
 SELECT MEMBER=(IHCSSQRT,SQRT,IHCFMAXD,DMAX1,DMIN1)
 SELECT MEMBER=(IHCFMAXI,AMAX0,AMIN0,MAX0,MIN0)
 SELECT MEMBER=(IHCFMAXR,AMAX1,AMIN1,MAX1,MIN1)
 SELECT MEMBER=(IHCLSCN,DSIN,DCOS,IHCSSCN,SIN,COS)
 SELECT MEMBER=(IHCLTANH,DTANH,IHCSTANH,TANH)
 SELECT MEMBER=(IHCFSLIT,SLITE,SLITET,IHCFOVER,OVERFL)
 SELECT MEMBER=(IHCFDVCH,DVCHK,IHCFEXIT,EXIT,IHCFDUMP,DUMP,PDUMP)
 SELECT MEMBER=(IHCCLLOG,CDLOG,IHCCSLOG,CLOG,IHCCLEXP,CDEXP)
 SELECT MEMBER=(IHCCSEXP,CEXP,IHCCLSQT,CDSQRT,IHCCSSQT,CSQRT)
 SELECT MEMBER=(IHCLASCN,DARSIN,DARCOS)
 SELECT MEMBER=(IHCSASCN,ARSIN,ARCOS)
 SELECT MEMBER=(IHCSGAMA,GAMMA,ALGAMA)
 SELECT MEMBER=(IHCCLSCN,CDSIN,CDCOS)
 SELECT MEMBER=(IHCCSSCN,CSIN,CCOS,IHCLTNCT,DTAN,DCOTAN)
 SELECT MEMBER=(IHCSTNCT,TAN,COTAN,IHCLSCNH,DSINH,DCOSH)
 SELECT MEMBER=(IHCSSCNH,SINH,COSH)
 SELECT MEMBER=(IHCCLABS,CDABS,IHCCSABS,CABS)
 SELECT MEMBER=(IHCLERF,DERF,DERFC,IHCSERF,ERF,ERFC)
 SELECT MEMBER=(IHCLGAMA,DGAMMA,DLGAMA)
 SELECT MEMBER=(IHCFMODI,MOD,IHCFMODR,DMOD,AMOD)
 SELECT MEMBER=(IHCFAINT,AINT,IHCFIFIX,IDINT,INT)
 COPY OUTDD=LINKLIB,INDD=LM501
 SELECT MEMBER=(IHCSTAE)
 SELECT MEMBER=(IHCADJST)
 COPY OUTDD=FORTLIB,INDD=FORTLIBA
  EXCLUDE  MEMBER=IHCUATBL
 EXCLUDE MEMBER=IHCFCOME
 EXCLUDE MEMBER=IHCIBERR
 EXCLUDE MEMBER=IHCCGOTO
 EXCLUDE MEMBER=IHCLLOG
 EXCLUDE MEMBER=DLOG
 EXCLUDE MEMBER=DLOG10
 EXCLUDE MEMBER=IHCSLOG
 EXCLUDE MEMBER=ALOG
 EXCLUDE MEMBER=ALOG10
 EXCLUDE MEMBER=IHCLEXP
 EXCLUDE MEMBER=DEXP
 EXCLUDE MEMBER=IHCSEXP
 EXCLUDE MEMBER=EXP
 EXCLUDE MEMBER=IHCLSQRT
 EXCLUDE MEMBER=DSQRT
 EXCLUDE MEMBER=IHCSSQRT
 EXCLUDE MEMBER=SQRT
 EXCLUDE MEMBER=IHCLATAN
 EXCLUDE MEMBER=DATAN
 EXCLUDE MEMBER=IHCSATAN
 EXCLUDE MEMBER=ATAN
 EXCLUDE MEMBER=IHCFMAXD
 EXCLUDE MEMBER=DMAX1
 EXCLUDE MEMBER=DMIN1
 EXCLUDE MEMBER=IHCFMAXI
 EXCLUDE MEMBER=AMAX0
 EXCLUDE MEMBER=AMIN0
 EXCLUDE MEMBER=MAX0
 EXCLUDE MEMBER=MIN0
 EXCLUDE MEMBER=IHCFMAXR
 EXCLUDE MEMBER=AMAX1
 EXCLUDE MEMBER=AMIN1
 EXCLUDE MEMBER=MAX1
 EXCLUDE MEMBER=MIN1
 EXCLUDE MEMBER=IHCFMODI
 EXCLUDE MEMBER=MOD
 EXCLUDE MEMBER=IHCFMODR
 EXCLUDE MEMBER=DMOD
 EXCLUDE MEMBER=AMOD
 EXCLUDE MEMBER=IHCFAINT
 EXCLUDE MEMBER=AINT
 EXCLUDE MEMBER=IHCFIFIX
 EXCLUDE MEMBER=IDINT
 EXCLUDE MEMBER=INT
 EXCLUDE MEMBER=IFIX
 EXCLUDE MEMBER=IHCFIXPI
 EXCLUDE MEMBER=IHCFRXPI
 EXCLUDE MEMBER=IHCLSCN
 EXCLUDE MEMBER=DSIN
 EXCLUDE MEMBER=DCOS
 EXCLUDE MEMBER=IHCSSCN
 EXCLUDE MEMBER=SIN
 EXCLUDE MEMBER=COS
 EXCLUDE MEMBER=IHCLTANH
 EXCLUDE MEMBER=DTANH
 EXCLUDE MEMBER=IHCSTANH
 EXCLUDE MEMBER=TANH
 EXCLUDE MEMBER=IHCFDXPI
 EXCLUDE MEMBER=IHCFRXPR
 EXCLUDE MEMBER=IHCFDXPD
 EXCLUDE MEMBER=IHCFSLIT
 EXCLUDE MEMBER=SLITE
 EXCLUDE MEMBER=SLITET
 EXCLUDE MEMBER=IHCFOVER
 EXCLUDE MEMBER=OVERFL
 EXCLUDE MEMBER=IHCFDVCH
 EXCLUDE MEMBER=DVCHK
 EXCLUDE MEMBER=IHCFEXIT
 EXCLUDE MEMBER=EXIT
 EXCLUDE MEMBER=IHCFDUMP
 EXCLUDE MEMBER=DUMP
 EXCLUDE MEMBER=PDUMP
 EXCLUDE MEMBER=IHCFLOAT
 EXCLUDE MEMBER=DFLOAT
 EXCLUDE MEMBER=FLOAT
 EXCLUDE MEMBER=IHCIBERH
 EXCLUDE MEMBER=IHCCLLOG
 EXCLUDE MEMBER=CDLOG
 EXCLUDE MEMBER=IHCCSLOG
 EXCLUDE MEMBER=CLOG
 EXCLUDE MEMBER=IHCCLEXP
 EXCLUDE MEMBER=CDEXP
 EXCLUDE MEMBER=IHCCSEXP
 EXCLUDE MEMBER=CEXP
 EXCLUDE MEMBER=IHCCLSQT
 EXCLUDE MEMBER=CDSQRT
 EXCLUDE MEMBER=IHCCSSQT
 EXCLUDE MEMBER=CSQRT
 EXCLUDE MEMBER=IHCLASCN
 EXCLUDE MEMBER=DARSIN
 EXCLUDE MEMBER=DARCOS
 EXCLUDE MEMBER=IHCSASCN
 EXCLUDE MEMBER=ARSIN
 EXCLUDE MEMBER=ARCOS
 EXCLUDE MEMBER=IHCSGAMA
 EXCLUDE MEMBER=GAMMA
 EXCLUDE MEMBER=ALGAMA
 EXCLUDE MEMBER=IHCCLAS
 EXCLUDE MEMBER=IHCCSAS
 EXCLUDE MEMBER=IHCFCDXI
 EXCLUDE MEMBER=IHCFCXPI
 EXCLUDE MEMBER=IHCCLSCN
 EXCLUDE MEMBER=CDSIN
 EXCLUDE MEMBER=CDCOS
 EXCLUDE MEMBER=IHCCSSCN
 EXCLUDE MEMBER=CSIN
 EXCLUDE MEMBER=CCOS
 EXCLUDE MEMBER=IHCLTNCT
 EXCLUDE MEMBER=DTAN
 EXCLUDE MEMBER=DCOTAN
 EXCLUDE MEMBER=IHCSTNCT
 EXCLUDE MEMBER=TAN
 EXCLUDE MEMBER=COTAN
 EXCLUDE MEMBER=IHCLSCNH
 EXCLUDE MEMBER=DSINH
 EXCLUDE MEMBER=DCOSH
 EXCLUDE MEMBER=IHCSSCNH
 EXCLUDE MEMBER=SINH
 EXCLUDE MEMBER=COSH
 EXCLUDE MEMBER=IHCCLABS
 EXCLUDE MEMBER=CDABS
 EXCLUDE MEMBER=IHCCSABS
 EXCLUDE MEMBER=CABS
 EXCLUDE MEMBER=IHCLERF
 EXCLUDE MEMBER=DERF
 EXCLUDE MEMBER=DERFC
 EXCLUDE MEMBER=IHCSERF
 EXCLUDE MEMBER=ERF
 EXCLUDE MEMBER=ERFC
 EXCLUDE MEMBER=IHCLGAMA
 EXCLUDE MEMBER=DGAMMA
 EXCLUDE MEMBER=DLGAMA
 EXCLUDE MEMBER=IHCFCOMH
 EXCLUDE MEMBER=IHCFCVTH
 EXCLUDE MEMBER=IHCDBUG
 EXCLUDE MEMBER=IHCFIOSH
 EXCLUDE MEMBER=IHCLATN2
 EXCLUDE MEMBER=DATN2
 EXCLUDE MEMBER=IHCSATN2
 EXCLUDE MEMBER=ATAN2
 EXCLUDE MEMBER=IHCNAMEL
 EXCLUDE MEMBER=IHCDIOSE
 EXCLUDE MEMBER=IHCTRCH
 EXCLUDE MEMBER=IHCUOPT
 EXCLUDE MEMBER=IHCFINTH
 EXCLUDE MEMBER=IHCEFNTH
 EXCLUDE MEMBER=IHCETRCH
 EXCLUDE MEMBER=IHCERRM
 EXCLUDE MEMBER=ERRMON
 EXCLUDE MEMBER=ERRTRA
 EXCLUDE MEMBER=IHCEDIOS
 EXCLUDE MEMBER=IHCEFIOS
 EXCLUDE MEMBER=FIOCSB
 EXCLUDE MEMBER=IHCECOMH
 EXCLUDE MEMBER=IHCERRE
 EXCLUDE MEMBER=IHCFOPT
 EXCLUDE MEMBER=ERRSET
 EXCLUDE MEMBER=ERRSAV
 EXCLUDE MEMBER=ERRSTR
 COPY OUTDD=LINKLIB,INDD=CO503
 COPY OUTDD=LINKLIB,INDD=CB545
 COPY OUTDD=COBLIB,INDD=COBLIBA
 SELECT MEMBER=(IHD00000)
 SELECT MEMBER=(IHD00001)
 SELECT MEMBER=(IHD00100)
 SELECT MEMBER=(IHD00101)
 SELECT MEMBER=(IHD00200)
 SELECT MEMBER=(IHD00201)
 SELECT MEMBER=(IHD00300)
 SELECT MEMBER=(IHD00301)
 SELECT MEMBER=(IHD00400)
 SELECT MEMBER=(IHD00401)
 SELECT MEMBER=(IHD00500)
 SELECT MEMBER=(IHD00501)
 SELECT MEMBER=(IHD00600)
 SELECT MEMBER=(IHD00601)
 SELECT MEMBER=(IHD00602)
 SELECT MEMBER=(IHD00700)
 SELECT MEMBER=(IHD00701)
 SELECT MEMBER=(IHD00800)
 SELECT MEMBER=(IHD00801)
 SELECT MEMBER=(IHD00802)
 SELECT MEMBER=(IHD00900)
 SELECT MEMBER=(IHD00901)
 SELECT MEMBER=(IHD01000)
 SELECT MEMBER=(IHD01001)
 SELECT MEMBER=(IHD01002)
 SELECT MEMBER=(IHD01100)
 SELECT MEMBER=(IHD01101)
 SELECT MEMBER=(IHD01102)
 SELECT MEMBER=(IHD01200)
 SELECT MEMBER=(IHD01201)
 SELECT MEMBER=(IHD01300)
 SELECT MEMBER=(IHD01301)
 SELECT MEMBER=(IHD01400)
 SELECT MEMBER=(IHD01401)
 SELECT MEMBER=(IHD01500)
 SELECT MEMBER=(IHD01501)
 SELECT MEMBER=(IHD01502)
 SELECT MEMBER=(IHD01504)
 SELECT MEMBER=(IHD01600)
 SELECT MEMBER=(IHD01601)
 SELECT MEMBER=(IHD01602)
 SELECT MEMBER=(IHD01700)
 SELECT MEMBER=(IHD01701)
 SELECT MEMBER=(IHD01800)
 SELECT MEMBER=(IHD01801)
 SELECT MEMBER=(IHD01802)
 SELECT MEMBER=(IHD01900)
 SELECT MEMBER=(IHD01901)
 SELECT MEMBER=(IHD01902)
 SELECT MEMBER=(IHD01904)
 SELECT MEMBER=(IHD01908)
 SELECT MEMBER=(IHD02000)
 SELECT MEMBER=(IHD02001)
 SELECT MEMBER=(IHD02002)
 SELECT MEMBER=(IHD02100)
 SELECT MEMBER=(IHD02101)
 SELECT MEMBER=(IHD02200)
 SELECT MEMBER=(IHD02201)
 SELECT MEMBER=(IHD02300)
 SELECT MEMBER=(IHD02301)
 SELECT MEMBER=(IHD02302)
 SELECT MEMBER=(IHD02304)
 SELECT MEMBER=(IHD02400)
 SELECT MEMBER=(IHD02401)
 SELECT MEMBER=(IHD02500)
 SELECT MEMBER=(IHD02501)
 SELECT MEMBER=(IHD02600)
 SELECT MEMBER=(IHD02601)
 SELECT MEMBER=(IHD02700)
 SELECT MEMBER=(IHD02701)
 SELECT MEMBER=(IHD02800)
 SELECT MEMBER=(IHD02801)
 SELECT MEMBER=(IHD02802)
 SELECT MEMBER=(IHD02900)
 SELECT MEMBER=(IHD02901)
 SELECT MEMBER=(IHD03001)
 SELECT MEMBER=(IHD03002)
 SELECT MEMBER=(IHD03004)
 SELECT MEMBER=(IHD03008)
 SELECT MEMBER=(IHD03101)
 SELECT MEMBER=(IHD03102)
 SELECT MEMBER=(IHD03104)
 SELECT MEMBER=(IHD03108)
 SELECT MEMBER=(IHD03300)
 SELECT MEMBER=(IHD03301)
 SELECT MEMBER=(IHD03402)
 SELECT MEMBER=(IHD03801)
 SELECT MEMBER=(IHD03900)
 SELECT MEMBER=(IHD03901)
 SELECT MEMBER=(IHD04000)
 SELECT MEMBER=(IHD04001)
 SELECT MEMBER=(IHD04100)
 SELECT MEMBER=(IHD04101)
 COPY OUTDD=COBLIB,INDD=LM546
 COPY OUTDD=LINKLIB,INDD=SM023
           SELECT MEMBER=(IERRCO00,SORT,IERRCB)
 COPY OUTDD=SORTLIB,INDD=SORTLIBA
 SELECT MEMBER=(IERABQ,IERABR,IERADL,IERADM,IERAGH)
 SELECT MEMBER=(IERAMA,IERAMB,IERAMC,IERDM4,IERAPI)
 SELECT MEMBER=(IERRMB,IERRMC,IERRPG,IERAPJ,IERAP1)
 SELECT MEMBER=(IERAP2,IERRCT,IERRC6,IERRC7,IERRC8,IERRC9)
 SELECT MEMBER=(IERAP3,IERRCV,IERRDL,IERRGA,IERRMA)
 SELECT MEMBER=(IERAOV,IERROV,IERAOQ,IERROQ,IERAPC)
 SELECT MEMBER=(IERCHK,IERRPF,IERAPH,IERAPG,IERRPC)
 COPY OUTDD=SORTLIB,INDD=SM023
           SELECT MEMBER=(IERAGO,IERRGO,IERAGP,IERRGP)
           SELECT MEMBER=(IERAOO,IERROO,IERAO3,IERRO3)
           SELECT MEMBER=(IERAPN,IERRPN,IERAPO,IERRPO)
           SELECT MEMBER=(IERAGK)
 SELECT MEMBER=(IERRGC,IERRGE,IERROK,IERROT,IERRPE)
 SELECT MEMBER=(IERRPB,IERAGC,IERAGE,IERAOK,IERAOT)
 SELECT MEMBER=(IERAPE,IERAPB,IERAGI,IERAGJ)
           SELECT MEMBER=(IERAPL)
           SELECT MEMBER=(IER8GB,IER9GB,IER8GC,IER9GC)
           SELECT MEMBER=(IER8PA,IER9PA,IER8ON,IER9ON)
           SELECT MEMBER=(IER9GN,IER8PM)
           SELECT MEMBER=(IERRBL,IERABL,IERRDH,IERADH)
           SELECT MEMBER=(IERAOB,IERROB,IERABS)
 SELECT MEMBER=(IERRBB,IERRBG,IERRDB,IERABB,IERABG)
 SELECT MEMBER=(IERADB)
           SELECT MEMBER=(IERRBP,IERABP)
 SELECT MEMBER=(IERRBC,IERRBH,IERRDC,IERABC,IERABH)
 SELECT MEMBER=(IERADC)
           SELECT MEMBER=(IERRDI,IERADI,IERRBN,IERABN)
           SELECT MEMBER=(IERAOD,IERROD)
 SELECT MEMBER=(IERRBE,IERRBF,IERRBI,IERRDG,IERABE)
 SELECT MEMBER=(IERABF,IERABI,IERADG)
 SELECT MEMBER=(IER8BN,IER9BN)
           SELECT MEMBER=(IERAOX,IERROX,IERADP,IERRDP)
           SELECT MEMBER=(IERABT,IERRBT,IERABY,IERRBY)
           SELECT MEMBER=(IERABA,IERRBA,IERABV,IERRBV)
           SELECT MEMBER=(IERAOZ,IERROZ,IERADT,IERRDT)
           SELECT MEMBER=(IERABU,IERRBU,IERABZ,IERRBZ)
           SELECT MEMBER=(IERADQ,IERRDQ)
           SELECT MEMBER=(IERAOU,IERROU)
           SELECT MEMBER=(IERROP,IERAOP)
           SELECT MEMBER=(IERROA,IERAOA)
           SELECT MEMBER=(IERROW,IERAOW)
           SELECT MEMBER=(IERAOC,IERROC)
           SELECT MEMBER=(IERAOY,IERROY)
 COPY OUTDD=LINKLIB,INDD=AL531
 SELECT MEMBER=(IEX10,IEX11,IEX20,IEX30,IEX40,IEX50)
 SELECT MEMBER=(IEX10000,IEX11000,IEX20000,IEX30000)
 SELECT MEMBER=(IEX40000,IEX50000)
 COPY OUTDD=ALGLIB,INDD=LM532
 SELECT MEMBER=(IHIFDD,IHIFDI,IHIFII,IHIFRI,IHIFRR)
 SELECT MEMBER=(IHIFSA,IHIGPR,IHIIAR,IHIIBA,IHIIBO)
 SELECT MEMBER=(IHIIDE,IHIIOR,IHIISY,IHILAT,IHILEX)
 SELECT MEMBER=(IHILLO,IHILOR,IHILSC,IHILSQ,IHIOAR)
 SELECT MEMBER=(IHIOBA,IHIOBO,IHIOIN,IHIOST,IHIOSY)
 SELECT MEMBER=(IHIOTA,IHIPTT,IHISAT,IHISEX,IHISLO)
 SELECT MEMBER=(IHISOR,IHISSC,IHISSQ,IHISYS)
 SELECT MEMBER=(IHIFSAIN,IHIGPRCL,IHIGPRGT,IHIGPRPT)
 SELECT MEMBER=(IHIIARRT,IHIIARRY,IHIIBARR,IHIIBOAR)
 SELECT MEMBER=(IHIIBOOL,IHIIDEAI,IHIIDEII,IHIIDEIR)
 SELECT MEMBER=(IHIIOREN,IHIIOREV,IHIIORNX,IHIIOROP)
 SELECT MEMBER=(IHIOBOOL,IHIOINAR,IHIOINTG,IHIOSTRG)
 SELECT MEMBER=(IHIOSYMB,IHIOTARR,IHIPTTAB,IHISORAR)
 SELECT MEMBER=(IHIISYMB,IHILORAR,IHILOREL,IHILSCC)
 SELECT MEMBER=(IHIOARRY,IHIOBARR,IHIOBOAR,IHILSCS)
 SELECT MEMBER=(IHISOREL,IHISYSCT,IHISSCC,IHISSCS)
 COPY OUTDD=LINKLIB,INDD=LD547
 SELECT MEMBER=(IEWLDRGO,LOADER)    LOADER IS ALIAS
 COPY OUTDD=LINKLIB,INDD=PL552
 SELECT MEMBER=(IKM21,IKM22,IKM23)
 COPY OUTDD=LINKLIB,INDD=FO550
  SELECT MEMBER=(IPDAGH)
 COPY OUTDD=PARMLIB,INDD=PARMLIBA
  COPY OUTDD=PROCLIB,INDD=PROCLIBA
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21CY120  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21IO121 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG133 EXEC PGM=IEHIOSUP,PARM=TSO,COND=(8,LT)
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD DSNAME=MVT1.SVCLIB,DISP=(OLD,PASS),                    XXXXXXXX
//             VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21IO121  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//
//R21LK122 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG134 EXEC PGM=IFCDIP00,COND=(8,LT)
//STEPLIB DD   DSN=SYS1.CI505,DISP=SHR
//SERERDS DD   DSN=MVT1.LOGREC,DISP=(NEW,KEEP),                    XXXXXXXXX
//             VOLUME=(,RETAIN,SER=MVTRES),                          XXXXXXXXX
//             SPACE=(TRK,(18),,CONTIG),UNIT=3330
//ASRFRSH DD   DSNAME=MVT1.ASRLIB,DISP=(NEW,KEEP),                 XXXXXXXXX
//             VOLUME=(,RETAIN,SER=MVTRES),                          XXXXXXXXX
//             SPACE=(TRK,(5),,CONTIG),UNIT=3330
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK122  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21LK123 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG135 EXEC PGM=IEHPROGM,COND=(8,LT)
//TARG DD VOLUME=SER=MVTRES,DISP=OLD,UNIT=3330
//SYSPRINT DD SYSOUT=A
//SYSIN DD *
 CATLG CVOL=3330=MVTRES,VOL=3330=MVTRES,DSNAME=SYS1.LOGREC
 CATLG CVOL=3330=MVTRES,VOL=3330=MVTRES,DSNAME=SYS1.ASRLIB
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21LK123  ** F A I L E D **** F A I L E D ****',
// COND=(4,GE)
//
//R21RN124 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* *** RELEASE 21.8.0  M V T / S M F / H A S P  RELEASE 21.8.0 ***
//SG136 EXEC PGM=IEHPROGM,COND=(8,LT)
//SYSPRINT DD  SYSOUT=A
//SYSRES DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//LINK DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//PRC DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//COB DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//FOR DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//SOR DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//PL1 DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//TEL DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//ALG DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//PAR DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//CMD DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//IMG DD DISP=SHR,VOL=(,RETAIN,SER=MVTRES),UNIT=3330
//SYSIN DD *
 RENAME DSNAME=MVT1.NUCLEUS,NEWNAME=SYS1.NUCLEUS,                  XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.LOGREC,NEWNAME=SYS1.LOGREC,                    XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.ASRLIB,NEWNAME=SYS1.ASRLIB,                    XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.SVCLIB,NEWNAME=SYS1.SVCLIB,                    XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.LINKLIB,NEWNAME=SYS1.LINKLIB,                  XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.PROCLIB,NEWNAME=SYS1.PROCLIB,                  XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.COBLIB,NEWNAME=SYS1.COBLIB,                    XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.FORTLIB,NEWNAME=SYS1.FORTLIB,                  XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.SORTLIB,NEWNAME=SYS1.SORTLIB,                  XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.PL1LIB,NEWNAME=SYS1.PL1LIB,                    XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.TELCMLIB,NEWNAME=SYS1.TELCMLIB,                XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.ALGLIB,NEWNAME=SYS1.ALGLIB,                    XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.PARMLIB,NEWNAME=SYS1.PARMLIB,                  XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.CMDLIB,NEWNAME=SYS1.CMDLIB,                    XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.IMAGELIB,NEWNAME=SYS1.IMAGELIB,                XXXXXXXX
               VOL=3330=MVTRES
 RENAME DSNAME=MVT1.DCMLIB,NEWNAME=SYS1.DCMLIB,                    XXXXXXXX
               VOL=3330=MVTRES
/*
//ZEND  EXEC PGM=ZMSG,
// PARM='**** R21RN124  ** F A I L E D **** F A I L E D ****',
// COND=(0,EQ)
//


