//ALLOCATE JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//IEFBR14  EXEC PGM=IEFBR14
//HERCLIB  DD  DISP=(NEW,CATLG),UNIT=3330,VOL=SER=HERC30,
//             DSN=SYS1.HERCLIB,DCB=(RECFM=U,BLKSIZE=13030),
//             SPACE=(CYL,(25,10,50))
//
