//CATALOG  JOB CLASS=A,MSGLEVEL=(1,1)
//CATALOG  EXEC PGM=IEHPROGM
//SYSPRINT DD  SYSOUT=A
//CVOL     DD  DISP=SHR,UNIT=3330,VOL=SER=MVTRES
//SYSIN    DD  *
 CATLG DSNAME=SYS1.HERCLIB,VOL=3330=HERC30
//
