//FORTHCLG JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//HELOWRLD EXEC FORTHCLG,REGION.FORT=384K
//FORT.SYSLIN DD UNIT=SYSDA
//FORT.SYSABEND DD SYSOUT=A
//FORT.SYSIN DD *
C HELLO WORLD, WE HOPE
        WRITE(6,10)
     10 FORMAT(11HHELLO WORLD)
        END
//
