//MIM#3    JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//PRTMODS  EXEC PGM=MIM#3,REGION=64K,
//             PARM='LIST,DECK,INCL,MAXL=999999,MAXC=99999'
//STEPLIB  DD  DISP=SHR,DSN=SYS1.HERCLIB
//SYSPRINT DD  SYSOUT=A
//SYSPUNCH DD  SYSOUT=B
//INTAPE   DD  DISP=SHR,DSN=MICHMODS,UNIT=TAPE,VOL=SER=SHAR77,
//             LABEL=(3,SL)
//OUTAPE   DD  SYSOUT=A
//SYSIN    DD  *
SFEHDOC
SFEHMODS
SFEHOPT
SFEHOS
SFEHRFIT
SFEHSMP
SFEHS360
SFEH4MRG
//
