//PL1LFCLG JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//HELOWRLD EXEC PL1LFCLG
//PL1L.SYSLIN DD UNIT=SYSDA
//PL1L.SYSIN DD *
 HELLO: PROC OPTIONS(MAIN);
 PUT SKIP LIST('HELLO WORLD');
 END HELLO;
//
