//UNCATLG  JOB CLASS=A,MSGLEVEL=(1,1)
//UNCATLG  EXEC PGM=IEHPROGM
//SYSPRINT DD  SYSOUT=A
//CVOL     DD  DISP=SHR,UNIT=3330,VOL=SER=MVTRES
//SYSIN    DD  *
 UNCATLG DSNAME=SYS1.HERCLIB
//
